{
  "url": "https://www.investopedia.com/terms/s/stockmarket.asp",
  "title": "What Is the Stock Market and How Does It Work?",
  "text": "Definition The stock market consists of a primary market where businesses first issue shares to investors and a secondary market where investors trade shares. What Is the Stock Market? The stock market is a broad term for the network of exchanges, brokerages, and over-the-counter venues where investors buy and sell shares in publicly traded companies. Though people sometimes use stock market to refer to the New York Stock Exchange NYSE or the Nasdaq , these exchanges are components of a wider global marketplace. In the United States, the Securities and Exchange Commission regulates companies that want to sell shares to the public. Businesses must register with the SEC and publish periodic disclosures and financial statements. Key Takeaways Companies issue shares on the stock market to raise capital and expand their business. The Securities Exchange Act of 1934 was created to govern securities transactions on the secondary market. Investors may buy shares to receive dividends, vote in corporate elections, or sell shares at a higher price. Ellen Lindner Investopedia How the Stock Market Works When people refer to the stock market, they often refer to a specific exchange, like the New York Stock Exchange. But the stock market is a larger system of exchanges, brokerages, and over-the-counter markets Anywhere you can buy part of a company is part of the stock market. In this vast, complex network of trading activities, shares of companies are bought and sold, protected by laws against fraud and other unfair trading practices. The stock market plays a crucial role in modern economies by enabling money to move between investors and companies. People purchase stocks for a lot of reasons. Some hold onto shares, looking for income from dividends. Others look for low-priced stocks that are likely to gain value, so that they can sell at a profit. Still, others might be interested in having a say in how particular companies are run. Thats because you can vote at shareholder meetings based on the number of shares you own. Owning shares gives you the right to part of the companys profits, often paid as dividends, and sometimes the right to vote on company matters. Sometimes the best way to see how something works is to look at its parts. In that light, lets review the major elements of the stock market, from the companies selling shares to stocks to exchanges to the indexes that give us a snapshot of the stock markets health What Are Public Companies? Not all companies can offer stock to the public. In the U.S., only companies that are registered with the SEC can sell their shares on a public exchange like the NYSE or Nasdaq. These companies must meet stringent regulations and financial disclosure laws. The traditional route to going public is via an initial public offering IPO. In the 2020s, special purpose acquisition companies SPACs have emerged as an alternative route for going public . The primary market consists of those who buy their shares directly from the company, such as early investors, company insiders, and, for companies going public, financial underwriters . It also includes private placements , where a company sells its shares directly to investors without going through the registration process. Once a company goes public, its stock can be traded in the secondary market via exchanges or over the counter. More than 58,000 companies worldwide are publicly traded today. Stocks Buying and Selling Shares When you buy a stock or a share, youre getting a piece of that company. How much of the company you own depends on the number of shares the company has issued and the number of shares you own. If its a small, private company, a single share could represent a large part of the company. Major public companies often have millions, even billions, of shares. For example, Apple Inc. AAPL has billions of shares in circulation, so a single share is just a tiny fraction of the company. The price of a stock changes based on the demand for shares from new investors who want to buy, or the supply of shares from existing investors who want to sell. Not every investor makes decisions based on the same criteria, and what might seem like a high price to one investor is a bargain to another. This dynamic keeps shares trading hands and makes future prices difficult to predict. What Is a Stock Exchange? Once a company goes public, its shares can be traded freely on the stock market. This means that investors can buy and sell shares among themselves. Most trading occurs on stock exchanges, although there are other venues for trading. Stock exchanges are organized and regulated places today its mostly virtual where stocks and other securities are bought and sold. They play a crucial role in the financial system by providing a platform for companies to raise money by selling their stocks and bonds to the public. The NYSE and Nasdaq are prime examples, serving as central locations for buying and selling stocks. There are many other major exchanges worldwide, such as the London Stock Exchange, the Tokyo Stock Exchange, and the Shanghai Stock Exchange. Each exchange has its own internal rules, and investors follow different national and local laws. These are meant to ensure fair trading practices and to keep investors confident in dealing there. They also provide transparency in the trading process, giving real-time information on securities prices. A major benefit of trading on stock exchanges is liquidity , the ability to buy or sell stocks relatively easily. With thousands of buyers and sellers, there is always someone willing to buy or sell shares for the right price. Many stock exchanges cross-list company shares, offering securities listed on other exchanges. This allows companies to reach more investors when raising capital, and gives investors a wider range of trading options. Fast Fact Though it is called a stock market, other securities, such as exchange-traded funds ETFs, are also traded there. Over-the-Counter Market Stocks can also be traded over the counter OTC. These OTC markets are where you buy or sell stocks directly with another investor, typically without the same level of regulation or public scrutiny. OTC trading involves a network of brokers and dealers who negotiate directly over computer networks and by phone. This type of trading is commonly used for smaller, less liquid companies that may not meet the stringent listing requirements of the stock exchanges. This can make it more challenging for investors to get reliable information about the companies they are investing in. Other Assets Sold on the Stock Market In addition to common stocks, many other assets are traded on stock exchanges and OTC. These are also considered part of the stock market American depositary receipts These represent shares in foreign companies and are traded on U.S. stock exchanges. They let U.S. investors invest in foreign companies without dealing with foreign stock exchanges or converting their currency. Derivatives This is a broad category that includes options and futures, whose value is derived from the value of an underlying asset, such as stocks, bonds, commodities, currencies, interest rates, or market indexes. So, in derivatives trading, youre not directly buying or selling the actual asset like the stock. Instead, youre trading something whose value is influenced by the changes in the price of an underlying asset. Funds These include mutual funds, which pool money from many investors for a basket of stocks, bonds, and other securities, and exchange-traded funds, which trade on stock exchanges like individual stocks and track or try to mirror how a sector, index, or theme of stocks is doing. Preferred stocks These stocks generally provide a set dividend and, as the name suggests, have priority over common stock in getting a share of the profits or whats left over if the company goes bankrupt. Real estate investment trusts REITs These are worth mentioning to get an idea of the breadth of what counts as the stock market. REITs are companies that own, manage, or finance real estate. Investors can buy shares in them, and they legally must provide 90 of their profits as dividends each year. More loosely, while separate markets, people often talk about these as part of the stock market Bonds These represent debt, and governments and corporations issue them to raise capital. Investors who buy bonds effectively lend money to the issuer in exchange for interest payments and the return of the bonds face value at maturity. Commodities There are 50 major commodities exchanges worldwide where you can buy raw materials like oil, steel, wheat, and coal directly or buy futures contracts based on where their prices might go. Investors and Traders Those in the stock market include institutional investors, such as pension funds, mutual funds, insurance companies, and hedge funds, that manage large amounts of money and often have a significant influence over the market since they are trading in large volumes. Retail investors buy and sell securities for their accounts, not for an organization. They can range from beginners to experienced traders, and today, most use online platforms. Another key group is accredited investors, high-net-worth individuals with the money and investing experience, so the SEC allows them access to more complex investments, like venture capital and private equity. Generally speaking, investors approach the market from a long-term perspective. They put money in stocks, ETFs, mutual funds, and other securities, expecting their value to grow over time these are not the quick trades you see in movies to get in and out fast. These investors are often more concerned with the fundamental strength of the companies or assets they invest in, such as their financial performance, market position, and growth potential. They decide on investments after research and analysis or after getting recommendations from financial advisors while trying to build wealth steadily through a portfolio that increases in value over time. Traders, for their part, take a more short-term approach to the stock market. They aim to capitalize on the markets volatility, trading stocks, options, futures, and other financial instruments within shorter time framesfrom seconds and minutes to days and months. Traders often rely on technical analysis, which involves studying market trends, charts, and other statistical measures to predict future price movements. While trading can offer the potential for quick profits, it also comes with higher risks than long-term investing. Quickly buying and selling securities requires a sharp understanding of the market and a more active, hands-on strategy for trading. Role of Brokers Brokers in the stock market play the same role as in insurance and elsewhere, acting as a go-between for investors and the securities markets. They are licensed organizations that buy and sell stocks and other securities for individual and institutional clients. Brokerage firms can be small boutique shops or multinationals offering investment advice, research, and wealth management services while executing trades for customers. Full-service brokers provide detailed financial advice, portfolio management, and personalized services, making them better for investors who prefer a thorough approach to managing their investments. Further down in cost, discount brokers provide a more hands-off experience and are typically preferred by investors who make their own trading decisions. Online brokerage firms have become increasingly popular with user-friendly platforms that allow investors to trade securities electronically at lower costs and with more convenience. These platforms often have educational resources, analytical tools, and real-time market data. There has also been a rise in robo-advisors , automated financial planning services offered at a very low price. Whatever type of broker, they are all regulated by the SEC and the Financial Industry Regulatory Authority FINRA in the U.S. Regulators A significant aspect of the stock marketdictating whats traded and howis the regulations and regulators involved. In the U.S., the latter is the SEC, an independent federal agency set up in 1934 on the heels of the 1929 market crash and the travails of the Great Depression. The mission of the SEC is protecting investors, maintaining fair, orderly, and efficient markets, and facilitating capital formation. The SEC enforces laws against market manipulation, insider trading, and other forms of fraud while verifying that public companies reveal any significant financial information investors should know when trusting a firm with their money by buying its stock. The SEC also oversees stock exchanges, broker-dealers, investment advisors, mutual funds, and public utility holding companies. In addition, the exchanges have their own requirements, such as filing timely usually quarterly updates to company financial reports and instant reporting of relevant corporate developments to ensure that everyone looking to trade has the same information. FINRA oversees brokerage firms and their registered securities representatives and is more focused than the SEC on protecting retail investors. Similar agencies exist worldwide, which is crucial given how the stock market is global and a calamity in one corner of the world soon reaches the otherits not just something that happens from a few buildings on Wall Street. While many countries regulations differ significantlythey answer to diverse populations and cultural expectationsgeneral rules are enforced to ensure fair practices, protect investors, and promote confidence in the broader stock market. How Stock Prices Are Determined Textbook descriptions of stock prices tend to start off talking about investors and dealers coming together, and for there to be a stock trade, the buyer and seller must agree on a figure. But most investors find prices as they are listed in online brokerage accounts or online graphs of stock prices over time, not as coming from tough negotiations. That said, you do have to agree to buy stocks, and each investor or trader making this decision collectively shapes the demand for stocks, which, taken against the supply on hand in the market, produces the prices on our screens. The factors that influence these prices fall into two main types fundamental and technical. Fundamental factors are rooted in a companys earnings, profitability from its operations, and the goods or services it offers. Meanwhile, technical factors relate to market sentiment and statistical analyses of historical market activity and stock price trends. High stock prices can indicate a companys successor at least the feeling of buyers that they are doing wellbut they can also result from stock splits, dividends, and share repurchases. When a stock price drops, this doesnt mean that money is lost from the market as a whole. Instead, it signifies a decrease in the market value of the specific stock. For instance, if a company reports higher profits than expected, its stock price might increase as more investors want to buy shares, hoping for future growth. Similarly, economic events like interest rate changes or geopolitical issues can affect investor confidence and stock prices. Market Indexes Most Americans first learn about the stock market through indexes, since reporting on the ups and downs of the Dow Jones Industrial Average DJIA or SP 500 has long been a staple for financial news. Indexes can include the DJIA, which includes 30 large publicly owned companies, or the the SP 500, representing the 500 largest U.S. public companies. These indexes can give a picture of the wider stock market, or a specific sector like technology, or healthcare. Indexes are important since they are used as benchmarks for stocks and portfolios. For example, if youre invested in technology stocks, youll want to see how your stocks are doing against a tech index. Roles of the Stock Market The stock market fills several different roles Corporate governance Publicly traded companies follow stringent reporting regulations, which makes them far more transparent and accountable. This information allows investors to make informed decisions and helps maintain investor confidence in the market. Its also a boon for everyday Americans to gain a view inside major U.S. corporations since, without these transparency requirements, they could close down much of what we know about them. Economic indicator The stock markets performance is often considered a gauge of an economys health. Rising stock prices are associated with corporate profitability and economic growth, while declining prices signal problems ahead. Investment opportunities The stock market offers the chance to invest in companies and potentially grow a portfolio over time. The stock market has historically delivered returns outpacing inflation, making it a vital tool for retirement planning, wealth building, and financial security. Liquidity The stock market enables investors to buy and sell shares of companies and other securities quickly when needed. Raising capital Most importantly, the stock market offers a platform where companies raise funds by issuing stocks. This capital is essential for business expansion, research and development, and other corporate initiatives. By selling shares to the public, companies gain access to these funds without incurring debt. Resource allocation By reflecting the collective judgment of traders and investors through the price of different companies, the stock market is said to help efficiently distribute capital to companies more likely to succeed and away from those that are not. Why Is the Stock Market So Important? Now that we know the different parts of the stock marketwho, what, where, and how it workswe can better understand why its such a large part of our economy today. The meaning of the stock market cant be understated for how our world functions. When the earliest stock markets formed, the global economy was vastly different. These were eras when trade and commerce were primarily driven by physical goods, with industries like agriculture, textiles, and early manufacturing dominating the economic landscape. Stock markets at the time were fledgling institutions, primarily helping to finance expeditions and trade ventures. In other words, they were used to fund the colonial enterprises taking goods and people from South Asia, the Americas, and Africa. These stock exchanges were already global investment operations. Yet, they played a relatively minor role in everyday economic life. Fast forward to today, and the stock market is considered central to the global economy, a change underscored by financialization and the increasing dominance of financial markets and institutions. This isnt just because over a million Americans work in finance. Modern economies are characterized by a complex web of financial transactions and instruments, with the stock market not just a barometer for economic health but also seen as critical for distributing and creating wealth. The Meaning of the Stock Market for Most Americans Financialization has also mirrored broader socioeconomic changes. Todays stock markets are not just platforms for raising capital but have been tied into millions of Americans retirement and investment strategies. Many Americans are not directly invested in the stock market, but are still affected by its movements. First, the market drives funding for technological advances like smartphones and medications, which require billions of dollars for research and development. Market moves can also influence corporate decisions, influencing job creation and layoffs. A healthy stock market generally correlates with a more robust economy. But it could also mean more capital in the hands of a wealthy few, increasing the property values of once middle-class areas in almost every major American city. The stock market also indirectly influences public services and infrastructure. Pension funds are significantly invested in the stock market, affecting the retirement security of millions of people. Many more individuals dont have pensions and are invested in the market directly through 401ks and individual retirement accounts. Whats the Difference Between the Bond Market and the Stock Market? The bond market is where investors buy and sell debt securities, typically issued by governments or corporations. When you invest in bonds, youre essentially lending money for regular interest payments and the return on the bonds face value at maturity. The stock market involves buying and selling shares of publicly traded companies. Stocks offer the potential for higher returns than bonds since investors can get both dividends when the company is profitable and returns when the stock price goes up. They also have a higher risk, as stock prices can be more volatile. What Is an Alternate Trading System? Alternative trading systems are platforms for matching large buy and sell transactions and are not regulated like exchanges. Dark pools and many cryptocurrency exchanges are private exchanges or forums for securities and currency trading and run within private groups. Who Helps an Investor Trade on the Stock Market? Stockbrokers act as intermediaries between the stock exchanges and the investors by buying and selling stocks. Portfolio managers are professionals who invest portfolios, or collections of securities, for clients. Investment bankers represent companies in many ways, such as helping private companies go public or planning mergers and acquisitions. The Bottom Line The stock market is where shares of companies and other financial instruments are bought and sold. The stock market is also where companies raise capital and where investors can grow their wealth. Even if you dont trade on the stock market directly, it influences the products you buy, the type of jobs available, and the retirement you might plan.",
  "matched_keywords": [
    "stocks",
    "equity",
    "mutual funds",
    "ETF",
    "interest rates",
    "inflation",
    "NSE",
    "dividends",
    "portfolio",
    "investment",
    "economic growth",
    "bonds",
    "debt",
    "commodities",
    "crypto",
    "market crash"
  ],
  "embedding": [
    0.034676749259233475,
    -0.0973164513707161,
    -0.03224589303135872,
    0.027608204632997513,
    -0.04269358888268471,
    0.031661320477724075,
    0.08603158593177795,
    -0.02671051025390625,
    0.06540133059024811,
    -0.0690908432006836,
    -0.011359226889908314,
    0.08119296282529831,
    -0.042600490152835846,
    -0.030979115515947342,
    0.04005229100584984,
    -0.09888684004545212,
    0.022233299911022186,
    0.02345554530620575,
    -0.02973599173128605,
    0.07204465568065643,
    -0.06902569532394409,
    -0.08496465533971786,
    -0.09724081307649612,
    0.020477132871747017,
    -0.05774379521608353,
    -0.02741384319961071,
    -0.005122066475450993,
    0.019560212269425392,
    -0.0467507503926754,
    0.0018823238788172603,
    0.01469910703599453,
    -0.09532731771469116,
    0.09683997929096222,
    0.07223770767450333,
    -0.067921482026577,
    0.018739959225058556,
    0.011460086330771446,
    0.018396399915218353,
    0.035717274993658066,
    0.023729078471660614,
    -0.03724665939807892,
    -0.0056053646840155125,
    -0.07006019353866577,
    0.024203160777688026,
    0.08189039677381516,
    0.025598978623747826,
    0.00743641285225749,
    0.012386970221996307,
    0.03751365467905998,
    -0.06552018970251083,
    -0.0762655958533287,
    -0.008233503438532352,
    -0.03280611336231232,
    0.08231201022863388,
    -0.03598275035619736,
    0.005680203437805176,
    -0.013447199016809464,
    -0.0365665927529335,
    0.007928697392344475,
    0.012561501935124397,
    0.03433813154697418,
    -0.05461570620536804,
    0.0240101907402277,
    0.04119826853275299,
    0.05446188896894455,
    -0.001740099978633225,
    -0.008817975409328938,
    0.08050251007080078,
    0.02850634790956974,
    -0.0595904178917408,
    0.008044916205108166,
    0.034562379121780396,
    -0.05814146250486374,
    0.04821987822651863,
    -0.09723972529172897,
    -0.09503008425235748,
    -0.009137795306742191,
    0.046766288578510284,
    0.04734421893954277,
    0.07535723596811295,
    -0.0196810495108366,
    0.009806420654058456,
    0.00853977631777525,
    -0.051093146204948425,
    -0.03470974043011665,
    -0.03288119286298752,
    -0.007883407175540924,
    0.006152114365249872,
    -0.016819093376398087,
    0.016713904216885567,
    -0.07072397321462631,
    -0.030663523823022842,
    0.0021073713432997465,
    0.035823363810777664,
    0.09874355047941208,
    0.021973298862576485,
    0.017290037125349045,
    0.03205019235610962,
    0.08681058883666992,
    -0.03523831069469452,
    0.0558670237660408,
    0.003439266700297594,
    -0.0643988624215126,
    0.015998907387256622,
    -0.04834626615047455,
    -0.0375530943274498,
    -0.05007930099964142,
    -0.05875439569354057,
    0.0010898301843553782,
    0.022273298352956772,
    -0.11926635354757309,
    0.06343759596347809,
    -0.06745395064353943,
    -0.03529537469148636,
    -0.025406092405319214,
    0.05246321111917496,
    0.006406147498637438,
    0.00226391339674592,
    0.007735694292932749,
    0.03462744876742363,
    -0.05702301487326622,
    0.08971718698740005,
    -0.01369240041822195,
    -0.06292442977428436,
    -0.007972683757543564,
    0.053611718118190765,
    -0.03903860226273537,
    -3.2590932147320725e-34,
    -0.1185058206319809,
    -0.04862198606133461,
    -0.01786506175994873,
    0.07703615725040436,
    -0.06106554716825485,
    -0.002908546943217516,
    -0.005881860386580229,
    -0.040630605071783066,
    -0.04005493223667145,
    0.09032341092824936,
    0.003294196678325534,
    -0.047000981867313385,
    -0.010869501158595085,
    0.03284355252981186,
    0.071134053170681,
    -0.013491084799170494,
    0.003995470702648163,
    -0.009697369299829006,
    0.17010004818439484,
    -0.046626850962638855,
    0.01964285969734192,
    0.053719088435173035,
    -0.027574455365538597,
    0.001155179226770997,
    -0.015574273653328419,
    -0.02549787238240242,
    -0.05120160058140755,
    -0.0032630637288093567,
    0.040065497159957886,
    0.00491371238604188,
    0.08884010463953018,
    0.0017166942125186324,
    -0.03352658823132515,
    0.048150867223739624,
    -0.015380079858005047,
    -0.07282105088233948,
    0.07346142083406448,
    0.023740701377391815,
    0.08703921735286713,
    -0.025505278259515762,
    -0.03447090834379196,
    -0.035650648176670074,
    -0.07523586601018906,
    -0.002586446236819029,
    0.0005372583982534707,
    0.05893310531973839,
    -0.08175259828567505,
    -0.023883456364274025,
    0.030258359387516975,
    0.0019843238405883312,
    0.014943382702767849,
    -0.004368558060377836,
    0.004967342596501112,
    -0.04071910306811333,
    -0.014416449703276157,
    0.039220962673425674,
    -0.0444590300321579,
    -0.14460116624832153,
    -0.1155255064368248,
    0.09023091197013855,
    0.023113682866096497,
    0.05125359818339348,
    0.02341293916106224,
    0.05048806592822075,
    -0.08968698233366013,
    0.06778371334075928,
    -0.014083211310207844,
    0.07584458589553833,
    -0.06505032628774643,
    0.07501905411481857,
    -0.01760120317339897,
    -0.00689898943528533,
    -0.013323581777513027,
    0.013119205832481384,
    0.02727542817592621,
    0.006628571078181267,
    -0.04157648980617523,
    0.06956818699836731,
    0.025176240131258965,
    0.042749080806970596,
    -0.005309320520609617,
    -0.03715522959828377,
    0.024364624172449112,
    0.07191931456327438,
    -0.03982141986489296,
    0.019295573234558105,
    -0.04985034838318825,
    0.019283754751086235,
    0.040995292365550995,
    -0.08053284138441086,
    -0.04562748968601227,
    0.038146745413541794,
    -0.08414513617753983,
    0.10145530104637146,
    0.061630669981241226,
    -3.404978813578086e-33,
    -0.014097374863922596,
    -0.004178133327513933,
    -0.10877814888954163,
    -0.015453698113560677,
    -0.091865673661232,
    -0.0034610754810273647,
    -0.04678736627101898,
    -0.05477585643529892,
    0.0390387624502182,
    0.08961476385593414,
    -0.13267183303833008,
    -0.004901318810880184,
    0.04490726813673973,
    0.016947265714406967,
    -0.12185315787792206,
    -0.11513318866491318,
    -0.018471622839570045,
    0.005326393526047468,
    -0.02745729312300682,
    -0.030275613069534302,
    -0.024961253628134727,
    0.023563869297504425,
    0.0068977754563093185,
    -0.042717937380075455,
    0.06402546167373657,
    0.004069460555911064,
    -0.051112204790115356,
    0.02869941107928753,
    0.11078539490699768,
    0.04079331457614899,
    0.016924995929002762,
    -0.022329332306981087,
    0.11013494431972504,
    0.016732938587665558,
    -0.03727950155735016,
    0.042830273509025574,
    0.006307151634246111,
    -0.1020074263215065,
    0.02138429880142212,
    0.007334429770708084,
    -0.01228335127234459,
    0.0041321031749248505,
    0.09518031775951385,
    -0.0028601393569260836,
    -0.0243271104991436,
    0.07747964560985565,
    0.025852670893073082,
    0.07386317104101181,
    0.042252521961927414,
    -0.030757196247577667,
    -0.05247892439365387,
    0.053246643394231796,
    0.049821510910987854,
    0.007394653279334307,
    -0.01685919053852558,
    0.03470362722873688,
    -0.04230997711420059,
    -0.012898687273263931,
    -0.020807182416319847,
    0.031961970031261444,
    0.08109550923109055,
    -0.011404263786971569,
    -0.010014576837420464,
    0.06789867579936981,
    -0.014718336053192616,
    -0.010837676003575325,
    -0.08723748475313187,
    -0.025942178443074226,
    -0.03662282973527908,
    -0.014619491994380951,
    0.05789744108915329,
    -0.025241460651159286,
    0.03845340758562088,
    -0.054675858467817307,
    -0.02380378730595112,
    0.051857467740774155,
    -0.03518116846680641,
    -0.02460635080933571,
    -0.042850568890571594,
    0.05983444303274155,
    0.028350265696644783,
    0.04118621349334717,
    0.0012054285034537315,
    -0.01870119944214821,
    -0.008728839457035065,
    -0.0019265603041276336,
    -0.012283744290471077,
    0.029214369133114815,
    -0.019711580127477646,
    -0.13077464699745178,
    0.01330786943435669,
    -0.023083360865712166,
    -0.008921127766370773,
    0.028990773484110832,
    -0.07688847184181213,
    -5.6497000855415536e-08,
    -0.07557082921266556,
    -0.03955462574958801,
    0.08605197072029114,
    -0.010698807425796986,
    -0.019560063257813454,
    -0.04315970093011856,
    0.05332110449671745,
    -0.05483324080705643,
    0.04362012818455696,
    0.03764328360557556,
    -0.048595234751701355,
    0.05698995664715767,
    -0.10405206680297852,
    0.005545512307435274,
    -0.07229176163673401,
    -0.054342322051525116,
    -0.02946433424949646,
    -0.018364256247878075,
    0.068672776222229,
    0.02681720443069935,
    0.03712322562932968,
    -0.04253600537776947,
    0.06339218467473984,
    0.03931158408522606,
    0.061899226158857346,
    -0.013103939592838287,
    0.06642328947782516,
    -0.004780773539096117,
    0.038086988031864166,
    0.007988791912794113,
    -0.006482546217739582,
    -0.018290843814611435,
    0.08096969127655029,
    0.034630730748176575,
    -0.056603867560625076,
    0.09471208602190018,
    0.006989599205553532,
    0.037303294986486435,
    -0.011567923240363598,
    -0.008662031963467598,
    -0.10958652198314667,
    -0.042992714792490005,
    0.02918030135333538,
    -0.0050136977806687355,
    -0.031899213790893555,
    0.07601123303174973,
    -0.0464218445122242,
    0.04808706045150757,
    0.07186168432235718,
    -0.07878734171390533,
    -0.005645789671689272,
    0.0014761574566364288,
    0.04555986076593399,
    0.0036717455368489027,
    -0.06128855422139168,
    0.08951406925916672,
    -0.07352793216705322,
    0.010791032575070858,
    0.004003035370260477,
    -0.030894987285137177,
    -0.0547088086605072,
    0.04049022123217583,
    -0.028124867007136345,
    0.06964050233364105
  ],
  "metadata": {
    "url": "https://www.investopedia.com/terms/s/stockmarket.asp",
    "title": "What Is the Stock Market and How Does It Work?",
    "author": "Peter Gratton",
    "date": "Updated May 14, 2025",
    "category": "Investing",
    "content_type": "definition",
    "word_count": 3465,
    "source": "www.investopedia.com"
  }
}