{
  "url": "https://www.economictimes.indiatimes.com/markets",
  "title": "Don't ignore smallcaps: HSBC CIO on where growth is in FY26",
  "text": "English Edition English Edition हनद ગજરત मरठ বল ಕನನಡ മലയള தமழ తలగ 01 June, 2025, 0333 PM IST Todays ePaper My Watchlist Subscribe Sign In Search Home ETPrime Markets Market Data AI Masterclass News Industry SME Politics Wealth MF Tech AI Careers Opinion NRI Panache More Menu Stocks News Live Blog Stock Live Blog Earnings Podcast Market Classroom Dons of Dalal Street Recos Stock Reports Plus New My Screener Candlestick Screener Stock Screener Stock Watch Market Calendar Stock Price Quotes Options IPOsFPOs Expert Views Investment Ideas Commodities Views News Others Mentha Oil Precious Metals Gold M Gold Silver Gold Petal Silver Micro Silver M Gold Guinea Oil Energy Natural Gas Crude Oil Crude Oil Mini Base Metals Aluminium Zinc Mini Lead Mini Copper Zinc Nickel Aluminium Mini Lead Plantation Kapas Cotton Candy Forex Forex News Currency Converter Live Stream! Basics of crypto and blockchain AIF PMS Crypto Crypto News Crypto TV Crypto Returns Calculator Crypto Prices All Cryptos Bonds More Technicals Technical Chart Visualize Screener Mind Over Money Web Stories Markets Data Unlisted Companies Market Moguls Webinars Sitemap Definitions Business News Markets CLOSED - 0415 PM May 30, 2025 0415 PM May 30, 2025 Sensex 81,451.01 -182.01 -0.22 Nifty 24,750.70 -82.90 -0.33 Please Select Interval 1D 1W 1M 3M 6M 1Y 5Y Loading... Indices Cryptocurrency Nifty Midcap 100 57,420.00 -0.06 BSE SmallCap 52,413.25 0.16 Nifty IT 37,321.75 -1.15 Nifty Bank 55,749.70 0.37 Indices Bitcoin Price 88,96,795 0.40 Ethereum Price 2,13,066 -1.26 Tether Price 85.60 0.01 XRP Price 183 -0.22 MORE Top Gainers Top Losers Reliance Power 58.10 11.30 Suzlon Energy 71.48 9.27 BSE 2,674.00 9.24 R R Kabel 1,426.00 8.84 NSE 500 Gainers Welspun India 132.66 -9.64 Mazagon Dock Ship 3,478.00 -7.28 Chennai Petro 676.20 -6.30 IFCI 67.42 -6.05 NSE 500 Losers Gold 94,790.00 -599.00 -0.63 USDINR 85.57 0.05 0.06 STOCK SEARCH ET PRIME With a long-term perspective 5 stocks from different sectors which fit the bill on a more important, but less used ratio Multibagger or IBC - Part 8 This Indian auto ancillary is expanding beyond 2Ws, with a foray into 4Ws These large- and mid-cap stocks can give more than 30 return in 1 year, according to analysts Videos Breakout, volume surge make CDSL a buy, says Shivangi Sarda of Motilal Oswal KEC International breaks 200-DMA resistance, SMCs Shitij Gandhi eye Rs 1,025 target ABB India Eyes Rs 7,500 in 24 Months, Accumulate on Dips Ajit Mishra SBI Life technical setup turns bullish key support at Rs 1,750, says expert How Trumps Remittance Tax could drain billions from Indian Economy 2500 Returns? Inside Indias Defence Market Surge Stock Tickers in Mumbai Shenzhen Rip Through Pakistans Victory Claims Metal Stocks Shine Religare Sees 24 Month Upside in Jindal Steel Power Hero MotoCorp Above 50-DMA, RSI StrongChoice Broking Sees Upside Potential Bill Gates to Give Away All His Fortune by 2045 Heres why 1 2 3 4 5 6 7 8 9 10 01 Jun 2025, 1524 Sector-wise ownership IT sector tops promoter ownership in Nifty50 01 Jun 2025, 1511 With a long-term perspective 5 stocks from different sectors which fit the bill on a more important, but less used ratio 01 Jun 2025, 1448 India Inc. ownership tracker Key trends in NSE-listed companies 01 Jun 2025, 1410 How to calculate sales to total assets ratio 01 Jun 2025, 1404 Nifty50 ends May with gains despite weekly volatility all eyes on June 2 reversal alert 01 Jun 2025, 1354 How to calculate net interest margin? 01 Jun 2025, 1340 These 7 penny stocks rally 25-50 in a week 01 Jun 2025, 1333 FO Talk June series seasonality favors bulls Nifty ends positive in 11 of last 18 years Sudeep Shah 01 Jun 2025, 1321 Ahead of Market 10 things that will decide stock market action on Monday 01 Jun 2025, 1317 Coal India files DRHP for Bharat Coking Coal with Sebi for an IPO 01 Jun 2025, 1300 Market Trading Guide Wockhardt, Bank of Maharashtra are among 6 stocks to buy on Monday for up to 20 upside 01 Jun 2025, 1242 Breakout Stocks How to trade Bharat Dynamics, BSE and Welspun Corp that hit fresh 52-week high? 01 Jun 2025, 1150 GIFT Nifty hits record monthly turnover of 102.35 billion in May 2025 01 Jun 2025, 1138 Coforge, Vesuvius India among 5 firms set for stock splits, bonus issues in June 2025 01 Jun 2025, 1104 FPIs infuse Rs 19,860 cr in equities in May on strong domestic fundamentals, global eco indicators 01 Jun 2025, 1051 Indias top 10 priciest stocks in 2025 MRF to Elcid, see who tops the list 01 Jun 2025, 1038 Market valuation of four of top-10 most valued firms jumps Rs 1 lakh cr LIC biggest gainer 01 Jun 2025, 1034 Final whistle or final quarter How sports help Praveen Kutty handle pressure in business 01 Jun 2025, 1023 Fund Manager Talk Dont ignore smallcaps HSBC MF CIO on where growth lies in FY26 01 Jun 2025, 1018 The primary market puzzle Too much, yet too little? 01 Jun 2025, 0940 This Tata Group trio, 29 other stocks approach record dates for dividends, bonus, stock split. Do you own? 01 Jun 2025, 0938 Copper in 2025 Navigating a tightrope between surging demand and constrained supply 01 Jun 2025, 0936 Adani Energy Solutions to raise Rs 4,300 cr via share sale 01 Jun 2025, 0917 RBI policy, FII action among 7 factors to impact D-Street this week 31 May 2025, 1817 Increase both Bullish thought cautious and selective approach 7 large-cap stocks with upside potential of up to 35 31 May 2025, 1714 FIIs remain net buyers in May, infuse Rs 18,082 crore into Indian equities 31 May 2025, 1637 Salasar Techno Engineering Q4 net profit grows 30 pc to Rs 20 cr 31 May 2025, 1605 Titagarh Rail Systems Q4 results Net profit declines 18 YoY, revenue down by 4 31 May 2025, 1542 FO Talk Nifty awaits trigger as June series kicks off with cautious tone, 25,100 key level Rahul Ghose 31 May 2025, 1538 Who controls India Inc.? The answer is starting to change NSE report 31 May 2025, 1409 These 10 smallcap stocks display strong momentum in turbulent market, rally up to 57 in a month 31 May 2025, 1321 Concurrent Gainers 5 stocks that gain for 5 days in a row 31 May 2025, 1320 Dalal Street Week Ahead Broader trend intact, but short-term risks rising 31 May 2025, 1236 Vodafone Idea approves Rs 20,000 cr fundraise plans in a fight for survival 31 May 2025, 1214 Leadership Launchpad Why Top CEOs Are Emerging from Consulting Firms Today 31 May 2025, 1202 Top 10 Nifty 500 stocks where both MFs and FIIs boosted holdings in Q4 31 May 2025, 1048 Warren Buffetts 2025 Mantra Adapt to reality, reality wont adapt to your risk tolerance 31 May 2025, 1045 Mind Over Money From pitch to boardroom how soccer shapes the leadership style of DCB Bank CEO Praveen Kutty 31 May 2025, 1041 High Voltage Bets Suzlon and JSW Energy poised for strong FY26 performance 31 May 2025, 0937 Wall Streets macro traders get schooled in Trump-Era turbulence 31 May 2025, 0933 Morgan Stanley sees uncomfortable rally in emerging markets 31 May 2025, 0924 JPMorgan CEO Dimon backs US taxing carried interest, warns of bond market trouble 31 May 2025, 0920 5 world market themes for the week ahead 31 May 2025, 0917 Wall Street Week Ahead Jobs data, tax bill, trade on tap for rebounding US stocks 31 May 2025, 0832 SP 500 ends near flat but posts biggest monthly percentage gain since November 2023 31 May 2025, 0805 Ola Electric skids as widening losses dent sentiment 31 May 2025, 0747 Suzlon Energy shares up 13.6 on rising profits 31 May 2025, 0733 Travel and hospitality companies prepare for IPO amid rising domestic tourism 31 May 2025, 0004 Stock picks of the week 5 stocks with consistent score improvement and return potential of more than 21 in 1 year 30 May 2025, 2237 ET Market Watch Sensex Falls 182 pts, Nifty Below 24,800 IT Auto Stocks Drag Markets 30 May 2025, 2200 RBIs bond buyback, economic growth push yields higher amid rate cut hopes 30 May 2025, 2141 Apollo Hospitals to invest Rs 6,000 crore for 4,300 new beds across India 30 May 2025, 2128 FSN E-Commerce Ventures block deal BNP Paribas sells shares worth Rs 502 crore in Nykaa parent 30 May 2025, 2117 Spandana Sphoorty suffers net loss, auditor flags concerns over frauds 30 May 2025, 2105 Puravankara posts Rs 1,282 crore pre-sales, FY25 loss narrows 30 May 2025, 2050 Eternal block deal BNP Paribas buys shares worth Rs 1,484 crore in Zomato parent 30 May 2025, 2022 Sebi confirms market ban on LS Industries, promoter, 4 others 30 May 2025, 1953 Gap shares fall 20 as tariffs loom large over apparel makers turnaround plans 30 May 2025, 1911 Two Sharp with ET US Court revives Trumps tariffs India opens investment gates for Saudi Arabia 30 May 2025, 1903 US stocks fall sharply as tariff uncertainty prevails Trump accuses China of trade pact violation 30 May 2025, 1900 Coffee Day Enterprises Q4 Results Company narrows loss to Rs 114 crore, revenue up 7 30 May 2025, 1900 Vedanta to raise up to Rs 5,000 crore via debentures 30 May 2025, 1844 NCLAT stays order against Vedantas power business demerger 30 May 2025, 1840 Scoda Tubes IPO subscribed 53 times on final day of bidding 30 May 2025, 1823 Apollo Hospitals Q4 Results Cons PAT jumps 53 to Rs 390 crore Rs 10share dividend announced 30 May 2025, 1742 These 4 healthcare stocks hit 52-week highs, rally up to 25 in a month 30 May 2025, 1725 Stock market update Nifty Realty index falls 0.66 30 May 2025, 1722 Prestige Estates Q4 Results Profit slumps 82 to Rs 25 crore 30 May 2025, 1720 Stock market update Nifty Auto index falls 0.98 30 May 2025, 1714 Sensex falls! But these stocks rallied over 15 on BSE in todays trade 30 May 2025, 1709 Stock market update Stocks that hit 52-week lows on NSE in todays trade 30 May 2025, 1700 Stock Radar Pennar Industries breaks out of 22-week consolidation time to buy? Check target stop loss for long positions 30 May 2025, 1653 Share market update Most active stocks in todays market in terms of volume 30 May 2025, 1648 Share market update Most active stocks of the day in terms of traded value 30 May 2025, 1642 Sensex falls! But these stocks gained over 10 on BSE 30 May 2025, 1641 Nykaa Q4 Results Cons PAT skyrockets 193 YoY to Rs 20 crore, revenue up 24 30 May 2025, 1638 Gainers Losers Ola Electric, Suzlon Energy among 7 stocks that hogged limelight today 30 May 2025, 1637 Stock market update Nifty Bank index advances 0.37 30 May 2025, 1632 Stock market update Nifty Pharma index falls 0.68 30 May 2025, 1631 Any dip towards 24,500-24,700 should be looked at as a buying opportunity Dharmesh Shah 30 May 2025, 1626 Stock market update Fertilisers stocks down as market falls 30 May 2025, 1621 Stock market update Stocks that hit 52-week highs on NSE in todays trade 30 May 2025, 1616 Stock market update Power stocks down as market falls 30 May 2025, 1613 Simplifying portfolio analysis and tracking Tools to view, compare, and manage your investments in one place 30 May 2025, 1612 Monsoon Picks Canara Bank, HeroMoto, and 6 more stocks to flood your portfolio with up to 15 returns 30 May 2025, 1610 Stock market update FMCG stocks down as market falls 30 May 2025, 1609 Adani Ports taps its largest ever domestic bond - Rs 5,000 crore 15-year NCD 30 May 2025, 1607 Wall Street fears foreign tax in budget bill may reduce allure of US assets 30 May 2025, 1604 Rupee flips back to monthly decline, lags Asian peers 30 May 2025, 1600 Stock market update Mining stocks down as market falls 30 May 2025, 1550 Market Wrap IT, auto stocks pull D-St lower Sensex down 182 pts, Nifty below 24,800 30 May 2025, 1516 Foreign investors grow wary of Indian stock market rally Report 30 May 2025, 1455 Stocks to Buy From Omaha to Dalal Street Gautam Trivedi decodes market momentum 30 May 2025, 1447 These 7 midcap stocks plunge over 50 from their year-high levels 30 May 2025, 1442 Can India become the services factory of the world? Gautam Trivedi explains 30 May 2025, 1435 Early monsoon, low inflation and tax cuts to aid consumption revival Sajjid Chinoy 30 May 2025, 1435 Reliance Power shares jump 16 to hit fresh 52-week high amid high volume 30 May 2025, 1421 Ola Electric, Kalyan Jewellers among 10 firms where promoters pledge increased in Q4 30 May 2025, 1353 Stocks to Buy Missed the May Rally? Sandip Sabharwals Strategy for June 30 May 2025, 1349 Why Sebi short-circuited Munna Bhais Circuit Arshad Warsi, wife among 59 banned for role in YouTube stock manipulation scheme Dont ignore smallcaps HSBC CIO on where growth is in FY26 India Inc. ownership tracker Key trends in NSE-listed cos Nifty ends May strong Jun 2 reversal closely watched Indias top 10 priciest stocks in 2025 MRF to Elcid, see who tops the list FII move among 7 top factors to impact D-St this week How to calculate sales to total assets ratio How to trade Bharat Dynamics and Welspun Corp that hit 52-week high? Coal India files DRHP for BCCL with Sebi for an IPO How to calculate net interest margin? Sectoral and thematic Mutual Funds ruled return charts GIFT Nifty hits record monthly turnover of 102.35 billion 29 stks near record dates for dividends and stock splits Adani Energy Solutions to raise Rs 4,300 cr via share sale 5 firms set for stock splits, bonus issues in June 2025 FPIs infuse Rs 19,860 crore in May on strong domestic 8 mutual fund NFOs to open for subscription this week Mkt valuation of 4 of top-10 most valued cos up Rs 1L cr Crypto Corner Powered by Trump Media raises 2.44 billion for Bitcoin treasury plan Cryptocurrency Expert Views Will India be services factory of world? Gautam Trivedi Dip to 24,500 a buying opportunity Dharmesh Shah NBFCs may outperform banks Rajeev Agrawal Top themes for future wealth creation Sachin Relekar Expert Views Market Moguls Outdated risk, renewed opportunities A case for acquisition financing Sunil Sanghai The divergence between US treasury yields and the dollar index A crisis of confidence Amit Pabari ET Market Watch 30 May 2025, 2237 May 30, 2025 Sensex Falls 182 pts, Nifty Below 24,800 IT Auto Stocks Drag Markets Listen 0210 Sector-wise ownership IT sector tops promoter ownership in Nifty50 India Inc. ownership tracker Key trends in NSE-listed companies How to calculate sales to total assets ratio How to calculate net interest margin? These 7 penny stocks rally 25-50 in a week 1 2 3 4 5 Podcast Slideshow Stock Recommendations 30 May 2025, 1011 Kolte-Patil Dev. BUY Price 408.25 0.67 Target 480 Brokerage HDFC Securities 30 May 2025, 0951 Gujarat Fluorochem HOLD Price 3,553.30 -5.25 Target 3,790 Brokerage ICICI Securities 30 May 2025, 0931 Zinka Logistics Solu BUY Price 440.10 0.42 Target 590 Brokerage JM Financial 30 May 2025, 0911 JK Cement ADD Price 5,497.50 1.76 Target 5,740 Brokerage HDFC Securities Stock Recos With a long-term perspective 5 stocks from different sectors which fit the bill on a more important, but less used ratio 14 mins read Multibagger or IBC - Part 8 This Indian auto ancillary is expanding beyond 2Ws, with a foray into 4Ws 16 mins read These large- and mid-cap stocks can give more than 30 return in 1 year, according to analysts 19 mins read Stock picks of the week 5 stocks with consistent score improvement and return potential of more than 21 in 1 year 15 mins read Increase both Bullish thought cautious and selective approach 7 large-cap stocks with upside potential of up to 35 13 mins read Railways stocks Time to be contrarian will bearish analysts go wrong again? 6 stocks, 2 with buy recos, 4 with sell recos 14 mins read Stock Radar City Union Bank stock breaks out from 6-month consolidation to hit fresh 52-week high time to buy? 3 mins read By Kshitij Anand Both from a medium- and long-term perspective 7 large-caps stocks from different sectors with an upside potential of up to 49 15 mins read These mid-cap stocks with Strong Buy Buy recos can rally over 30, according to analysts 20 mins read Weekly Top Picks These stocks scored 10 on 10 on Stock Reports Plus 5 mins read Two Trades for Today A payment services major for over 6 rise, a mid-cap refining stock for almost 7 gain 4 mins read Two Trades for Today A large-cap pharma company for almost 7.5 gain, a mid-cap chemicals stock for close to 7 upmove 4 mins read These 8 banking stocks can give more than 23 returns in 1 year, according to analysts 12 mins read Specialty chemicals Time for a re-look, as China negotiates they integrate 11 stocks, 6 with upside potential of over 27 15 mins read Should you sell or hold Voltas, Blue Star and other summer stocks because the monsoon is early? Answer is not in black white 11 mins read Stock Radar CDSL stock rebounds over 40 from March 2025 lows what should investors do? Check target stop loss 3 mins read By Kshitij Anand Two Trades for Today A healthcare major for over 5 rise, a mid-cap fertilizer stock for close to 7 gain 4 mins read These large-caps have strong buy buy recos and an upside potential of more than 30 21 mins read Weekly Top Picks These stocks scored 10 on 10 on Stock Reports Plus 5 mins read Stock Radar SBI Life breaks out from a Pennant formation on daily charts what should investors do? 3 mins read By Kshitij Anand 1 2 3 4 5 6 7 Stocks Dashboard Sectors Dashboard New Most Active - Value Most Active - Volume Top Gainers Top Losers 52 Week High 52 Week Low Volume Action Nifty 500 Nifty 50 Nifty 500 Nifty MidCap 100 Nifty 100 Nifty 200 As on May 30, 2025 0400 PM NSE BSE Name Price Chg Chg Value Cr. Upside Potential See Full Potential with ETPRIME Eternal 238.31 9.94 4.36 11,103 BSE 2,674 226.00 9.24 4,848 Suzlon Energy 71.48 6.07 9.27 3,958 FSN E-Comm Nykaa 203.26 -1.25 -0.62 3,935 Coromandel Int. 2,289 -19.50 -0.85 3,920 Mazagon Dock Ship 3,478 -273.00 -7.28 3,541 Bharti Airtel 1,856 -7.40 -0.4 3,102 Most Active - Value As on Jun 01, 2025 0333 PM Sector Name MCap Cr. AdvancesDeclines 1D Chg 1W Chg Upside Potential Services 8,13,000 32 27 14.61 13.91 Upto 47 Upside 13 stocks to Unlock Financial Services 21,28,936 197 165 4.29 7.91 Upto 60 Upside 3 stocks to Unlock Textiles 1,84,719 99 116 3.18 3.12 Upto 43 Upside 3 stocks to Unlock Media Entertainment 1,24,688 40 34 1.26 2.46 Upto 39 Upside 3 stocks to Unlock Banks 53,62,190 28 12 1.20 1.43 Upto 24 Upside 11 stocks to Unlock Hospitals Allied Services 5,30,838 20 30 1.03 -0.78 Upto 59 Upside 11 stocks to Unlock View All Sectors Market Calendar 01 Jun Astec Lifesciences Ltd. POM 01062025 01 Jun Intec Capital Ltd. POM 01062025 01 Jun Spice Islands Industries Ltd. POM 01062025 View Full Market Calendar End your Buy or Sell dilemma with 100 Daily Stock Recos Scan QR to get App Top Searches 1 2 3 Belrise Industries Share Price Sensex Nifty Crash Today Olectra Greentech Share Price Borana Weaves Share Price Hyundai Q4 Results ITC Hotels Results Raymond Share Price GRSE Share Price India-Pakistan Conflict Drone Stocks Today Defence Stocks Today India-Pakistan War Impact on Stock Market Stock Reports Plus Powered By High Upside Top Score Companies Analyst Favs Buy Mean Recos by 3 Analysts 0 Strong Sell 0 Sell 1 Hold 1 Buy 1 Strong Buy View Report Expected Returns 88.30 1Y Target Current Price Strong Buy Mean Recos by 4 Analysts 0 Strong Sell 0 Sell 0 Hold 2 Buy 2 Strong Buy View Report Expected Returns 71.10 1Y Target Current Price Buy Mean Recos by 3 Analysts 0 Strong Sell 0 Sell 0 Hold 2 Buy 1 Strong Buy View Report Expected Returns 68.60 1Y Target Current Price Hold Mean Recos by 5 Analysts 1 Strong Sell 0 Sell 3 Hold 0 Buy 1 Strong Buy View Report Expected Returns 61.80 1Y Target Current Price View More Reports 10 10 Stock Score View Report No Rating NR Negative Neutral Positive Earnings 8 Fundamentals 6 Relative Valuation 7 Risk 10 Price Momentum 9 10 10 Stock Score View Report No Rating NR Negative Neutral Positive Earnings 10 Fundamentals 9 Relative Valuation 4 Risk 9 Price Momentum 9 10 10 Stock Score View Report No Rating NR Negative Neutral Positive Earnings 6 Fundamentals 10 Relative Valuation 8 Risk 10 Price Momentum 6 10 10 Stock Score View Report No Rating NR Negative Neutral Positive Earnings 9 Fundamentals 10 Relative Valuation 10 Risk 10 Price Momentum 7 View More Reports Buy Mean Recos by 41 Analysts 1 Strong Sell 2 Sell 10 Hold 14 Buy 14 Strong Buy View Report Expected Returns 11.20 1Y Target Current Price Buy Mean Recos by 41 Analysts 0 Strong Sell 2 Sell 13 Hold 12 Buy 14 Strong Buy View Report Expected Returns 6.20 1Y Target Current Price Buy Mean Recos by 40 Analysts 0 Strong Sell 0 Sell 7 Hold 17 Buy 16 Strong Buy View Report Expected Returns 14.90 1Y Target Current Price Buy Mean Recos by 39 Analysts 0 Strong Sell 0 Sell 4 Hold 17 Buy 18 Strong Buy View Report Expected Returns 10.50 1Y Target Current Price View More Reports Upskill, grow your career and master stock strategies! Maximise Returns by Investing in the Right Companies The Economic Times Get Certified By Indias Top Business News Brand View Course Renko Chart Patterns Made Easy Kaushik Akiwatkar Derivative Trader and Investor View Course Candlesticks Made Easy Candlestick Pattern Course elearnmarkets Financial Education by StockEdge View Course Dow Theory Made Easy Vishal Mehta Independent Systematic Trader View Course Market 101 An Insight into Trendlines and Momentum Rohit Srivastava Founder- Indiacharts.com View Course Markets 102 Mastering Sentiment Indicators for Swing and Positional Trading Rohit Srivastava Founder- Indiacharts.com View Course Market 103 Mastering Trends with RMI and Techno-Funda Insights Rohit Srivastava Founder- Indiacharts.com View Course Market 104 Options Trading Kickstart Your FO Adventure Saketh R Founder- QuickAlpha, Full Time Options Trader View Course ROC Made Easy Master Course for ROC Stock Indicator Souradeep Dey Equity and Commodity Trader, Trainer View Course RSI Made Easy RSI Trading Course Souradeep Dey Equity and Commodity Trader, Trainer View Course Technical Analysis for Everyone - Technical Analysis Course Abhijit Paul Technical Trader and Trainer 20 years View Course Introduction to Technical Analysis Candlestick Theory Dinesh Nagpal Full Time Trader, Ichimoku Trading Psychology Expert View Course Options Trading Course For Beginners Chetan Panchamia Options Trader View Course Options Scalping Made Easy Sivakumar Jayachandran Ace Scalper View Course Futures Trading Made Easy Future Options Trading Course Anirudh Saraf Founder- Saraf A Associates, Chartered Accountant View Course 1 2 3 4 5 6 7 8 Companies News Thats Moving Your Stocks IHCL has Rs 3,000 cr cash instead of debt to launch new brands, travel packages in next few months Puneet Chhatwal What caused 14 degrowth in Kotak Mahindras quarterly profit? Ashok Vaswani explains IDFC First Banks MFI provision will go down every quarter from now opex will fall further to 12-13 V Vaidyanathan Falling credit cost to help Yes Bank achieve 1 ROA in next two financial years Prashant Kumar IDFC FIRST Bank eyes 20 loan book expansion with fresh capital boost Companies Sectoral Performance Tea Coffee 6 Declines 2 Advances Market Cap 13,237 Cr. Chg Chg 983.32 8.02 Telecommunications 16 Declines 7 Advances Market Cap 15,50,492 Cr. Chg Chg 44,464.77 2.95 Trading 11 Declines 11 Advances Market Cap 36,068 Cr. Chg Chg 711.93 2.01 All Sectors Sectoral Indices Indices Price Chg Chg Nifty Midcap 100 57,420.00 -37.25 -0.06 BSE SmallCap 52,413.25 87.50 0.16 Nifty IT 37,321.75 -432.41 -1.15 Nifty Bank 55,749.70 203.65 0.37 Nifty Auto 23,325.60 -230.16 -0.98 Nifty Pharma 21,442.05 -147.30 -0.68 Nifty FMCG 55,283.00 -347.45 -0.62 Nifty Financial Services 26,499.25 20.80 0.08 All Indices Advertisement BuySell Signals Bullish Moving Average Crossover Bearish Moving Average Crossover Bullish MACD Crossover Bearish MACD Crossover Bullish Stochastic Crossover Bearish Stochastic Crossover Select Indicator EMA 5 EMA 10 EMA 14 EMA 20 EMA 50 EMA 200 Formed on May 20, 2025 NSE BSE Name Price Chg Chg Gain Volume Amber Enterprises 6,491.50 129.00 2.03 4.48 2,43,646 Eris Lifesciences 1,581.80 -33.91 -2.10 3.95 1,78,142 Note Gain is the average price movement within 7 days of signal in last 5 years BSE Announcement Panafic Industrials 01 Jun,2025, 0327PM IST Submission Of Certificate For Non-Applicability Of The Disclosures Of Related Party Transactions As Per Regulation 239 Of SEBI LODR Regulations, 2015 For The Half-Year Ended 31St March, 2025 On Panafic Industrials Limited IOB 01 Jun,2025, 0327PM IST Announcement under Regulation 30 LODR-Change in Management IOB 01 Jun,2025, 0322PM IST Announcement under Regulation 30 LODR-Change in Management All Announcements ET Specials SPONSORED QR code on Bengaluru billboard leads to Red Envelope Club countdown website What we know so far NIFTY 50 STOCKS 1 2 3 4 5 Eternal. Share Price State Bank of India Share Price HDFC Bank. Share Price Larsen Toubro. Share Price Bajaj Finserv. Share Price Dr. Reddys Laboratories. Share Price Reliance Industries. Share Price ITC. Share Price Wipro. Share Price Coal India. Share Price Trent. Share Price Bajaj Finance. Share Price Tata Consumer Products. Share Price Kotak Mahindra Bank. Share Price Bharti Airtel. Share Price Adani Ports Special Economic Zone. Share Price Jio Financial Services. Share Price HDFC Life Insurance Company. Share Price UltraTech Cement. Share Price Bharat Electronics. Share Price Maruti Suzuki India. Share Price Apollo Hospitals Enterprise. Share Price Tata Motors. Share Price SBI Life Insurance Company. Share Price ICICI Bank. Share Price Cipla. Share Price Hindustan Unilever. Share Price Axis Bank. Share Price Adani Enterprises. Share Price Eicher Motors. Share Price IndusInd Bank. Share Price Titan Company. Share Price Tata Consultancy Services. Share Price Mahindra Mahindra. Share Price Hero MotoCorp. Share Price Grasim Industries. Share Price Power Grid Corporation of India. Share Price JSW Steel. Share Price Tata Steel. Share Price Sun Pharmaceutical Industries. Share Price Infosys. Share Price Oil And Natural Gas Corporation. Share Price Asian Paints. Share Price Nestle India. Share Price NTPC. Share Price Tech Mahindra. Share Price HCL Technologies. Share Price Shriram Finance. Share Price Hindalco Industries. Share Price Bajaj Auto. Share Price Bonds Corner Powered By JPMorgan CEO Dimon backs US taxing carried interest, warns of bond market trouble JPMorgan Chase CEO Jamie Dimon advocates for taxing carried interest, aligning with Donald Trumps efforts to close the loophole benefiting private market investors. Dimon suggests using the additional revenue to double income tax credits, benefiting communities and families. He also cautioned about a potential crack in the bond market due to government overspending and quantitative easing. Adani Ports taps its largest ever domestic bond - Rs 5,000 crore 15-year NCD India bond yields set to post third straight monthly fall in May High-yielding bonds in EM may beat peers as treasuries decline Jubilant Bhartia plans Rs 5,600 crore bond issue to fund Coca-Cola deal Shapoorji Pallonji Group secures 3.4 billion in private credit deal LIC invests Rs 5,000 crore in Adani Ports NCD MORE BONDS NEWS Find Your First Bond Discover bonds that meet your investment goals. I want to invest INR 10,000 INR 10,000 - INR 100,000 INR 100,000 for a duration of Less than 1 Year 1 Year - 3 Years More than 3 Years Cryptocurrency Bitcoin, Blockchain and All Else Powered by Trump Media raises 2.44 billion for Bitcoin treasury plan SEC Drops Lawsuit Against Binance, a Crypto Exchange Bitcoin slips below 106k amid renewed geopolitical, economic uncertainty India may float paper on crypto assets norms in June Jetking Infotrain invests in Bitcoin A bold move in Indias crypto landscape Cryptocurrency Top Cryptocurrencies As on Jun 01, 2025 0325 PM Name Symbol Price INR M.Cap Cr. Vol 24h, Cr. Bitcoin Price BTC 88,96,795 1,76,82,821 1,41,721 Ethereum Price ETH 2,13,066 25,72,361 86,362 Tether Price USDT 85.60 13,10,514 2,52,542 XRP Price XRP 183 10,73,726 13,198 BNB Price BNB 55,642 8,11,940 3,934 Solana Price SOL 12,994 6,79,179 20,948 Dogecoin Price DOGE 16.05 2,40,092 8,638 TRON Price TRX 22.92 2,17,415 3,449 MORE India Incs Scorecard Salasar Techno Engineering Q4 net profit grows 30 pc to Rs 20 cr Titagarh Rail Systems Q4 results Net profit declines 18 YoY, revenue down by 4 Spandana Sphoorty suffers net loss, auditor flags concerns over frauds Puravankara posts Rs 1,282 crore pre-sales, FY25 loss narrows Coffee Day Enterprises Q4 Results Company narrows loss to Rs 114 crore, revenue up 7 Apollo Hospitals Q4 Results Cons PAT jumps 53 to Rs 390 crore Rs 10share dividend announced All Stories Currencies Forex Futures Dollar poised for fifth-straight monthly drop on trade, fiscal uncertainty Rupee declines 7 paise to 85.45 against US dollar in early trade Forex Rates Currency Price Chg DXY Index 99.59 0.31 USDINR 85.57 0.06 EURINR 96.94 0.5 GBPINR 115.28 0.08 CNYINR 11.89 -0.06 USDJPY 144.02 -0.13 USDCNY 7.2 0.19 Forex Rates Currency Converter Select from currency Afghanistan Afghani Argentine Peso Australian Dollar Austrian Schilling Bahraini Dinar Bangladeshi Taka Bermudian Dollar Bhutan Ngultrum Bolivian Boliviano Bosnian Mark Botswana Pula Brazilian Real British Pound Cambodian Riel Canadian Dollar Chilean Peso Chinese Yuan Renminbi Colombian Peso Congolese Franc Costa Rican Colon Croatian Kuna Cuban Peso Cyprus Pound Czech Koruna Danish Krone Dominican Peso Ecuador Sucre Egyptian Pound Ethiopian Birr Euro Fiji Dollar French Franc German Mark Ghanaian Cedi Greek Drachma Guatemalan Quetzal Hong Kong Dollar Hungarian Forint Iceland Krona Indian Rupee Indonesian Rupiah Iranian Rial Iraqi Dinar Israeli New Shekel Italian Lira Jamaican Dollar Japanese Yen Jordanian Dinar Kenyan Shilling Korean Won Kuwaiti Dinar Lebanese Pound Liberian Dollar Libyan Dinar Luxembourg Franc Macau Pataca Malaysian Ringgit Maldive Rufiyaa Mauritius Rupee Mexican Peso Mongolian Tugrik Moroccan Dirham Mozambique Metical Myanmar Kyat Nepalese Rupee New Zealand Dollar Nigerian Naira Norwegian Kroner Omani Rial Pakistan Rupee Panamanian Balboa Papua New Guinea Kina Paraguay Guarani Peruvian Nuevo Sol Philippine Peso Polish Zloty Qatari Rial Russian Rouble Saudi Riyal Serbian Dinar Seychelles Rupee Singapore Dollar South African Rand Sri Lanka Rupee Sudanese Pound Swedish Krona Swiss Franc Taiwan Dollar Tanzanian Shilling Thai Baht TrinidadTobago Dollar Turkish Lira Uganda Shilling Uruguayan Peso US Dollar Ut. Arab Emir. Dirham Venezuelan Bolivar Vietnamese Dong Yemeni Rial Zambian Kwacha To Select to currency Afghanistan Afghani Argentine Peso Australian Dollar Austrian Schilling Bahraini Dinar Bangladeshi Taka Bermudian Dollar Bhutan Ngultrum Bolivian Boliviano Bosnian Mark Botswana Pula Brazilian Real British Pound Cambodian Riel Canadian Dollar Chilean Peso Chinese Yuan Renminbi Colombian Peso Congolese Franc Costa Rican Colon Croatian Kuna Cuban Peso Cyprus Pound Czech Koruna Danish Krone Dominican Peso Ecuador Sucre Egyptian Pound Ethiopian Birr Euro Fiji Dollar French Franc German Mark Ghanaian Cedi Greek Drachma Guatemalan Quetzal Hong Kong Dollar Hungarian Forint Iceland Krona Indian Rupee Indonesian Rupiah Iranian Rial Iraqi Dinar Israeli New Shekel Italian Lira Jamaican Dollar Japanese Yen Jordanian Dinar Kenyan Shilling Korean Won Kuwaiti Dinar Lebanese Pound Liberian Dollar Libyan Dinar Luxembourg Franc Macau Pataca Malaysian Ringgit Maldive Rufiyaa Mauritius Rupee Mexican Peso Mongolian Tugrik Moroccan Dirham Mozambique Metical Myanmar Kyat Nepalese Rupee New Zealand Dollar Nigerian Naira Norwegian Kroner Omani Rial Pakistan Rupee Panamanian Balboa Papua New Guinea Kina Paraguay Guarani Peruvian Nuevo Sol Philippine Peso Polish Zloty Qatari Rial Russian Rouble Saudi Riyal Serbian Dinar Seychelles Rupee Singapore Dollar South African Rand Sri Lanka Rupee Sudanese Pound Swedish Krona Swiss Franc Taiwan Dollar Tanzanian Shilling Thai Baht TrinidadTobago Dollar Turkish Lira Uganda Shilling Uruguayan Peso US Dollar Ut. Arab Emir. Dirham Venezuelan Bolivar Vietnamese Dong Yemeni Rial Zambian Kwacha Amount Convert Convert Trending in markets Belrise Industries Shares Why stock market is falling today Olectra Greentech Share Price Borana Weaves IPO Listing Hyundai Motor Q4 Results IRFC Share Price IndusInd Bank share RVNL Share Price Garden Reach Shipbuilders Share Price UPL share price Swiggy share price DMart Q4 results SBI Results Kotak Mahindra Bank Q4 results Adani Enterprises Results 2025 Trending Stocks to Watch Reliance Industries Q4 Results Reliance Q4 Results Live Updates Pakistan Stock Market on Pahalgam Attack Nestle India Q4 Results 2025 Hindustan Unilever LTD Q4 Results HCL Tech Q4 Results ICICI Bank Q4 Results HDFC Bank Q4 results YES Bank Q4 results Vodafone Idea News BSE Stock Price NCC Stock Price Stocks to Buy Polycab Stock Price IPO Startups, Grey Market, DRHP, Listings Coal India files DRHP for Bharat Coking Coal with Sebi for an IPO Travel and hospitality companies prepare for IPO amid rising domestic tourism Scoda Tubes IPO attracts strong demand, subscribed over 9x on Day 3 so far. Check details 3B Films IPO opens for subscription at Rs 50 per share Astonea Labs IPO allotment Heres how to check status, listing details and what GMP signals IPO IPO Open Upcoming Listing soon Listed IPO Name Issue Price Issue Size Issue Open Issue Close No Open IPO found IPO Name Issue Price Issue Size Issue Open Issue Close Ganga Bath Fittings Ltd. 46-49 32.65 Cr 04-06-2025 06-06-2025 Upcoming IPO IPO Name Issue Price Issue Size Issue Open Issue Close Property Share Investment Trust REIT 10,00,000-10,50,000 352.90 Cr 02-12-2024 04-12-2024 Solar91 Cleantech Ltd. 185-185 106.00 Cr 24-12-2024 27-12-2024 Arisinfra Solutions Ltd. 200-210 600.00 Cr 03-02-2025 05-02-2025 Aten Papers and Foam Ltd. 91-96 22.19 Cr 28-03-2025 02-04-2025 Wagons Learning Ltd. 78-82 38.82 Cr 02-05-2025 06-05-2025 Victory Electric Vehicles International Ltd. 72 40.66 Cr 20-05-2025 23-05-2025 Nikita Papers Ltd. 95-104 67.54 Cr 27-05-2025 29-05-2025 Listing Soon IPO IPO Name Issue Price Issue Size Issue Open Issue Close Aegis Vopak Terminals Ltd. 223-235 2,800.00 Cr 26-05-2025 28-05-2025 Schloss Bangalore Ltd. 413-435 3,500.00 Cr 26-05-2025 28-05-2025 Unified Data- Tech Solutions Ltd. 260-273 144.47 Cr 22-05-2025 26-05-2025 Dar Credit Capital Ltd 57-60 25.66 Cr 21-05-2025 23-05-2025 Belrise Industries Ltd. 85-90 2,150.00 Cr 21-05-2025 23-05-2025 Borana Weaves Ltd. 205-216 144.89 Cr 20-05-2025 22-05-2025 Accretion Pharmaceuticals Ltd. 96-101 29.75 Cr 14-05-2025 16-05-2025 Listed IPO ET Market Watch Sensex Falls 182 pts, Nifty Below 24,800 IT Auto Stocks Drag Markets Two Sharp with ET US Court revives Trumps tariffs India opens investment gates for Saudi Arabia India Inc. ownership tracker Key trends in NSE-listed companies How to calculate sales to total assets ratio How to calculate net interest margin? Commodity Bullion, Base Metals All Else Copper in 2025 Navigating a tightrope between surging demand and constrained supply No collateral damage Finance ministry wants relief for small gold loans Gold price prediction Gold bulls eye Rs 1.10 lakh10 gms. Should you accumulate? Gold little changed as traders await US inflation data Oil prices set for weekly drop with tariff legal battles, OPEC in focus Commodity Calendar Spread Far - Near month contract Commodity Spread Rs Unit Mentha Oil 46 1 KGS Natural Gas 7 1 mmBtu Kapas 30 20 KGS Silver M 1,401 1 KGS Silver 1,280 1 KGS Silver Micro 1,270 1 KGS Calendar Spread Gainers Losers Commodity PriceRs Chg Expiry Mentha Oil 865.00 2.44 May 30, 2025 Cotton Candy 54,000.00 1.26 May 30, 2025 Lead Mini 176.00 0.46 May 30, 2025 Copper 859.70 0.16 May 30, 2025 Gold 97,368.00 0.11 Dec 05, 2025 Aluminium 237.65 0.02 Jul 31, 2025 Future Gainers Mutual Funds 8 mutual fund NFOs to open for subscription this week Know Your Fund Manager Atul Bhole, Senior Fund Manager, Kotak Mahindra AMC Sectoral thematic mutual funds ruled return charts. Check out top performer Debt funds vs FD Which one to choose post decline in interest rate by banks recently Mutual funds hit double-digit share of 10 in NSE market cap, led by active funds All Stories Enter search text Browse Companies A B C D E F G H I J K L M N O P Q R S T U V W X Y Z 1 2 3 4 5 6 7 8 9 Quick Links MORE MobiKwik Shares News Reliance Power Preferential Issue HDB Financial Services IPO Western Carriers IPO Allotment Status ITD Cementation Share Price US Fed Meeting Time Reliance Power Share Price GST Council Meeting Live Baazar Style Retail IPO HAL Share Price Nifty Share Market Live Bajaj Housing Finance Share Price TCS Q4 Results Adani Green Q2 Results Maruti Suzuki Q2 Results Cipla Q2 Results Mamaearth IPO Nestle India Q3 Results Hot on Web MORE TS ICET hall ticket Bhool Chuk Maaf box office collection North Korea Aamir Khan to retire after Mahabharata Delhi weather UPEarthquake Hamas commander Muhammad Sinwar Harsh Goenka Reaction Tej Pratap Yadav Social Media Post Commercial LPG cylinder price cut PBKS vs MI Playing 11 Who is Sharmistha Panoli Northeast floods Indias Covid cases Inter Miami vs Columbus India Q4 GDP FY25 Live EPF Withdrawals In Case you missed it MORE Stock Market LIVE Afcons Infrastructure IREDA Q2 Results Reliance Power Preferential Issue Manba Finance IPO HDB Financial Services IPO Cochin Shipyard Share Price Northern Arc Capital IPO Allotment Arkade Developers IPO Allotment Today Stocks in news today US Fed Meeting Time US Fed Rate Cut Today NSE Bonus Issue Record Date BSE Share Price Bajaj Housing Finance IPO Listing Live Bajaj Housing Finance Share Price Tata Power Share Price MORE Top Searched Companies IRFC share price Suzlon share price IREDA share price TATA Motors share price Yes bank share price HDFC Bank share price NHPC share price RVNL share price SBI share price Tata power share price Tata steel share price Adani power share price Paytm share price PNB share price Zomato share price BEL share price BHEL share price Infosys share price IRCTC share price ITC share price JIO finance share price LIC share price Reliance share price HAL share price JP Power share price NBCC share price TCS share price Vedanta share price Wipro share price IOC share price Ircon share price SAIL share price SJVN share price GAIL share price HUDCO share price REC share price Reliance Power share price Tata Technologies share price Vodafone idea share price Adani Enterprises share price Adani Green share price Adani Port share price Ashok Leyland share price Bank of Baroda share price BSE share price Canara Bank share price CDSL share price Coal India share price HFCL share price IDFC First Bank share price Top Calculators MORE Standard Deviation Calculator Income Tax Calculator Age Calculator SIP Calculator Time Calculator BMI Calculator GPA Calculator Statistics Calculator Fraction Calculator Diabetes Risk Calculator Date Calculator Log Calculator MORE Top Commodities Gold Rate Menthaoil Rate Nickel Rate Kapas Rate Copper Rate Zinc Rate Silver Rate Cotton Rate Aluminium Rate Crudeoil Rate MORE Top Prime Articles No 5g Service Lack Of Fresh Funds Could Further Hurt Vodafone Idea Even As Airtel Jio Leap Ahead Falling Off The Momentum Why Retail Investors Are Losing Money After Witnessing A Long Rally Is Nifty Next 50 A Good Bet Only If You Are A Super Long Term Investor Adani Group Stocks Will Averaging Out Work For Retail Investors We Want To Solve The Wazirx Binance Issue Once And For All Nischal Shetty Reliance Jiocinema Is Streaming Ipl 2023 For Free Will This Now Disrupt The Ott Business Nippon India Fund Direct After Adani Stocks Hindenburg May Have Crashed Into Indias Green Hydrogen Mission Too Indian It Companies Rode The Cloud Wave As Hyperscalers Growth Tapers How Will It Impact Them Mens Underwear Sales Are Falling Should Indian Economy Prepare For A Below The Belt Jolt MORE Top Story Listing Sgx Nifty Lic Earthquake Today Epfo Pension Earthquake In Delhi Tcs Layoffs Nifty Crash Stock Market Crash Epfo MORE Top Definitions Accounting Currency Symbol Markets Marketing Mix Product Mapsko Builders Private Limited Fpo Business Fiscal Deficit Repo Rate MORE Top Slideshow How Rajendra Badwe Is Making Cancer Treatment Affordable By Repurposing Easily Available Drugs Icici Bank Axis Bank Stock Ideas Raw Vegetables MORE Top Market Pages Fully Drawn Advance Latest News Prestige Group to launch housing projects worth 42,000 crore in FY26 IBA collaborates with Indian Oil to develop bioenergy, bio-hydrogen sector RBI imposes 54.78 crore in penalties on 353 banks, other regulated entities during FY25 Nexus author Yuval Noah Harari warns of AIs deeper emotional threat beyond job loss The danger is enormous... Iran warns of retaliation if Europeans exploit UN nuclear report AIADMK announces nominees for June 19 Rajya Sabha polls With a long-term perspective 5 stocks from different sectors which fit the bill on a more important, but less used ratio GST collections jump 16.4 yoy to Rs 2.01 lk cr in May, fall from record high in April IndiGo, Delta, Air France-KLM, Virgin Atlantic announce partnership Weaponised storytelling How AI is helping researchers sniff out disinformation campaigns Bangladesh tribunal indicts former PM Hasina on mass murder charges Ankur Warikoo shares his fat-free fitness comeback story with six-pack abs at 44 Grateful for this second life Uncle goes viral for distributing sweets to the entire train coach but netizens remain skeptical Tata Motors reports 9 pc dip in sales in May England tour is exam for Shubman Gill, good batting key to good captaincy Saba Karim Follow us on Download ET App subscribe to our newsletter Copyright 2025 Bennett, Coleman Co. Ltd. All rights reserved. For reprint rights Times Syndication Service",
  "matched_keywords": [
    "stocks",
    "equity",
    "mutual funds",
    "inflation",
    "RBI",
    "NSE",
    "BSE",
    "dividends",
    "portfolio",
    "investment",
    "banking",
    "fiscal",
    "SEBI",
    "GDP",
    "economic growth",
    "bonds",
    "debt",
    "commodities",
    "crypto",
    "market crash"
  ],
  "embedding": [
    0.013887266628444195,
    -0.0569150485098362,
    -0.028375569730997086,
    0.06933724135160446,
    0.031638290733098984,
    -0.02626839466392994,
    0.04756540805101395,
    -0.031190158799290657,
    0.01105431467294693,
    -0.032033976167440414,
    -0.016063477843999863,
    -0.05407299846410751,
    -0.04231327027082443,
    -0.03338531404733658,
    0.012797162868082523,
    -0.011684367433190346,
    0.09441881626844406,
    0.02318604104220867,
    -0.08512519299983978,
    -0.06210260093212128,
    0.045158762484788895,
    -0.04944870248436928,
    -0.002306427340954542,
    -0.052463456988334656,
    -0.006122377701103687,
    0.05321534723043442,
    -0.06966672092676163,
    0.029737817123532295,
    -0.11755149811506271,
    -0.0661395713686943,
    -0.0689159631729126,
    0.08428444713354111,
    0.07058671116828918,
    0.0361921563744545,
    0.025181178003549576,
    -0.02902991883456707,
    -0.016942890360951424,
    0.11320056766271591,
    0.08713490515947342,
    -0.0509219728410244,
    -0.03559214994311333,
    -0.10620219260454178,
    0.0040022530592978,
    -0.07142698764801025,
    0.03639091178774834,
    -0.04461896792054176,
    -0.002604162786155939,
    -0.05540584772825241,
    0.05313492938876152,
    -0.05052749812602997,
    -0.03698026388883591,
    0.027501648291945457,
    0.01833505555987358,
    0.04947664588689804,
    -0.017588665708899498,
    -0.10648750513792038,
    -0.05230166018009186,
    -0.07427012920379639,
    0.019821273162961006,
    -0.019300255924463272,
    -0.025055281817913055,
    0.0846238061785698,
    0.008622521534562111,
    0.048827074468135834,
    -0.00619259849190712,
    -0.034594979137182236,
    -0.06462348997592926,
    0.09071460366249084,
    -0.07732827216386795,
    0.007694280706346035,
    0.04558746516704559,
    -0.016667189076542854,
    -0.04114985466003418,
    0.06054786592721939,
    -0.11013166606426239,
    0.02789650484919548,
    0.04352067410945892,
    -0.05748879909515381,
    0.04016133025288582,
    -0.0028771720826625824,
    0.018587283790111542,
    -0.02869272418320179,
    0.02286137454211712,
    0.007654624059796333,
    -0.059678904712200165,
    0.009243805892765522,
    0.036087263375520706,
    0.037747472524642944,
    0.06299398839473724,
    -0.0660695880651474,
    -0.03387890383601189,
    0.025633981451392174,
    0.004030731040984392,
    0.06836710125207901,
    0.06072563678026199,
    -0.02664974331855774,
    0.021739713847637177,
    0.009049746207892895,
    -0.11495553702116013,
    0.021493859589099884,
    0.06600838899612427,
    0.013486283831298351,
    -0.008276291191577911,
    -0.0428076833486557,
    -0.051775120198726654,
    -0.05003086477518082,
    -0.022941602393984795,
    0.07932893931865692,
    0.06291866302490234,
    -0.0022898355964571238,
    -0.0301192719489336,
    0.038937751203775406,
    -0.09808395802974701,
    -0.0864507406949997,
    -0.066024050116539,
    -0.017960570752620697,
    -0.04415297508239746,
    -0.037689756602048874,
    0.010388938710093498,
    0.07788800448179245,
    -0.043032728135585785,
    0.045667149126529694,
    -0.09998548030853271,
    0.023411164060235023,
    -0.010826261714100838,
    0.0434308759868145,
    0.015978073701262474,
    4.081537966740112e-32,
    -0.09556087106466293,
    0.02107156626880169,
    0.07950932532548904,
    -0.030470654368400574,
    -0.05096990615129471,
    0.013175999745726585,
    0.02736351080238819,
    -0.023040151223540306,
    -0.050512176007032394,
    0.045504868030548096,
    0.05503092333674431,
    0.023879170417785645,
    -0.09864341467618942,
    0.03296997398138046,
    -0.04814165085554123,
    -0.05351264029741287,
    0.024678584188222885,
    -0.1298135221004486,
    0.02089020423591137,
    -0.08081378042697906,
    -0.06366721540689468,
    0.02660663053393364,
    0.03521024435758591,
    -0.05009368807077408,
    -0.02352740615606308,
    -0.01285967230796814,
    -0.009096116758883,
    -0.06762233376502991,
    0.035842202603816986,
    0.06990312039852142,
    -0.012558544985949993,
    0.00947158969938755,
    -0.004386141896247864,
    -0.03293708339333534,
    -0.07178174704313278,
    0.01090506836771965,
    0.02265729382634163,
    -0.06702075898647308,
    0.007056551519781351,
    -0.08957908302545547,
    -0.014156936667859554,
    -0.023649083450436592,
    -0.016606394201517105,
    0.01607545092701912,
    -0.08253415673971176,
    0.043792545795440674,
    0.023923570290207863,
    -0.0025878341402858496,
    -0.010444121435284615,
    -0.02500917948782444,
    -0.06657948344945908,
    0.060925234109163284,
    -0.04521087184548378,
    0.03575374186038971,
    0.010853412561118603,
    0.0031818461138755083,
    0.0036384568084031343,
    -0.05997252091765404,
    -0.020174261182546616,
    -0.0216803178191185,
    -0.10142312198877335,
    0.02977341040968895,
    -0.0036838799715042114,
    -0.012253322638571262,
    -0.03952468931674957,
    0.03963730111718178,
    0.03767668455839157,
    0.031516123563051224,
    -0.060032907873392105,
    0.13811646401882172,
    0.03133382275700569,
    -0.014580026268959045,
    0.004975531715899706,
    0.08099381625652313,
    0.04469471052289009,
    0.05518905073404312,
    0.07985139638185501,
    0.01490205992013216,
    0.045102816075086594,
    -0.014562676660716534,
    0.04735112190246582,
    -0.05855318531394005,
    0.020686404779553413,
    0.020174365490674973,
    0.03426124155521393,
    0.06938531249761581,
    0.03857661038637161,
    -0.05387638881802559,
    0.02013988234102726,
    0.0013859259197488427,
    -0.08327122032642365,
    -0.05143724009394646,
    -0.005046571604907513,
    -0.04378405213356018,
    -0.15083760023117065,
    -3.9963584134700645e-32,
    -0.016009537503123283,
    0.019474675878882408,
    0.02472233958542347,
    0.0787937343120575,
    0.07305266708135605,
    -0.06601105630397797,
    -0.02728813700377941,
    -0.003785735694691539,
    0.09473929554224014,
    0.08113256841897964,
    -0.05252639576792717,
    -0.00026702354080043733,
    -0.03309920057654381,
    0.007112075109034777,
    -0.06451153010129929,
    -0.02287917397916317,
    -0.02042590267956257,
    0.0849301889538765,
    -0.021252375096082687,
    0.02229880355298519,
    -0.02751045487821102,
    0.013629788532853127,
    -0.08084378391504288,
    0.07489540427923203,
    -0.055471066385507584,
    0.05114335939288139,
    -0.05767429620027542,
    0.02834397368133068,
    0.04041087627410889,
    0.005001508630812168,
    -0.004732121247798204,
    -0.04360075294971466,
    -0.09271710366010666,
    0.038282331079244614,
    -0.062403541058301926,
    0.013297946192324162,
    0.05648087337613106,
    0.005392795894294977,
    -0.04463013634085655,
    0.06980857253074646,
    0.005663352087140083,
    -0.054807644337415695,
    -0.03393211588263512,
    -0.013827347196638584,
    -0.06555301696062088,
    -0.09991470724344254,
    -0.041352689266204834,
    -0.023465601727366447,
    0.06988439708948135,
    -0.01357209775596857,
    -0.010035705752670765,
    0.06449848413467407,
    -0.06271578371524811,
    -0.004099467769265175,
    0.00023449005675502121,
    -0.04250676929950714,
    0.007159383501857519,
    -0.05154053121805191,
    -0.12929044663906097,
    -0.014912785030901432,
    -0.07792067527770996,
    0.04569212719798088,
    0.04643942415714264,
    0.007763908710330725,
    0.07453827559947968,
    -0.07929574698209763,
    -0.02087246999144554,
    -0.0076854717917740345,
    -0.09679239988327026,
    -0.037806056439876556,
    0.053254541009664536,
    -0.031167207285761833,
    -0.07646425813436508,
    -0.07303879410028458,
    0.0037927229423075914,
    0.06109519302845001,
    0.019608287140727043,
    -0.03616279736161232,
    0.058886922895908356,
    -0.013604245148599148,
    0.06756111979484558,
    -0.056616898626089096,
    0.029791291803121567,
    0.0041745128110051155,
    0.015521733090281487,
    0.057463984936475754,
    -0.036631371825933456,
    0.031141966581344604,
    0.02970668487250805,
    -0.008241355419158936,
    0.0025436996947973967,
    -0.09480895847082138,
    -0.015365096740424633,
    0.04912708327174187,
    -0.010120206512510777,
    -1.0684290430162946e-07,
    -0.05510590970516205,
    -0.02327371947467327,
    0.019401300698518753,
    0.04480285942554474,
    0.04900799319148064,
    -0.03610483556985855,
    0.025832079350948334,
    -0.029601925984025,
    0.026921579614281654,
    -0.02164900302886963,
    0.04048175737261772,
    -0.04189256578683853,
    -0.049345310777425766,
    -0.020809609442949295,
    -0.0015532090328633785,
    0.01872106082737446,
    -0.08122733980417252,
    -0.00912550836801529,
    0.0011014060582965612,
    -0.07518038898706436,
    0.09541282802820206,
    -0.02137635089457035,
    0.02557378262281418,
    0.011267660185694695,
    -0.02231137454509735,
    -0.04167671501636505,
    -0.021626722067594528,
    -0.04119968041777611,
    -0.007134723011404276,
    0.06418505311012268,
    -0.031304359436035156,
    -0.026761511340737343,
    -0.026808887720108032,
    -0.02184406667947769,
    0.11998353153467178,
    0.030273225158452988,
    -0.0491102896630764,
    -0.050068650394678116,
    -0.010487198829650879,
    0.05028904229402542,
    -0.04281631484627724,
    -0.06094864383339882,
    0.04671231284737587,
    0.029069747775793076,
    -0.014826945029199123,
    0.010042841546237469,
    -0.0822191834449768,
    0.02200431562960148,
    0.052843015640974045,
    -0.12313530594110489,
    0.01120562944561243,
    -0.007473353296518326,
    0.055000681430101395,
    -0.05965133383870125,
    0.0022023445926606655,
    0.04065050184726715,
    -0.050649963319301605,
    0.054460298269987106,
    0.04397627338767052,
    -0.013053220696747303,
    0.1182360127568245,
    -0.14323486387729645,
    -0.0418495312333107,
    0.019838251173496246
  ],
  "metadata": {
    "url": "https://www.economictimes.indiatimes.com/markets",
    "title": "Don't ignore smallcaps: HSBC CIO on where growth is in FY26",
    "author": "",
    "date": "01 Jun 2025, 15:24",
    "category": "",
    "content_type": "market",
    "word_count": 6906,
    "source": "www.economictimes.indiatimes.com"
  }
}