{
  "url": "https://www.investopedia.com/terms/b/bond.asp",
  "title": "Bonds: How They Work and How To Invest",
  "text": "Table of Contents Expand Table of Contents What Is a Bond? How Bonds Work Characteristics Categories Prices and Interest Rates Yield-to-Maturity (YTM) How To Invest in Bonds Variations FAQs The Bottom Line Bonds: How They Work and How To Invest By Jason Fernando Full Bio Jason Fernando is a professional investor and writer who enjoys tackling and communicating complex business and financial problems. Learn about our editorial policies Updated May 03, 2024 Reviewed by Chip Stapleton Reviewed by Chip Stapleton Full Bio Chip Stapleton is a Series 7 and Series 66 license holder, CFA Level 1 exam holder, and currently holds a Life, Accident, and Health License in Indiana. He has 8 years experience in finance, from financial planning and wealth management to corporate finance and FP&A. Learn about our Financial Review Board Fact checked by Vikki Velasquez Fact checked by Vikki Velasquez Full Bio Vikki Velasquez is a researcher and writer who has managed, coordinated, and directed various community and nonprofit organizations. She has conducted in-depth research on social and economic issues and has also revised and edited educational materials for the Greater Richmond area. Learn about our editorial policies Part of the Series How to Invest with Confidence Investing: An Introduction Stock Market Basics Stock Market Definition Primary and Secondary Markets How to Buy/Sell Stocks Market Hours Stock Exchanges How Stock Investing Works How to Start Investing in Stocks: A Beginner’s Guide What Owning a Stock Means The Basics of Order Types Position Sizing Executing Trades When to Sell a Stock Income, Value, Growth Stocks Commissions Investing vs. Trading Investing and Trading Differences Stocks vs. ETFs Stocks vs. Mutual Funds ETFs vs. Mutual Funds Bonds & Fixed Income What Is a Bond? CURRENT ARTICLE Bond Yield Definition Basic Bond Characteristics How to Buy a Bond Corporate Bonds Government Bonds Municipal Bonds Bond Risks Options & Futures Options vs. Futures Essential Options Trading Managing a Portfolio Diversification Measuring Investment Returns Corporate Actions Dividends Stock Research Stock Fundamentals Essentials of Analyzing Stocks Sectors Evaluating Company Financials Technical Analysis By Jason Fernando Full Bio Jason Fernando is a professional investor and writer who enjoys tackling and communicating complex business and financial problems. Learn about our editorial policies Updated May 03, 2024 Reviewed by Chip Stapleton Reviewed by Chip Stapleton Full Bio Chip Stapleton is a Series 7 and Series 66 license holder, CFA Level 1 exam holder, and currently holds a Life, Accident, and Health License in Indiana. He has 8 years experience in finance, from financial planning and wealth management to corporate finance and FP&A. Learn about our Financial Review Board Fact checked by Vikki Velasquez Fact checked by Vikki Velasquez Full Bio Vikki Velasquez is a researcher and writer who has managed, coordinated, and directed various community and nonprofit organizations. She has conducted in-depth research on social and economic issues and has also revised and edited educational materials for the Greater Richmond area. Learn about our editorial policies CURRENT ARTICLE 0 seconds of 1 minute, 38 seconds Volume 0% Press shift question mark to access a list of keyboard shortcuts Keyboard Shortcuts Enabled Disabled Shortcuts Open/Close / or ? Play/Pause SPACE Increase Volume ↑ Decrease Volume ↓ Seek Forward → Seek Backward ← Captions On/Off c Fullscreen/Exit Fullscreen f Mute/Unmute m Decrease Caption Size - Increase Caption Size + or = Seek % 0-9 Next Up 8 Most Successful Products From \"Shark Tank\" 00:32 Subtitle Settings Off English English Font Color White Font Opacity 100% Font Size 100% Font Family sans-serif Character Edge None Edge Color Black Background Color Black Background Opacity 75% Window Color Black Window Opacity 0% Reset White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 200% 175% 150% 125% 100% 75% 50% Arial Courier Georgia Impact Lucida Console Tahoma Times New Roman Trebuchet MS Verdana None Raised Depressed Uniform Drop Shadow White Black Red Green Blue Yellow Magenta Cyan White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% Live 00:00 01:38 01:38 More Videos 01:38 Bond Definition 00:32 8 Most Successful Products From \"Shark Tank\" 00:35 9 States With No Income Tax 00:36 How Much Income Puts You in the Top 1%, 5%, 10%? 00:32 The 10 Greatest Entrepreneurs 00:32 6 Strategies to Protect Income From Taxes Close This video file cannot be played. (Error Code: 224003) Definition A bond is a fixed-income instrument representing a loan made by an investor to a borrower that’s typically a corporate or government entity. What Is a Bond? A bond is a fixed-income instrument and investment product where individuals lend money to a government or company at a certain interest rate for an amount of time. The entity repays individuals with interest in addition to the original face value of the bond. Bonds are used by companies, municipalities, states, and sovereign governments to finance projects and operations. Owners of bonds are debtholders, or creditors, of the issuer. Bond details include the end date when the principal of the loan is due to be paid to the bond owner and usually include the terms for variable or fixed interest payments made by the borrower. Key Takeaways A bond is referred to as a fixed-income instrument since bonds traditionally pay a fixed interest rate or coupon to debtholders. Bond prices are inversely correlated with interest rates: when rates go up, bond prices fall, and vice-versa. Bonds have maturity dates at which point the principal amount must be paid back in full or risk default. Investopedia / Ellen Lindner How Bonds Work Bonds are debt instruments and represent loans made to the issuer. Bonds allow individual investors to assume the role of the lender. Governments and corporations commonly use bonds to borrow money to fund roads, schools, dams, or other infrastructure. 1 2 Corporations often borrow to grow their business , buy property and equipment, undertake profitable projects, for research and development, or to hire employees. 1 Bonds are fixed-income securities and are one of the main asset classes for individual investors, along with equities and cash equivalents. The borrower issues a bond that includes the terms of the loan, interest payments that will be made, and the maturity date the bond principal must be paid back. The interest payment is part of the return that bondholders earn for loaning their funds to the issuer. 3 The interest rate that determines the payment is called the coupon rate . 4 The initial price of most bonds is typically set at par or $1,000 face value per individual bond. The actual market price of a bond depends on the credit quality of the issuer, the length of time until expiration, and the coupon rate compared to the general interest rate environment. The face value of the bond is what is paid to the lender once the bond matures. 5 Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Fast Fact Markets allow lenders to sell their bonds to other investors or to buy bonds from other individuals—long after the original issuing organization raised capital. A bond investor does not have to hold a bond through to its maturity date . Characteristics of Bonds Face value or Par Value : The value of the bond at maturity and the reference amount the bond issuer uses when calculating interest payments. Coupon Rate: The rate of interest the bond issuer will pay on the face value of the bond, expressed as a percentage. 4 Coupon Dates: The dates on which the bond issuer will make interest payments. Maturity Date: The date on which the bond will mature and the bond issuer will pay the bondholder the face value of the bond. Issue Price: The price at which the bond issuer originally sells the bonds. In many cases, bonds are issued at par . Bond Categories There are four primary categories of bonds sold in the markets. However, you may also see foreign bonds issued by global corporations and governments on some platforms. Corporate Bonds : Companies issue corporate bonds rather than seek bank loans for debt financing because bond markets offer more favorable terms and lower interest rates. Municipal Bonds: Issued by states and municipalities. Some municipal bonds offer tax-free coupon income for investors. Government Bonds: Bonds issued by the U.S. Treasury with a year or less to maturity are called “Bills,” bonds issued with one–10 years to maturity are called “notes,” and government bonds issued with more than 10 years to maturity are called “bonds.” The entire category of bonds issued by a government treasury is often collectively referred to as \" treasuries .\" Agency Bonds : Issued by government-affiliated organizations such as Fannie Mae or Freddie Mac are considered agency bonds . 1 Bond Prices and Interest Rates A bond's price changes daily where supply and demand determine that observed price. If an investor holds a bond to maturity they will get their principal back plus interest. However, a bondholder can sell their bonds in the open market, where the price can fluctuate. a bond’s price varies inversely with interest rates. When interest rates go up, bond prices fall to have the effect of equalizing the interest rate on the bond with prevailing rates, and vice versa. 5 The issuer of a fixed-rate bond promises to pay a coupon based on the face value of the bond. For a $1,000 par, 10% annual coupon bond, the issuer will pay the bondholder $100 each year. 5 If prevailing market interest rates are also 10% at the time that this bond is issued, an investor would be indifferent to investing in the corporate bond or the government bond since both would return $100. However, if interest rates drop to 5%, the investor can only receive $50 from the government bond but would still receive $100 from the corporate bond. Investors bid up to the price of the bond until it trades at a premium that equalizes the prevailing interest rate environment—in this case, the bond will trade at $2,000 so that the $100 coupon represents 5%. Likewise, if interest rates soared to 15%, then an investor could make $150 from the government bond and would not pay $1,000 to earn just $100. This bond would be sold until it reached a price that equalized the yields, in this case to a price of $666.67. Yield-to-Maturity (YTM) The yield-to-maturity (YTM) is the total return anticipated on a bond if the bond is held until the end of its lifetime. Yield to maturity is considered a long-term bond yield but is expressed as an annual rate. YTM is the internal rate of return of an investment in a bond if the investor holds the bond until maturity and if all payments are made as scheduled. 6 YTM evaluates the attractiveness of one bond relative to other bonds of different coupons and maturity in the market. The formula for YTM involves solving for the interest rate. YTM. Investopedia Investors can measure the anticipated changes in bond prices given a change in interest rates with the duration of a bond. Duration represents the price change in a bond given a 1% change in interest rates. 7 This practical definition is the modified duration of a bond. Bonds with long maturities, and also bonds with low coupons have the greatest sensitivity to interest rate changes. How To Invest in Bonds While there are some specialized bond brokers, most online and discount brokers offer access to bond markets, and investors can buy them like stocks. Treasury bonds and TIPS are typically sold directly via the federal government and can be purchased via its TreasuryDirect website. Investors can also buy bonds indirectly via fixed-income ETFs or mutual funds that invest in a portfolio of bonds . Investors can also take a look at Investopedia's list of the best online stock brokers . Image by Sabrina Jiang Â© Investopedia 2020 Bond Variations The bonds available for investors come in many different varieties, depending on the rate or type of interest or coupon payment, by being recalled by the issuer, or because they have other attributes. Zero-Coupon Bonds (Z-bonds): Do not pay coupon payments and instead are issued at a discount to their par value that will generate a return once the bondholder is paid the full face value when the bond matures. U.S. Treasury bills are zero-coupon bonds . 8 Convertible Bonds : Debt instruments with an embedded option that allows bondholders to convert their debt into stock (equity) at some point, depending on certain conditions like the share price. 9 Callable Bonds : Have an embedded option, but it is different than what is found in a convertible bond. A callable bond can be “called” back by the company before it matures. A callable bond is riskier for the bond buyer because the bond is more likely to be called when it is rising in value. 10 Puttable Bonds : allows the bondholders to put or sell the bond back to the company before it has matured. 11 This is valuable for investors who are worried that a bond may fall in value or if they think interest rates will rise and they want to get their principal back before the bond falls in value. A puttable bond usually trades at a higher value than a bond without a put option but with the same credit rating, maturity, and coupon rate because it is more valuable to the bondholders. What Determines a Bond's Coupon Rate? Two features of a bond—credit quality and time to maturity—are the principal determinants of a bond's coupon rate. If the issuer has a poor credit rating , the risk of default is greater, and these bonds pay more interest. Bonds that have a very long maturity date also usually pay a higher interest rate. This higher compensation is because the bondholder is more exposed to interest rate and inflation risks for an extended period. How Are Bond's Rated? Credit ratings for a company and its bonds are generated by credit rating agencies like Standard and Poor’s , Moody’s , and Fitch Ratings . The very highest quality bonds are called “ investment grade ” and include debt issued by the U.S. government and very stable companies, such as many utilities. 12 13 Bonds that are not considered investment grade but are not in default are called “ high yield ” or “junk” bonds. These bonds have a higher risk of default in the future and investors demand a higher coupon payment to compensate them for that risk. 14 What Is Duration? Bonds and bond portfolios will rise or fall in value as interest rates change. The sensitivity to changes in the interest rate environment is called “ duration .” The use of the term duration in this context can be confusing to new bond investors because it does not refer to the length of time the bond has before maturity. Instead, duration describes how much a bond’s price will rise or fall with a change in interest rates. The Bottom Line Bonds are issued by companies and governments to finance projects and fund operations. A bond is considered a fixed-income instrument since bonds traditionally pay a fixed interest rate to debtholders. Investors can purchase corporate bonds through financial institutions or online brokers or buy government bonds through the U.S. Treasury website. Sponsored Trade on the Go. Anywhere, Anytime One of the world's largest crypto-asset exchanges is ready for you. Enjoy competitive fees and dedicated customer support while trading securely. You'll also have access to Binance tools that make it easier than ever to view your trade history, manage auto-investments, view price charts, and make conversions with zero fees. Make an account for free and join millions of traders and investors on the global crypto market. 0 seconds of 1 minute, 38 seconds Volume 0% Press shift question mark to access a list of keyboard shortcuts Keyboard Shortcuts Enabled Disabled Shortcuts Open/Close / or ? Play/Pause SPACE Increase Volume ↑ Decrease Volume ↓ Seek Forward → Seek Backward ← Captions On/Off c Fullscreen/Exit Fullscreen f Mute/Unmute m Decrease Caption Size - Increase Caption Size + or = Seek % 0-9 Next Up 8 Most Successful Products From \"Shark Tank\" 00:32 Subtitle Settings Off English English Font Color White Font Opacity 100% Font Size 100% Font Family sans-serif Character Edge None Edge Color Black Background Color Black Background Opacity 75% Window Color Black Window Opacity 0% Reset White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 200% 175% 150% 125% 100% 75% 50% Arial Courier Georgia Impact Lucida Console Tahoma Times New Roman Trebuchet MS Verdana None Raised Depressed Uniform Drop Shadow White Black Red Green Blue Yellow Magenta Cyan White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% Live 00:00 01:38 01:38 More Videos 01:38 Bond Definition 00:32 8 Most Successful Products From \"Shark Tank\" 00:35 9 States With No Income Tax 00:36 How Much Income Puts You in the Top 1%, 5%, 10%? 00:32 The 10 Greatest Entrepreneurs 00:32 6 Strategies to Protect Income From Taxes Close This video file cannot be played. (Error Code: 224003) Definition A bond is a fixed-income instrument representing a loan made by an investor to a borrower that’s typically a corporate or government entity. What Is a Bond? A bond is a fixed-income instrument and investment product where individuals lend money to a government or company at a certain interest rate for an amount of time. The entity repays individuals with interest in addition to the original face value of the bond. Bonds are used by companies, municipalities, states, and sovereign governments to finance projects and operations. Owners of bonds are debtholders, or creditors, of the issuer. Bond details include the end date when the principal of the loan is due to be paid to the bond owner and usually include the terms for variable or fixed interest payments made by the borrower. Key Takeaways A bond is referred to as a fixed-income instrument since bonds traditionally pay a fixed interest rate or coupon to debtholders. Bond prices are inversely correlated with interest rates: when rates go up, bond prices fall, and vice-versa. Bonds have maturity dates at which point the principal amount must be paid back in full or risk default. Investopedia / Ellen Lindner How Bonds Work Bonds are debt instruments and represent loans made to the issuer. Bonds allow individual investors to assume the role of the lender. Governments and corporations commonly use bonds to borrow money to fund roads, schools, dams, or other infrastructure. 1 2 Corporations often borrow to grow their business , buy property and equipment, undertake profitable projects, for research and development, or to hire employees. 1 Bonds are fixed-income securities and are one of the main asset classes for individual investors, along with equities and cash equivalents. The borrower issues a bond that includes the terms of the loan, interest payments that will be made, and the maturity date the bond principal must be paid back. The interest payment is part of the return that bondholders earn for loaning their funds to the issuer. 3 The interest rate that determines the payment is called the coupon rate . 4 The initial price of most bonds is typically set at par or $1,000 face value per individual bond. The actual market price of a bond depends on the credit quality of the issuer, the length of time until expiration, and the coupon rate compared to the general interest rate environment. The face value of the bond is what is paid to the lender once the bond matures. 5 Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Fast Fact Markets allow lenders to sell their bonds to other investors or to buy bonds from other individuals—long after the original issuing organization raised capital. A bond investor does not have to hold a bond through to its maturity date . Characteristics of Bonds Face value or Par Value : The value of the bond at maturity and the reference amount the bond issuer uses when calculating interest payments. Coupon Rate: The rate of interest the bond issuer will pay on the face value of the bond, expressed as a percentage. 4 Coupon Dates: The dates on which the bond issuer will make interest payments. Maturity Date: The date on which the bond will mature and the bond issuer will pay the bondholder the face value of the bond. Issue Price: The price at which the bond issuer originally sells the bonds. In many cases, bonds are issued at par . Bond Categories There are four primary categories of bonds sold in the markets. However, you may also see foreign bonds issued by global corporations and governments on some platforms. Corporate Bonds : Companies issue corporate bonds rather than seek bank loans for debt financing because bond markets offer more favorable terms and lower interest rates. Municipal Bonds: Issued by states and municipalities. Some municipal bonds offer tax-free coupon income for investors. Government Bonds: Bonds issued by the U.S. Treasury with a year or less to maturity are called “Bills,” bonds issued with one–10 years to maturity are called “notes,” and government bonds issued with more than 10 years to maturity are called “bonds.” The entire category of bonds issued by a government treasury is often collectively referred to as \" treasuries .\" Agency Bonds : Issued by government-affiliated organizations such as Fannie Mae or Freddie Mac are considered agency bonds . 1 Bond Prices and Interest Rates A bond's price changes daily where supply and demand determine that observed price. If an investor holds a bond to maturity they will get their principal back plus interest. However, a bondholder can sell their bonds in the open market, where the price can fluctuate. a bond’s price varies inversely with interest rates. When interest rates go up, bond prices fall to have the effect of equalizing the interest rate on the bond with prevailing rates, and vice versa. 5 The issuer of a fixed-rate bond promises to pay a coupon based on the face value of the bond. For a $1,000 par, 10% annual coupon bond, the issuer will pay the bondholder $100 each year. 5 If prevailing market interest rates are also 10% at the time that this bond is issued, an investor would be indifferent to investing in the corporate bond or the government bond since both would return $100. However, if interest rates drop to 5%, the investor can only receive $50 from the government bond but would still receive $100 from the corporate bond. Investors bid up to the price of the bond until it trades at a premium that equalizes the prevailing interest rate environment—in this case, the bond will trade at $2,000 so that the $100 coupon represents 5%. Likewise, if interest rates soared to 15%, then an investor could make $150 from the government bond and would not pay $1,000 to earn just $100. This bond would be sold until it reached a price that equalized the yields, in this case to a price of $666.67. Yield-to-Maturity (YTM) The yield-to-maturity (YTM) is the total return anticipated on a bond if the bond is held until the end of its lifetime. Yield to maturity is considered a long-term bond yield but is expressed as an annual rate. YTM is the internal rate of return of an investment in a bond if the investor holds the bond until maturity and if all payments are made as scheduled. 6 YTM evaluates the attractiveness of one bond relative to other bonds of different coupons and maturity in the market. The formula for YTM involves solving for the interest rate. YTM. Investopedia Investors can measure the anticipated changes in bond prices given a change in interest rates with the duration of a bond. Duration represents the price change in a bond given a 1% change in interest rates. 7 This practical definition is the modified duration of a bond. Bonds with long maturities, and also bonds with low coupons have the greatest sensitivity to interest rate changes. How To Invest in Bonds While there are some specialized bond brokers, most online and discount brokers offer access to bond markets, and investors can buy them like stocks. Treasury bonds and TIPS are typically sold directly via the federal government and can be purchased via its TreasuryDirect website. Investors can also buy bonds indirectly via fixed-income ETFs or mutual funds that invest in a portfolio of bonds . Investors can also take a look at Investopedia's list of the best online stock brokers . Image by Sabrina Jiang Â© Investopedia 2020 Bond Variations The bonds available for investors come in many different varieties, depending on the rate or type of interest or coupon payment, by being recalled by the issuer, or because they have other attributes. Zero-Coupon Bonds (Z-bonds): Do not pay coupon payments and instead are issued at a discount to their par value that will generate a return once the bondholder is paid the full face value when the bond matures. U.S. Treasury bills are zero-coupon bonds . 8 Convertible Bonds : Debt instruments with an embedded option that allows bondholders to convert their debt into stock (equity) at some point, depending on certain conditions like the share price. 9 Callable Bonds : Have an embedded option, but it is different than what is found in a convertible bond. A callable bond can be “called” back by the company before it matures. A callable bond is riskier for the bond buyer because the bond is more likely to be called when it is rising in value. 10 Puttable Bonds : allows the bondholders to put or sell the bond back to the company before it has matured. 11 This is valuable for investors who are worried that a bond may fall in value or if they think interest rates will rise and they want to get their principal back before the bond falls in value. A puttable bond usually trades at a higher value than a bond without a put option but with the same credit rating, maturity, and coupon rate because it is more valuable to the bondholders. What Determines a Bond's Coupon Rate? Two features of a bond—credit quality and time to maturity—are the principal determinants of a bond's coupon rate. If the issuer has a poor credit rating , the risk of default is greater, and these bonds pay more interest. Bonds that have a very long maturity date also usually pay a higher interest rate. This higher compensation is because the bondholder is more exposed to interest rate and inflation risks for an extended period. How Are Bond's Rated? Credit ratings for a company and its bonds are generated by credit rating agencies like Standard and Poor’s , Moody’s , and Fitch Ratings . The very highest quality bonds are called “ investment grade ” and include debt issued by the U.S. government and very stable companies, such as many utilities. 12 13 Bonds that are not considered investment grade but are not in default are called “ high yield ” or “junk” bonds. These bonds have a higher risk of default in the future and investors demand a higher coupon payment to compensate them for that risk. 14 What Is Duration? Bonds and bond portfolios will rise or fall in value as interest rates change. The sensitivity to changes in the interest rate environment is called “ duration .” The use of the term duration in this context can be confusing to new bond investors because it does not refer to the length of time the bond has before maturity. Instead, duration describes how much a bond’s price will rise or fall with a change in interest rates. The Bottom Line Bonds are issued by companies and governments to finance projects and fund operations. A bond is considered a fixed-income instrument since bonds traditionally pay a fixed interest rate to debtholders. Investors can purchase corporate bonds through financial institutions or online brokers or buy government bonds through the U.S. Treasury website. Sponsored Trade on the Go. Anywhere, Anytime One of the world's largest crypto-asset exchanges is ready for you. Enjoy competitive fees and dedicated customer support while trading securely. You'll also have access to Binance tools that make it easier than ever to view your trade history, manage auto-investments, view price charts, and make conversions with zero fees. Make an account for free and join millions of traders and investors on the global crypto market. What Is a Bond? A bond is a fixed-income instrument and investment product where individuals lend money to a government or company at a certain interest rate for an amount of time. The entity repays individuals with interest in addition to the original face value of the bond. Bonds are used by companies, municipalities, states, and sovereign governments to finance projects and operations. Owners of bonds are debtholders, or creditors, of the issuer. Bond details include the end date when the principal of the loan is due to be paid to the bond owner and usually include the terms for variable or fixed interest payments made by the borrower. Key Takeaways A bond is referred to as a fixed-income instrument since bonds traditionally pay a fixed interest rate or coupon to debtholders. Bond prices are inversely correlated with interest rates: when rates go up, bond prices fall, and vice-versa. Bonds have maturity dates at which point the principal amount must be paid back in full or risk default. Investopedia / Ellen Lindner How Bonds Work Bonds are debt instruments and represent loans made to the issuer. Bonds allow individual investors to assume the role of the lender. Governments and corporations commonly use bonds to borrow money to fund roads, schools, dams, or other infrastructure. 1 2 Corporations often borrow to grow their business , buy property and equipment, undertake profitable projects, for research and development, or to hire employees. 1 Bonds are fixed-income securities and are one of the main asset classes for individual investors, along with equities and cash equivalents. The borrower issues a bond that includes the terms of the loan, interest payments that will be made, and the maturity date the bond principal must be paid back. The interest payment is part of the return that bondholders earn for loaning their funds to the issuer. 3 The interest rate that determines the payment is called the coupon rate . 4 The initial price of most bonds is typically set at par or $1,000 face value per individual bond. The actual market price of a bond depends on the credit quality of the issuer, the length of time until expiration, and the coupon rate compared to the general interest rate environment. The face value of the bond is what is paid to the lender once the bond matures. 5 Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Fast Fact Markets allow lenders to sell their bonds to other investors or to buy bonds from other individuals—long after the original issuing organization raised capital. A bond investor does not have to hold a bond through to its maturity date . Characteristics of Bonds Face value or Par Value : The value of the bond at maturity and the reference amount the bond issuer uses when calculating interest payments. Coupon Rate: The rate of interest the bond issuer will pay on the face value of the bond, expressed as a percentage. 4 Coupon Dates: The dates on which the bond issuer will make interest payments. Maturity Date: The date on which the bond will mature and the bond issuer will pay the bondholder the face value of the bond. Issue Price: The price at which the bond issuer originally sells the bonds. In many cases, bonds are issued at par . Bond Categories There are four primary categories of bonds sold in the markets. However, you may also see foreign bonds issued by global corporations and governments on some platforms. Corporate Bonds : Companies issue corporate bonds rather than seek bank loans for debt financing because bond markets offer more favorable terms and lower interest rates. Municipal Bonds: Issued by states and municipalities. Some municipal bonds offer tax-free coupon income for investors. Government Bonds: Bonds issued by the U.S. Treasury with a year or less to maturity are called “Bills,” bonds issued with one–10 years to maturity are called “notes,” and government bonds issued with more than 10 years to maturity are called “bonds.” The entire category of bonds issued by a government treasury is often collectively referred to as \" treasuries .\" Agency Bonds : Issued by government-affiliated organizations such as Fannie Mae or Freddie Mac are considered agency bonds . 1 Bond Prices and Interest Rates A bond's price changes daily where supply and demand determine that observed price. If an investor holds a bond to maturity they will get their principal back plus interest. However, a bondholder can sell their bonds in the open market, where the price can fluctuate. a bond’s price varies inversely with interest rates. When interest rates go up, bond prices fall to have the effect of equalizing the interest rate on the bond with prevailing rates, and vice versa. 5 The issuer of a fixed-rate bond promises to pay a coupon based on the face value of the bond. For a $1,000 par, 10% annual coupon bond, the issuer will pay the bondholder $100 each year. 5 If prevailing market interest rates are also 10% at the time that this bond is issued, an investor would be indifferent to investing in the corporate bond or the government bond since both would return $100. However, if interest rates drop to 5%, the investor can only receive $50 from the government bond but would still receive $100 from the corporate bond. Investors bid up to the price of the bond until it trades at a premium that equalizes the prevailing interest rate environment—in this case, the bond will trade at $2,000 so that the $100 coupon represents 5%. Likewise, if interest rates soared to 15%, then an investor could make $150 from the government bond and would not pay $1,000 to earn just $100. This bond would be sold until it reached a price that equalized the yields, in this case to a price of $666.67. Yield-to-Maturity (YTM) The yield-to-maturity (YTM) is the total return anticipated on a bond if the bond is held until the end of its lifetime. Yield to maturity is considered a long-term bond yield but is expressed as an annual rate. YTM is the internal rate of return of an investment in a bond if the investor holds the bond until maturity and if all payments are made as scheduled. 6 YTM evaluates the attractiveness of one bond relative to other bonds of different coupons and maturity in the market. The formula for YTM involves solving for the interest rate. YTM. Investopedia Investors can measure the anticipated changes in bond prices given a change in interest rates with the duration of a bond. Duration represents the price change in a bond given a 1% change in interest rates. 7 This practical definition is the modified duration of a bond. Bonds with long maturities, and also bonds with low coupons have the greatest sensitivity to interest rate changes. How To Invest in Bonds While there are some specialized bond brokers, most online and discount brokers offer access to bond markets, and investors can buy them like stocks. Treasury bonds and TIPS are typically sold directly via the federal government and can be purchased via its TreasuryDirect website. Investors can also buy bonds indirectly via fixed-income ETFs or mutual funds that invest in a portfolio of bonds . Investors can also take a look at Investopedia's list of the best online stock brokers . Image by Sabrina Jiang Â© Investopedia 2020 Bond Variations The bonds available for investors come in many different varieties, depending on the rate or type of interest or coupon payment, by being recalled by the issuer, or because they have other attributes. Zero-Coupon Bonds (Z-bonds): Do not pay coupon payments and instead are issued at a discount to their par value that will generate a return once the bondholder is paid the full face value when the bond matures. U.S. Treasury bills are zero-coupon bonds . 8 Convertible Bonds : Debt instruments with an embedded option that allows bondholders to convert their debt into stock (equity) at some point, depending on certain conditions like the share price. 9 Callable Bonds : Have an embedded option, but it is different than what is found in a convertible bond. A callable bond can be “called” back by the company before it matures. A callable bond is riskier for the bond buyer because the bond is more likely to be called when it is rising in value. 10 Puttable Bonds : allows the bondholders to put or sell the bond back to the company before it has matured. 11 This is valuable for investors who are worried that a bond may fall in value or if they think interest rates will rise and they want to get their principal back before the bond falls in value. A puttable bond usually trades at a higher value than a bond without a put option but with the same credit rating, maturity, and coupon rate because it is more valuable to the bondholders. What Determines a Bond's Coupon Rate? Two features of a bond—credit quality and time to maturity—are the principal determinants of a bond's coupon rate. If the issuer has a poor credit rating , the risk of default is greater, and these bonds pay more interest. Bonds that have a very long maturity date also usually pay a higher interest rate. This higher compensation is because the bondholder is more exposed to interest rate and inflation risks for an extended period. How Are Bond's Rated? Credit ratings for a company and its bonds are generated by credit rating agencies like Standard and Poor’s , Moody’s , and Fitch Ratings . The very highest quality bonds are called “ investment grade ” and include debt issued by the U.S. government and very stable companies, such as many utilities. 12 13 Bonds that are not considered investment grade but are not in default are called “ high yield ” or “junk” bonds. These bonds have a higher risk of default in the future and investors demand a higher coupon payment to compensate them for that risk. 14 What Is Duration? Bonds and bond portfolios will rise or fall in value as interest rates change. The sensitivity to changes in the interest rate environment is called “ duration .” The use of the term duration in this context can be confusing to new bond investors because it does not refer to the length of time the bond has before maturity. Instead, duration describes how much a bond’s price will rise or fall with a change in interest rates. The Bottom Line Bonds are issued by companies and governments to finance projects and fund operations. A bond is considered a fixed-income instrument since bonds traditionally pay a fixed interest rate to debtholders. Investors can purchase corporate bonds through financial institutions or online brokers or buy government bonds through the U.S. Treasury website. Article Sources Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. Financial Industry Regulatory Authority. \" Bonds: Types .\" U.S. Securities and Exchange Commission. \" Investor Bulletin: Municipal Bonds – An Overview .\" Financial Industry Regulatory Authority. \" Bonds: Overview .\" Financial Industry Regulatory Authority. \" Bonds: Key Terms .\" Financial Industry Regulatory Authority. \" Bonds: Buying and Selling .\" Financial Industry Regulatory Authority. \" Understanding Bond Yield and Return .\" Financial Industry Regulatory Authority. \" Brush Up on Bonds: Interest Rate Hikes and Duration .\" Financial Industry Regulatory Authority. \" The One-Minute Guide to Zero Coupon Bonds .\" U.S. Securities and Exchange Commission. \" Convertible Securities .\" Financial Industry Regulatory Authority. \" Callable Bonds: Don’t Be Surprised When Your Issuer Comes Calling .\" California Debt and Investment Advisory Commission. \" The Public Investment Portfolio: Making Sense of Corporate Notes and Bonds .\" Page 20. U.S. Securities and Exchange Commission. \" Updated Investor Bulletin: The ABCs of Credit Ratings .\" U.S. Securities and Exchange Commission. \" Current NRSROs .\" Financial Industry Regulatory Authority. \" What to Know Before Saying Hi to High-Yield Bonds .\" Compare Accounts Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Part of the Series How to Invest with Confidence Investing: An Introduction Stock Market Basics Stock Market Definition Primary and Secondary Markets How to Buy/Sell Stocks Market Hours Stock Exchanges How Stock Investing Works How to Start Investing in Stocks: A Beginner’s Guide What Owning a Stock Means The Basics of Order Types Position Sizing Executing Trades When to Sell a Stock Income, Value, Growth Stocks Commissions Investing vs. Trading Investing and Trading Differences Stocks vs. ETFs Stocks vs. Mutual Funds ETFs vs. Mutual Funds Bonds & Fixed Income What Is a Bond? CURRENT ARTICLE Bond Yield Definition Basic Bond Characteristics How to Buy a Bond Corporate Bonds Government Bonds Municipal Bonds Bond Risks Options & Futures Options vs. Futures Essential Options Trading Managing a Portfolio Diversification Measuring Investment Returns Corporate Actions Dividends Stock Research Stock Fundamentals Essentials of Analyzing Stocks Sectors Evaluating Company Financials Technical Analysis Read more Investing Partner Links Article Sources Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. Financial Industry Regulatory Authority. \" Bonds: Types .\" U.S. Securities and Exchange Commission. \" Investor Bulletin: Municipal Bonds – An Overview .\" Financial Industry Regulatory Authority. \" Bonds: Overview .\" Financial Industry Regulatory Authority. \" Bonds: Key Terms .\" Financial Industry Regulatory Authority. \" Bonds: Buying and Selling .\" Financial Industry Regulatory Authority. \" Understanding Bond Yield and Return .\" Financial Industry Regulatory Authority. \" Brush Up on Bonds: Interest Rate Hikes and Duration .\" Financial Industry Regulatory Authority. \" The One-Minute Guide to Zero Coupon Bonds .\" U.S. Securities and Exchange Commission. \" Convertible Securities .\" Financial Industry Regulatory Authority. \" Callable Bonds: Don’t Be Surprised When Your Issuer Comes Calling .\" California Debt and Investment Advisory Commission. \" The Public Investment Portfolio: Making Sense of Corporate Notes and Bonds .\" Page 20. U.S. Securities and Exchange Commission. \" Updated Investor Bulletin: The ABCs of Credit Ratings .\" U.S. Securities and Exchange Commission. \" Current NRSROs .\" Financial Industry Regulatory Authority. \" What to Know Before Saying Hi to High-Yield Bonds .\" Article Sources Article Sources    Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. Financial Industry Regulatory Authority. \" Bonds: Types .\" U.S. Securities and Exchange Commission. \" Investor Bulletin: Municipal Bonds – An Overview .\" Financial Industry Regulatory Authority. \" Bonds: Overview .\" Financial Industry Regulatory Authority. \" Bonds: Key Terms .\" Financial Industry Regulatory Authority. \" Bonds: Buying and Selling .\" Financial Industry Regulatory Authority. \" Understanding Bond Yield and Return .\" Financial Industry Regulatory Authority. \" Brush Up on Bonds: Interest Rate Hikes and Duration .\" Financial Industry Regulatory Authority. \" The One-Minute Guide to Zero Coupon Bonds .\" U.S. Securities and Exchange Commission. \" Convertible Securities .\" Financial Industry Regulatory Authority. \" Callable Bonds: Don’t Be Surprised When Your Issuer Comes Calling .\" California Debt and Investment Advisory Commission. \" The Public Investment Portfolio: Making Sense of Corporate Notes and Bonds .\" Page 20. U.S. Securities and Exchange Commission. \" Updated Investor Bulletin: The ABCs of Credit Ratings .\" U.S. Securities and Exchange Commission. \" Current NRSROs .\" Financial Industry Regulatory Authority. \" What to Know Before Saying Hi to High-Yield Bonds .\" CURRENT ARTICLE ",
  "matched_keywords": [
    "stocks",
    "equity",
    "mutual funds",
    "ETF",
    "interest rates",
    "inflation",
    "NSE",
    "BSE",
    "dividends",
    "portfolio",
    "investment",
    "bonds",
    "debt",
    "crypto"
  ],
  "embedding": [
    -0.007114926818758249,
    -0.014741580933332443,
    -0.07991679012775421,
    -0.00836485717445612,
    -0.03957141190767288,
    0.0031835194677114487,
    0.015283347107470036,
    0.1162514016032219,
    0.009582209400832653,
    0.02812132239341736,
    -0.0009053532849065959,
    0.026583915576338768,
    -0.07818374037742615,
    -0.017331646755337715,
    0.0015321094542741776,
    -0.03447875380516052,
    0.014361672103404999,
    -0.023801807314157486,
    -0.06134246289730072,
    0.0744747593998909,
    0.015165737830102444,
    0.0018327198922634125,
    0.05121062695980072,
    -0.033905792981386185,
    -0.01849810779094696,
    0.010028182528913021,
    0.007372821681201458,
    0.048144374042749405,
    -0.03848909214138985,
    0.04619261249899864,
    0.016585994511842728,
    0.02563086338341236,
    0.059960030019283295,
    0.008960820734500885,
    0.06478456407785416,
    0.05207278952002525,
    -0.03257566690444946,
    0.012162528932094574,
    0.013958402909338474,
    -0.051609862595796585,
    -0.006261139642447233,
    -0.05951971933245659,
    -0.005021624267101288,
    0.01378706656396389,
    0.02769911102950573,
    -0.0868740826845169,
    -0.024421602487564087,
    -0.010727421380579472,
    0.007375819142907858,
    -0.029506906867027283,
    -0.11162193864583969,
    -0.017676999792456627,
    -0.009151097387075424,
    -0.08131169527769089,
    -0.08893843740224838,
    0.05284396931529045,
    -0.09767336398363113,
    0.027147209271788597,
    -0.043958377093076706,
    -5.096932454762282e-06,
    0.10383570194244385,
    0.019736487418413162,
    -0.03388141095638275,
    0.04960763826966286,
    -0.03550422191619873,
    0.045808106660842896,
    0.03529341146349907,
    0.12154076248407364,
    3.7499412428587675e-05,
    -0.07128027081489563,
    0.05846138298511505,
    -0.029520684853196144,
    -0.05816300958395004,
    -0.024784952402114868,
    -0.012923753820359707,
    0.012704301625490189,
    0.01331056747585535,
    0.042936328798532486,
    0.018893668428063393,
    -0.06582251936197281,
    0.02592555806040764,
    -0.013103789649903774,
    0.004148638807237148,
    0.03288774937391281,
    -0.07762090116739273,
    -0.0082118334248662,
    -0.009424366988241673,
    0.02772134356200695,
    0.0173216313123703,
    0.0565679632127285,
    0.06379096210002899,
    0.03566918149590492,
    -0.02040989324450493,
    -0.042951539158821106,
    -0.02105007879436016,
    0.04757143184542656,
    -0.019432561472058296,
    -0.05483598634600639,
    -0.10193032771348953,
    0.047918833792209625,
    0.1304246485233307,
    -0.03644359111785889,
    -0.028777897357940674,
    -0.011896752752363682,
    -0.025683272629976273,
    -0.015492024831473827,
    -0.022132769227027893,
    0.003960714675486088,
    0.007147574331611395,
    -0.006415189243853092,
    -0.07339154928922653,
    0.10554157197475433,
    -0.05657164379954338,
    -0.013246031478047371,
    0.03035929426550865,
    -0.016424816101789474,
    -0.06165413185954094,
    0.03871851786971092,
    0.13171148300170898,
    0.020756147801876068,
    0.06610200554132462,
    0.051934096962213516,
    -0.06487677991390228,
    0.007816947996616364,
    0.020162206143140793,
    -0.0721680223941803,
    -0.042462535202503204,
    8.676558167605499e-33,
    -0.04496906325221062,
    0.052668020129203796,
    0.06071787327528,
    0.08417841792106628,
    -0.11042369157075882,
    0.04871492087841034,
    -0.001964024268090725,
    0.025384515523910522,
    -0.14297950267791748,
    0.03400930389761925,
    0.03306650370359421,
    -0.0013621400576084852,
    0.05321277678012848,
    -0.011891725473105907,
    -0.02348347008228302,
    0.013464337214827538,
    -0.11355120688676834,
    0.015635866671800613,
    0.07090301811695099,
    0.005324781406670809,
    0.025940464809536934,
    0.03832980617880821,
    0.05557701736688614,
    -0.01760021038353443,
    0.028575651347637177,
    -0.03439701348543167,
    -0.038200438022613525,
    -0.04007045179605484,
    0.025111155584454536,
    0.03491760417819023,
    -0.03849349915981293,
    0.039262376725673676,
    -0.052822716534137726,
    -0.10301527380943298,
    0.03806722164154053,
    0.03943979740142822,
    0.0016150388401001692,
    -0.029178466647863388,
    -0.09614188969135284,
    -0.06953819841146469,
    0.01565694436430931,
    0.07524032890796661,
    -0.050708312541246414,
    0.014426705427467823,
    -0.00426724087446928,
    0.006827449891716242,
    0.11678480356931686,
    0.029274633154273033,
    0.043180566281080246,
    -0.02585631050169468,
    -0.029171384871006012,
    -0.0771944522857666,
    -0.06126086786389351,
    -0.02430882304906845,
    -0.0803082138299942,
    0.06463955342769623,
    -0.03346430882811546,
    -0.020086240023374557,
    -0.0794537216424942,
    -0.054465580731630325,
    0.027584774419665337,
    -0.0570380799472332,
    -0.12782318890094757,
    -0.033475182950496674,
    -0.10910854488611221,
    0.10884801298379898,
    -0.07463496923446655,
    0.011187680996954441,
    -0.02588890865445137,
    0.06847791373729706,
    0.003564312122762203,
    -0.03462566062808037,
    0.00018708199786487967,
    -0.04776250571012497,
    -0.024499429389834404,
    0.03267177566885948,
    -0.03640368580818176,
    0.06920116394758224,
    -0.006379838567227125,
    0.06227565556764603,
    -0.012840001843869686,
    0.008372909389436245,
    -0.018958522006869316,
    -0.013113201595842838,
    -0.016390196979045868,
    0.061094142496585846,
    0.12396080046892166,
    0.013556532561779022,
    0.1604207158088684,
    0.0507286861538887,
    0.09561321139335632,
    -0.0737251415848732,
    0.025271384045481682,
    -0.019571710377931595,
    0.013649006374180317,
    -1.0074147482336273e-32,
    -0.04741761088371277,
    -0.05763225629925728,
    0.0070765214040875435,
    0.0013519631465896964,
    0.050806716084480286,
    -0.02534123696386814,
    -0.11852871626615524,
    -0.0553460419178009,
    0.07035622745752335,
    -0.11868181079626083,
    -0.041808243840932846,
    0.0039191399700939655,
    0.011471659876406193,
    0.03611885383725166,
    -0.08261626958847046,
    -0.02820098213851452,
    -0.06701164692640305,
    -0.034784816205501556,
    0.013937481679022312,
    -0.001004710211418569,
    -0.02542596310377121,
    0.01108955591917038,
    0.02174450270831585,
    0.06499234586954117,
    0.011055344715714455,
    0.03604668751358986,
    -0.04673666134476662,
    0.07440931349992752,
    -0.003624273231253028,
    -0.00011113280197605491,
    -0.0019271471537649632,
    -0.035407133400440216,
    -0.012807849794626236,
    0.03224709630012512,
    -0.08821744471788406,
    0.08862261474132538,
    0.03509993106126785,
    -0.09734388440847397,
    0.01585574261844158,
    -0.017102787271142006,
    0.049246128648519516,
    0.021345777437090874,
    0.002929939655587077,
    -0.0774826928973198,
    -0.06801220774650574,
    0.0011464795097708702,
    0.023532113060355186,
    -0.006502754986286163,
    -0.022703032940626144,
    0.006440212484449148,
    0.026163112372159958,
    -0.0006152254063636065,
    -0.07916698604822159,
    0.01117105782032013,
    0.007328114937990904,
    0.031728632748126984,
    0.04993235692381859,
    -0.017437303438782692,
    -0.046928420662879944,
    0.0353313572704792,
    -0.04256603121757507,
    0.11682421714067459,
    -0.04674708843231201,
    0.03301902115345001,
    0.0409129373729229,
    -0.0799211859703064,
    -0.05212631821632385,
    -0.0372316874563694,
    -0.03293928876519203,
    -0.10256199538707733,
    -0.0282648503780365,
    0.01969209313392639,
    0.011977688409388065,
    -0.1041528508067131,
    -0.00014855574409011751,
    0.06360840052366257,
    -0.021117381751537323,
    -0.09120834618806839,
    -0.043747399002313614,
    0.03772295266389847,
    0.021242352202534676,
    -0.006079589016735554,
    -0.03497539833188057,
    0.04126754775643349,
    -0.03816927224397659,
    0.07144429534673691,
    0.06123564764857292,
    0.03564029559493065,
    -0.03446712717413902,
    -0.0009114483254961669,
    -0.048140112310647964,
    0.01892889104783535,
    0.03016912005841732,
    0.07093951851129532,
    0.011137258261442184,
    -6.67250077412973e-08,
    -0.03558376058936119,
    -0.020128287374973297,
    -0.08829014003276825,
    0.0030263580847531557,
    -0.00304065621457994,
    0.02100953459739685,
    0.03680173680186272,
    -0.021146154031157494,
    0.02008056640625,
    0.07052929699420929,
    0.04906051233410835,
    0.024919375777244568,
    -0.09216217696666718,
    -0.04561557620763779,
    -0.06089886650443077,
    -0.042902011424303055,
    -0.06992553919553757,
    0.0009376303059980273,
    -0.0430244579911232,
    0.0049224854446947575,
    0.09782695770263672,
    -0.004345518536865711,
    -0.015065950341522694,
    -0.013954932801425457,
    0.05325741320848465,
    0.017307767644524574,
    -0.017018983140587807,
    0.0012701646191999316,
    0.05079611763358116,
    0.0685114860534668,
    -0.03836768865585327,
    -0.024573715403676033,
    0.08087270706892014,
    0.032081589102745056,
    0.05655177682638168,
    -0.004688403103500605,
    0.1661975234746933,
    0.010690099559724331,
    0.07258212566375732,
    0.018959883600473404,
    -0.0030886188615113497,
    -0.011192657984793186,
    -0.08889006078243256,
    0.026324063539505005,
    0.00712828291580081,
    0.02604752406477928,
    -0.06026072800159454,
    0.03490389138460159,
    0.02936914749443531,
    -0.05497700348496437,
    0.01759863644838333,
    -0.014370446093380451,
    0.006274276878684759,
    0.05978661775588989,
    0.012753346934914589,
    0.03189947083592415,
    -0.04541534557938576,
    0.08664165437221527,
    -0.056221626698970795,
    -0.01255454309284687,
    0.018033161759376526,
    -0.05391107499599457,
    0.0013583428226411343,
    0.05414177477359772
  ]
}