{
  "url": "https://www.investopedia.com/terms/f/fundamentalanalysis.asp",
  "title": "Fundamental Analysis: Principles, Types, and How to Use It",
  "text": "Definition Fundamental analysis is a technique to measure a companys value based on its financials and other objective metrics, as opposed to market price trends. What Is Fundamental Analysis? Fundamental analysis involves examining a companys financial statements and broader economic indicators to uncover a securitys intrinsic value. The result of such an analysis should give you the investments true worth based on a companys financial health, the market, and economic conditions. Investors perform fundamental analysis to gauge whether or not to invest in a company based on its current and projected worth. Key Takeaways Fundamental analysis is a method of determining a stocks intrinsic value. Fundamental analysts search for stocks trading at prices higher or lower than their real value. Fundamental analysis is different from technical analysis, which studies historical price trends and market sentiment. Most analysts use a combination of fundamental and technical analysis. Investopedia Paige McLaughlin Understanding Fundamental Analysis Fundamental analysis looks at intrinsic factors to determine a companys value, as opposed to its current price or market trends. This approach looks beyond investor sentiment and company marketing to determine if the stock price is over- or undervalued. Fundamental analysis starts by examining the companys financial statements, including the income statement, balance sheet, and statement of cash flows. Analysts look at the companys assets, debts, revenue, and other metrics, and compare them with other companies in the same industry. In addition, fundamental analysis also looks at macroeconomic factors to see if the company is positioned for success. Analysts may consider gross domestic product, inflation, interest rates, industry or sector trends, and the companys competition. This approach often includes reviewing the companys business model, management effectiveness, brand awareness, and potential for growth and profitability. Why Is Fundamental Analysis Important? Fundamentals allow investors to look beyond short-term price fluctuations and focus on the underlying factors that drive a companys operations and long-term performance. The main benefit of fundamental analysis is to help quantify the value of a company and its shares. Financial statements offer hard data that reveal insights into a companys profitability, liquidity , and overall financial stability. This information, along with an assessment of the companys management team, competitive advantages, and industry trends, furnishes an objective measure of the companys value. With this knowledge, investors can make more informed decisions about buying, holding, or selling a particular stock. Fundamental analysis can also help investors identify undervalued companies. By considering a companys sales growth, market share, and product pipeline, investors can gauge its ability to increase future profits and grow shareholder value. Value investors , in particular, look for undervalued shares relative to their fundamental potential. It can also help spot red flags and overvalued investments. By researching a companys financial health and market position, investors can determine if a company is likely to underperform or experience significant downturns. This is especially important during periods of economic uncertainty or market volatility. Where to Find Fundamentals for a Company Some of the most common and reliable sources for the fundamentals of a company include the following Company filings Public companies are required to file regular reports with the Securities and Exchange Commission SEC, such as Form 10-K annual report, Form 10-Q quarterly report, and Form 8-K current events report. These filings contain detailed financial statements, management discussions and analyses, and other important information about the company. You can access these filings for free on the SECs EDGAR database. Company website Most publicly traded companies have an investor relations section that provides financial statements, earnings releases, investor presentations, and other relevant information for shareholders and potential investors. Earnings call transcripts can be particularly helpful since companies use them to address their soft spots for analysts. Financial platforms Yahoo! Finance, Google Finance, and MarketWatch, among others, provide financial news, analysis, and fundamental data on publicly traded companies, including financial statements, key ratios, and analyst ratings. Broker research reports Many brokerage firms supply research reports on companies they and their affiliates cover, often with detailed fundamental analysis and investment recommendations. Financial data providers Subscription-based financial data providers such as Bloomberg, FactSet, and Morningstar offer extensive fundamental data and analysis on companies, industries, and markets. Subscriptions are often pricey, so they are more typically used by professional investors and analysts. Industry trade journals Trade publications covering specific industries can provide valuable insights on industry trends, competitive dynamics, and company-specific developments that inform your fundamental analysis. Remember, when conducting fundamental analysis, its essential to use several sources to get a well-rounded view of a companys financial prospects and to be aware of any potential biases or conflicts of interest in the information youre receiving. Fast Fact Fundamental analysis is used most often for stocks, but it can be useful for evaluating any security, from a bond to a derivative. If you consider the fundamentals, from the broader economy to the company details, you are doing a fundamental analysis. How to Read a Companys Annual Report Reading a companys annual report is an essential part of fundamental analysis. Heres a step-by-step guide on how to read and analyze an annual report Start with the CEOs letter to shareholders This section gives an overview of the companys performance, key developments, and outlook from the perspective of top management. Pay attention to the tone and content of the letter, as it can give insights into the companys strategy, challenges, and prospects. Review the business description This section describes the companys main products or services, target markets, competitive advantages, and key risks. It can help you understand the companys business model and the factors that drive its success. Analyze the managements discussion and analysis MDA The MDA provides a detailed discussion of the companys financial performance, including revenue and expense trends, cash flows, and key financial ratios. It also has managements perspective on the factors that affect the companys performance and outlook for the future. Examine the financial statements The annual report has the companys audited financial statements, including the income statement, balance sheet, and statement of cash flows. Review these carefully while looking for trends in revenue, expenses, profits, assets, liabilities, and cash flows. From there, you can compute the critical financial ratios. Read the notes to the financial statements The notes or footnotes provide additional details and explanations about the companys accounting policies, significant transactions, and other important information that may not be clear from the financial statements alone. Review the auditors report This provides an independent opinion on whether the financial statements fairly present the companys financial position and performance following generally accepted accounting principles. Look for any qualified opinions or disclaimers that may indicate potential issues. Analyze the companys corporate governance The annual report often has information on the companys board of directors, executive compensation, and other corporate governance matters. Consider whether the companys governance practices align with the interests of shareholders and whether there are any red flags, such as conflicts of interest or excessive compensation. Look for additional disclosures The annual report may include additional disclosures about legal proceedings, regulatory issues, or environmental, social, and governance ESG factors that could impact the companys performance and reputation. A Closer Look at Financial Statements The information in financial statements is among the most valuable about a companys financial health and performance. Heres a breakdown of what you can learn from each one Income Statement This shows how much money a company is making revenue, how much theyre spending expenses, and whats left over profit or loss. By looking at trends in revenue and expenses over time, you can get a sense of whether the company is growing or struggling. You can also calculate important ratios like the companys profit margin, which tells you how much of each dollar in sales the company gets to keep as profit. Balance Sheet This gives you a snapshot of what a company owns assets, what it owes liabilities, and what is left over shareholders equity . This can help you assess a companys financial stability and liquidity. For example, if a company has a lot more assets than liabilities, thats generally a good sign. You can also look at how much debt the company has relative to its equity to understand its financial leverage and risk. Statement of Cash Flows This shows how much cash is coming in and going out of the company over a given period. Its broken down into three main categories cash from operations the money generated by the companys core business activities, cash from investing the money spent or earned from investments not related to the core business, and cash from financing the money raised or paid out and used to fund the business. By looking at a companys cash flows, you can better understand its ability to generate cash, pay its bills, and invest in growth. The cash flow statement is crucial because its harder for a business to manipulate its cash situation. An aggressive accountant can do plenty of things to manipulate earnings, for example, but its tough to fake cash in the bank. For this reason, some investors use the cash flow statement as a more conservative measure of a companys performance. Fast Fact A balance sheet gets its name because the three sections it containsassets, liabilities, and shareholders equitymust balance out using this formula Assets Liabilities Shareholders Equity Quantitative and Qualitative Fundamental Analysis The problem with defining the fundamentals is that they can cover anything related to a companys economic well-being. They can include numbers like revenue and profit, but they can also include anything from a companys market share to the quality of its management. Generally, these are grouped into two categories quantitative and qualitative. Quantitative information that can be shown using numbers, figures, ratios, or formulas Qualitative rather than a quantity of something, it is its quality, standard, or nature In this context, quantitative fundamentals are hard numbers, the measurable characteristics of a business. The most significant source of quantitative data is financial statements. The qualitative fundamentals are less tangible. They might include the quality of a companys key executives, brand-name recognition, patents, and proprietary technology . Neither qualitative nor quantitative analysis is inherently better. Many analysts consider them together. Fast Fact Fundamental analysis relies on using financial ratios drawn from data on corporate financial statements to make inferences about a companys value and prospects. Qualitative Fundamentals to Consider There are certain qualitative fundamentals that analysts should always consider when analyzing a company. These include the following The Business Model What exactly does the company do? This isnt always straightforward. If a companys business model is based on selling fast-food chicken, is it making its money that way? Or is it coasting on royalty and franchise fees? Competitive Advantage A companys long-term success is primarily driven by its ability to maintain its competitive advantage. Competitive advantages, such as Coca-Cola Co.s KO brand name and Microsoft Corporations MSFT long domination of the personal computer operating system, create a moat around a business, allowing it to keep competitors at bay and enjoy growth and profits. Management Team Some think management is the most important criterion for investing in a company. This makes sense Even the best business model is doomed if the companys leaders fail to execute the plan properly. While its hard for retail investors to meet and truly evaluate managers, you can look at the corporate website and check the resumes of the top brass and the board members. How well did they do in previous jobs? Have they been unloading a lot of their stock shares lately? Corporate Governance and Board Structure These are provided by the policies within an organization that indicate the relationships and responsibilities among management, directors, and stakeholders . These policies are defined and determined in the company charter, its bylaws, and corporate laws and regulations. You want to do business with a company that is run ethically, fairly, transparently, and efficiently. Note whether management respects shareholder rights and shareholder interests. Ensure their communications to shareholders are transparent and understandable. If you dont get it, if there are major issues you know surround the company and they arent addressed, its not a sign that they have good answers for you. Industry Trends Its also important to consider a companys industry its customer base, market share among firms, industrywide growth, competition, regulation, and business cycles. Learning how the industry works will give an investor a deeper understanding of a companys financial health. Stakeholder Satisfaction Employees, managers, customers, suppliers, investors, and other stakeholders should all have positive views on the company and its prospects. Without that, a companys brand equity and image can suffer, which can lead to fewer sales, lower profits, and flagging share prices. Quantitative Fundamentals to Consider Financial Ratios Financial statements are how a company discloses information about its financial performance. Here are some of the most important financial ratios with their formulas Key Financial Ratios Category Ratio Formula Profitability Gross profit margin Revenue - Cost of Goods Sold Revenue Higher margins and returns generally indicate a more profitable and efficient business. Operating profit margin Operating Income Revenue Net profit Margin Net Income Revenue Return on assets ROA Net Income Average Total Assets Return on equity ROE Net Income Average Shareholders Equity Liquidity Current ratio Current Assets Current Liabilities A higher ratio suggests that the company has enough liquidity to cover its near-term liabilities. Quick ratio Cash Marketable Securities Accounts Receivable Current Liabilities Solvency Debt-to-equity ratio Total Liabilities Total Shareholders Equity These ratios measure a companys ability to meet its long-term debt obligations. Lower debt ratios and higher interest coverage ratios generally indicate a more financially stable company. Debt-to-assets ratio Total Liabilities Total Assets Interest coverage ratio Operating Income Interest Expense Efficiency Asset turnover ratio Revenue Average Total Assets These ratios measure how effectively a company manages its assets to generate sales. Higher turnover ratios suggest that the company is using its assets more efficiently to generate revenue. Inventory turnover ratio Cost of Goods Sold Average Inventory Receivables turnover ratio Revenue Average Accounts Receivable Valuation PE Market Price per Share Earnings per Share Lower ratios may indicate that the stock is undervalued, while higher ratios may suggest that it is overvalued. Price-to-book PB ratio Market Price per Share Book Value per Share Price-to-sales PS ratio Market Price per Share Revenue per Share Dividend yield Annual Dividends per Share Market Price per Share Fundamental Analysis vs. Technical Analysis Fundamental analysis contrasts starkly with technical analysis, which attempts to forecast prices by analyzing historical market data such as price and volume. Technical analysis uses price trends and action, often plotted on charts, to create indicators and identify patterns. Some indicators develop patterns that have names resembling their shapes, such as the head and shoulders pattern. A major distinction is where value comes from. For technical analysts, the market sets prices, and hence, the changes there give a company its value. For fundamental analysts, there is an intrinsic value that the market can often miss. Fundamental vs. Technical Analysis Fundamental Analysis Estimates the intrinsic value of a company from its operations Considers a companys financial statements and qualitative factors Longer-term focus monthsyears Best for buy-and hold investing Technical Analysis Looks at price and market trends to uncover market psychology Considers historical prices and chart patterns Shorter-term focus daysweeks Best for short-term or swing trading Limitations of Fundamental Analysis Though fundamental analysis can provide investors with insights into the future of a company, it does come with some downsides. Keep these items in mind when performing fundamental analysis Its Time-Consuming Fundamental analysis involves a detailed examination of financial statements, economic data, industry reports, and company-specific factors. This process requires collecting extensive data, performing complex calculations, and interpreting various financial metrics. Its A Lagging Indicator In addition to being a slow process, fundamental analysis often acts as a lagging indicator because it relies on financial data that reflects past performance. By the time changes in a companys fundamentals become apparent in its financial statements, the stock price might have already adjusted. Relies on Historical Data Similarly, fundamental analysis is based largely on historical financial information. While this data provides a basis for estimating future performance, it may not fully capture future risks or opportunities, as past performance is not an indicator of whats to come in the future. Subject to Accounting Practices The accuracy of fundamental analysis depends on the integrity and transparency of a companys financial statements. Factors like management estimates, depreciation, or other GAAP-compliant requirements can perhaps improperly impact the fundamental analysis. Difficult to Value Intangibles Intangible assets like patents, trademarks, brand reputation, and human capital are increasingly important in todays economy. However, these assets are challenging to quantify and may not be fully reflected in a companys financial statements. Consider how some investors would have believed in Apple simply because of Steve Jobs that notion is not captured in fundamental analysis. Economic Assumptions Fundamental analysis often involves assumptions about future economic conditions such as interest rates, inflation, and economic growth. Again, these are always changing and may not materialize as expected. Overlooked Short-Term Opportunities Fundamental analysis is geared towards long-term investment decisions, focusing on a companys intrinsic value and potential for growth over time. This long-term focus might cause investors to miss short-term trading opportunities that technical analysis can identify, such as price patterns, volume spikes, or momentum indicators. Example of Fundamental Analysis Lets analyze a hypothetical company called ABC Inc. using fundamental analysis. Well examine its financial statements and calculate key ratios to assess its financial health and performance. First, lets look at some data from ABC Inc.s financial statements for the previous fiscal year ABC Income Statement Balance Sheet Income Statement millions . Balance Sheet millions Revenue 1,000 . Assets Cost of Goods Sold 600 . Current Assets 750 Gross Profit 400 . Cash 200 Operating Expenses 200 . Marketable Securities 250 Operating Income 200 . Accounts Receivable 300 Net Income 150 . Non-Current Assets 750 . Total Assets 1,500 . ------------------ . Liabilities . Current Liabilities 250 . Non-Current Liabilities 250 . Total Liabilities 500 . . Shareholder Equity 1,000 ABC Statement of Cash Flows Stock Information Cash Flows from millions . Stock Information Operations 250 . Shares Outstanding 100 million Investments 100 . Stock Price 25.00 Financing 150 . Now, lets calculate some key ratios Profitability Ratios Gross profit margin 1,000 - 600 1,000 40 Operating profit margin 200 1,000 20 Net profit margin 150 1,000 15 Return on assets ROA 150 1,500 10 Return on equity ROE 150 1,000 15 ABC Inc.s profitability ratios suggest that the company is generating healthy profits from its operations. Its gross margin is 40, operating margin is 20, and net margin is 15. Its ROA and ROE of 10 and 15, respectively, indicate that the company is generating solid returns on its assets and equity. Liquidity Ratios Current ratio 750 250 3.00 Quick ratio 200 150 200 250 2.20 Assuming ABC Inc.s current assets are 750 million, with 200 million in cash, 150 million in marketable securities, and 200 million in accounts receivable, and its current liabilities are 250 million, the companys liquidity ratios are strong. A current ratio of 3.0 and a quick ratio of 2.2 suggest that ABC Inc. has ample liquidity to cover its short-term obligations. Solvency Ratios Debt-to-equity ratio 500 1,000 0.50 Debt-to-assets ratio 500 1,500 0.33 ABC Inc.s solvency ratios indicate that the company has a manageable level of debt relative to its equity and assets. A debt-to-equity ratio of 0.5 and a debt-to-assets ratio of 0.33 suggest that the company is not overly leveraged and has the financial flexibility to meet its long-term obligations. Valuation Ratios Assuming ABC Inc. has 100 million shares outstanding and its stock price is 25 per share Price-to-earnings PE Ratio 25 150 100 16.67 Price-to-book PB Ratio 25 1,000 100 2.50 Price-to-sales PS Ratio 25 1,000 100 2.50 ABC Inc.s valuation ratios suggest that the companys stock is trading at a reasonable valuation relative to its earnings, book value, and sales. A PE ratio of 16.67 aligns with the broader market, while PB and PS ratios of 2.5 indicate that the stock is not overly expensive relative to the companys assets and revenue. In addition to these quantitative measures, we can also consider certain qualitative fundamentals Competitive Advantages Has strong brand recognition in its industry and high customer loyalty Proprietary technology that differentiates its products from competitors Efficient supply chain and distribution network, enabling faster delivery and lower costs Management Quality It has an experienced management team with a proven track record of success. The CEO has been with the company for 15 years and has led the company through several periods of growth. Management has demonstrated a commitment to creating new goods and services and has strategic investments in research and development. Industry Trends The industry in which ABC Inc. operates is growing at a steady rate of 5 per year. Theres increasing demand for eco-friendly and sustainable products, which aligns with ABC Inc.s product offerings. The regulatory environment is becoming more favorable for the companys products. Growth Prospects ABC Inc. has a robust pipeline of new products set to launch in the next 12-18 months. The company has been expanding into new geographic markets and plans to enter two new countries next year. Recent acquisitions have provided opportunities for synergies and increased market share. Corporate Governance ABC Inc. has a diverse and independent board of directors. The company has a strong track record of transparency and timely financial reporting. Executive compensation is aligned with long-term shareholder interests. ESG Factors ABC Inc. has set ambitious targets for reducing its carbon footprint and increasing its use of renewable energy. The company is committed to diversity, equity, and inclusion, with programs in place to promote a diverse workforce. ABC Inc. engages with local communities and supports various philanthropic initiatives. Based on this hypothetical fundamental analysis, ABC Inc. appears to be a financially healthy and potentially attractive investment. However, its important to remember that this is just a simplified example. In practice, investors would need to conduct a more thorough analysis, considering the companys competitive position, industry trends, management quality, and growth prospects, before making an investment decision. What Is Fundamental Analysis and Its Objective? Fundamental analysis uses publicly available financial information and reports to determine whether a stock and the issuing company are valued correctly by the market. What Are the 3 Layers of Fundamental Analysis? When conducting an analysis, you can be top-down and start with economic analysis, then analyze the industry, then the company. Or, you can be bottom-up and work in the reverse order. What Are the Tools for Fundamental Analysis? Analysts use many tools. Some examples are financial reports, ratios from the reports, spreadsheets, charts, graphs, infographics, government agency reports on industries and the economy, and market reports. How Does Fundamental Analysis Differ From Technical Analysis? Fundamental analysis focuses on evaluating a securitys intrinsic value based on financial and economic factors, while technical analysis studies price movements and trading volumes to identify patterns and predict future price movements. Why Is Earnings Per Share EPS Important in Fundamental Analysis? EPS indicates a companys profitability on a per-share basis, helping investors determine how much profit a company generates for each share of its stock. It is a critical metric for assessing company performance and valuing stocks. The Bottom Line Fundamental analysis is used to value a company and determine whether a stock is over- or undervalued by the market. It considers the economic, market, sector-specific, and financial performance. Financial ratios generated from financial reports and government industry and economic reports are used to assess a company. Not every analyst uses the same tools or views stocks similarlyyou might determine a stock is valued differently than another analyst. Whats important is that the stock you analyze meets your criteria for value and that your analysis creates actionable information.",
  "matched_keywords": [
    "stocks",
    "equity",
    "interest rates",
    "inflation",
    "NSE",
    "dividends",
    "investment",
    "fiscal",
    "economic growth",
    "debt"
  ],
  "embedding": [
    0.049153707921504974,
    -0.0034318140242248774,
    -0.08281633257865906,
    0.02047695964574814,
    -0.01704096421599388,
    0.028462950140237808,
    0.0004235478991176933,
    0.05203733965754509,
    0.12421635538339615,
    -0.017881283536553383,
    -0.06528179347515106,
    0.049912240356206894,
    -0.022393014281988144,
    0.023921500891447067,
    -0.0662250742316246,
    -0.09594892710447311,
    0.02309616096317768,
    0.015654196962714195,
    -0.002482966985553503,
    0.024925464764237404,
    0.006925872061401606,
    -0.058021340519189835,
    0.003197276033461094,
    -0.028093812987208366,
    -0.08571267873048782,
    0.014811718836426735,
    0.031813278794288635,
    -0.0134178651496768,
    -0.006844638381153345,
    0.013887915760278702,
    0.00841920543462038,
    0.014757816679775715,
    0.04859006404876709,
    0.020655307918787003,
    -0.06598550826311111,
    0.007014169357717037,
    0.013233617879450321,
    0.02900601550936699,
    0.05048094317317009,
    0.044351644814014435,
    -0.019534306600689888,
    -0.0006102632032707334,
    -0.003255413146689534,
    -0.02219211868941784,
    0.10241998732089996,
    -0.07045634835958481,
    -0.015043284744024277,
    -0.03685051202774048,
    -0.020247092470526695,
    -0.020112456753849983,
    -0.03033224493265152,
    0.009842942468822002,
    0.0497492291033268,
    -0.030689243227243423,
    0.04796893149614334,
    0.024076027795672417,
    0.014114277437329292,
    -0.05595364421606064,
    0.01681053265929222,
    -0.0010412271367385983,
    0.08246058970689774,
    -0.0221094973385334,
    0.06109088659286499,
    -0.0032341640908271074,
    0.06006476283073425,
    -0.026830587536096573,
    0.00970456376671791,
    0.04996563121676445,
    -0.010715327225625515,
    0.02023698389530182,
    -0.013165900483727455,
    -0.04212478920817375,
    -0.03525795415043831,
    -0.046905215829610825,
    -0.021841619163751602,
    0.08596355468034744,
    -0.03502913564443588,
    0.06911563128232956,
    -0.04851455241441727,
    -0.13392063975334167,
    0.014787989668548107,
    -0.03971569612622261,
    0.04032482951879501,
    0.030317852273583412,
    0.03995731100440025,
    0.03196427598595619,
    0.07188427448272705,
    0.014567211270332336,
    -0.06899362057447433,
    0.06814616918563843,
    0.04438408464193344,
    0.027898969128727913,
    0.005275525618344545,
    -0.044642239809036255,
    0.12897972762584686,
    -0.0036418342497199774,
    -0.11338037252426147,
    -0.06648634374141693,
    -0.014600935392081738,
    -0.0463375486433506,
    0.043050866574048996,
    -0.05236978456377983,
    -0.011688809841871262,
    0.014875935390591621,
    -0.03505559265613556,
    -0.08210861682891846,
    -0.03145411238074303,
    0.004893076606094837,
    -0.01309567503631115,
    -0.006232244893908501,
    0.015595296397805214,
    -0.0038973428308963776,
    -0.027173463255167007,
    -0.010050415992736816,
    -0.00513516366481781,
    -0.00836022850126028,
    -0.013345122337341309,
    -0.0017264244379475713,
    0.06648044288158417,
    0.10526420176029205,
    0.027442367747426033,
    0.028376946225762367,
    -0.012172305956482887,
    0.045372068881988525,
    -0.0017012179596349597,
    -0.005885620601475239,
    -0.0430447980761528,
    1.882327736508368e-33,
    -0.08962326496839523,
    0.029282569885253906,
    -0.06579688936471939,
    -0.018265608698129654,
    -0.17499405145645142,
    -0.033949654549360275,
    -0.0058118863962590694,
    -0.08393611758947372,
    0.052007101476192474,
    0.061719805002212524,
    0.006295949220657349,
    0.16846224665641785,
    0.02969156578183174,
    -0.0031181161757558584,
    -0.02199709229171276,
    0.06520988047122955,
    0.0017195158870890737,
    0.06350810825824738,
    0.021855587139725685,
    -0.06813828647136688,
    -0.03784390911459923,
    0.01788591966032982,
    0.03469223156571388,
    -0.0709705501794815,
    0.027823692187666893,
    -0.06426443159580231,
    -0.05928906053304672,
    -0.028845934197306633,
    -0.07934355735778809,
    -0.025188976898789406,
    -0.018117854371666908,
    -0.019754352048039436,
    -0.019765537232160568,
    -0.02033889852464199,
    0.015616186894476414,
    -0.05988292396068573,
    0.0016135781770572066,
    0.01636349968612194,
    -0.058233246207237244,
    0.032402802258729935,
    -0.044287681579589844,
    -0.058352090418338776,
    -0.0295826755464077,
    0.003360527567565441,
    0.04994664341211319,
    0.07434187084436417,
    -0.046525731682777405,
    -0.021311147138476372,
    -0.025138096883893013,
    -0.01736224628984928,
    -0.03674120828509331,
    -0.02895430475473404,
    0.037945639342069626,
    -0.0084426524117589,
    -0.05727614834904671,
    0.02589288353919983,
    0.014486157335340977,
    -0.07762015610933304,
    -0.0667291134595871,
    -0.001127029419876635,
    -0.006418553646653891,
    0.08572396636009216,
    -0.06299246847629547,
    -0.08415599912405014,
    -0.10876625776290894,
    0.038765810430049896,
    -0.024112442508339882,
    0.12573114037513733,
    0.02716417796909809,
    0.10528606921434402,
    -0.04585685580968857,
    0.015970544889569283,
    0.06674610078334808,
    0.017269229516386986,
    0.06956735998392105,
    -0.07113126665353775,
    -0.05265744403004646,
    0.10026859492063522,
    -0.008133350871503353,
    0.08884910494089127,
    0.023739323019981384,
    0.013769552111625671,
    0.10028254985809326,
    -0.06982409209012985,
    -0.05455310642719269,
    0.02032189816236496,
    0.03842721879482269,
    0.06283260881900787,
    0.008684134110808372,
    -0.08084671944379807,
    -0.021591367200016975,
    0.09404806047677994,
    -0.06393535435199738,
    0.07434789836406708,
    -0.026038235053420067,
    -5.014132499543901e-33,
    -0.05997273698449135,
    -0.021223271265625954,
    0.0009116730652749538,
    0.0542045533657074,
    0.03546493500471115,
    0.0034998615738004446,
    -0.07424546778202057,
    -0.06630656123161316,
    0.046378880739212036,
    -0.0445767343044281,
    0.03320524841547012,
    -0.02860894985496998,
    -0.009679433889687061,
    0.0012657186016440392,
    -0.081395722925663,
    0.01250787079334259,
    -0.11836820095777512,
    -0.055331457406282425,
    -0.03257519751787186,
    0.024171430617570877,
    -0.08963500708341599,
    -0.03520730882883072,
    0.016760481521487236,
    0.009559154510498047,
    -0.049801718443632126,
    0.013413753360509872,
    0.040626056492328644,
    -0.04970879480242729,
    0.04213305562734604,
    -0.002743900055065751,
    0.005901607219129801,
    -0.017650844529271126,
    -0.0439009815454483,
    0.029723959043622017,
    -0.06525072455406189,
    -0.027185184881091118,
    0.04816512018442154,
    -0.04049813374876976,
    -0.007922722026705742,
    0.06187467277050018,
    -0.013331240974366665,
    0.04914303496479988,
    0.07134934514760971,
    -0.04924285039305687,
    -0.053213655948638916,
    -0.008718369528651237,
    0.04302791878581047,
    0.05175277963280678,
    -0.05864086002111435,
    0.0036258234176784754,
    0.09684377163648605,
    0.05382446572184563,
    0.1034381091594696,
    -0.02505565993487835,
    -0.08077047020196915,
    -0.032851144671440125,
    0.0020999684929847717,
    0.0007234924705699086,
    -0.027161041274666786,
    0.119521863758564,
    0.0388655960559845,
    0.055063992738723755,
    0.05316004902124405,
    0.057707659900188446,
    -0.08216618746519089,
    0.03454124554991722,
    -0.06328872591257095,
    -0.05854775756597519,
    -0.11417195200920105,
    0.047244079411029816,
    -0.05349123477935791,
    -0.00341360317543149,
    -0.01653372496366501,
    -0.02276385948061943,
    0.03206972777843475,
    0.08622857183218002,
    -0.06050854176282883,
    -0.11856398731470108,
    -0.03686195984482765,
    0.0036640821490436792,
    0.041146036237478256,
    -0.027303649112582207,
    0.032280728220939636,
    -0.030188241973519325,
    0.006380959413945675,
    0.05813910812139511,
    -0.06338106095790863,
    0.03078475594520569,
    -0.02456776797771454,
    -0.04208868369460106,
    -0.018160400912165642,
    -0.08505293726921082,
    -0.07579582184553146,
    -0.004308281932026148,
    -0.03659981116652489,
    -5.0562086073568935e-08,
    -0.0581342950463295,
    -0.04872238636016846,
    0.019919682294130325,
    -0.03323372080922127,
    -0.018742289394140244,
    -0.037270694971084595,
    0.03190800920128822,
    -0.01919734477996826,
    0.062242865562438965,
    0.015868855640292168,
    -0.041471216827631,
    -0.06664592772722244,
    -0.17928005754947662,
    0.05302158370614052,
    -0.00012816852540709078,
    0.05471991002559662,
    -0.015510302037000656,
    -0.0007336597773246467,
    0.08746479451656342,
    -0.017480259761214256,
    0.046139612793922424,
    -0.0015623844228684902,
    0.017099326476454735,
    -0.042525243014097214,
    0.09620165079832077,
    -0.016378358006477356,
    -0.004262293688952923,
    -0.007744996342808008,
    -6.498773291241378e-05,
    0.019296718761324883,
    0.05856823921203613,
    -0.00914554763585329,
    0.008627877570688725,
    0.03918886557221413,
    0.04886404424905777,
    0.0762341320514679,
    0.09135328978300095,
    -0.004235879983752966,
    -0.03942504897713661,
    0.12956131994724274,
    -0.018962549045681953,
    0.10868042707443237,
    -0.05384090170264244,
    -0.010334844700992107,
    0.0019158989889547229,
    -0.026904040947556496,
    -0.009891250170767307,
    0.10029183328151703,
    0.0066713010892271996,
    -0.0012485407060012221,
    0.04836220666766167,
    -0.027201443910598755,
    -0.019704777747392654,
    0.016432898119091988,
    -0.01754782907664776,
    0.013576313853263855,
    -0.003654253203421831,
    -0.041265226900577545,
    -0.010615965351462364,
    0.04219402000308037,
    -0.011417279951274395,
    -0.015320955775678158,
    0.06659502536058426,
    -0.0074707516469061375
  ],
  "metadata": {
    "url": "https://www.investopedia.com/terms/f/fundamentalanalysis.asp",
    "title": "Fundamental Analysis: Principles, Types, and How to Use It",
    "author": "Troy Segal",
    "date": "Updated April 29, 2025",
    "category": "Investing",
    "content_type": "definition",
    "word_count": 3976,
    "source": "www.investopedia.com"
  }
}