{
  "url": "https://www.investopedia.com/terms/d/diversification.asp",
  "title": "What Is Diversification? Definition as Investing Strategy",
  "text": "Definition Diversification is the strategy of investing in different asset classes and asset types to reduce portfolio risk associated with price volatility. What Is Diversification? Diversification is a risk management strategy that creates a mix of various investments within a portfolio. A diversified portfolio contains distinct asset types and investment vehicles in an attempt to limit exposure to any single asset or risk . The rationale behind this technique is that a portfolio constructed of different kinds of assets will, on average, yield higher long-term returns and lower the risk of any individual holding or security. Key Takeaways Diversification is a strategy that mixes a wide variety of investments within a portfolio in an attempt to reduce portfolio risk. Diversification is most often done by investing in different asset classes such as stocks, bonds, real estate, or cryptocurrency and then in different types of securities within a class. Diversification can also be achieved by purchasing investments in different countries, industries, sizes of companies, or term lengths for income-generating investments. The quality of diversification in a portfolio is most often measured by analyzing the correlation coefficient of pairs of assets. Investors can diversify on their own by investing in select investments or can hold diversified funds. Understanding Diversification Studies and mathematical models have shown that maintaining a well-diversified portfolio of 25 to 30 stocks yields the most cost-effective level of risk reduction. Investing in more securities generates further diversification benefits, but it does so at a substantially diminishing rate of effectiveness. Diversification strives to smooth out unsystematic risk events in a portfolio, so the positive performance of some investments neutralizes the negative performance of others. The benefits of diversification hold only if the securities in the portfolio are not perfectly correlated that is, they respond differently, often in opposing ways, to market influences. Diversification Strategies As investors consider ways to diversify their holdings, there are dozens of strategies to implement. Many of the methods below can be combined to enhance the level of diversification within a single portfolio. Asset Classes Fund managers and investors often diversify their investments across asset classes and determine what percentages of the portfolio to allocate to each. Each asset class has a different, unique set of risks and opportunities. Classes can include Stocks Shares or equity in a publicly traded company Bonds Government and corporate fixed-income debt instruments Real estate Land, buildings, natural resources, agriculture, livestock, and water and mineral deposits Exchange-traded funds ETFs A marketable basket of securities that follow an index, commodity, or sector Commodities Basic goods necessary for the production of other products or services Cash and short-term cash-equivalents CCE Treasury bills, certificate of deposit CD, money market vehicles, and other short-term, low-risk investments The theory holds that what may negatively impact one asset class may benefit another. For example, rising interest rates usually negatively impact bond prices as yield must increase to make fixed income securities more attractive. On the other hand, rising interest rates may result in increases in rent for real estate or increases in prices for commodities. Tip Order your copy of Investopedias What To Do With 10,000 magazine for more wealth-building advice. IndustriesSectors There are tremendous differences in the way different industries or sectors operate. As investors diversify across various industries, they become less likely to be impacted by sector-specific risk. For example, consider the CHIPS and Science Act of 2022. This legislation impacts many industries, though some companies are more affected than others. Semiconductor manufacturers will be largely impacted, while the financial services sector might feel smaller, residual impacts. Investors can diversify across industries by coupling investments that may counterbalance different businesses. For example, consider two major means of entertainment travel and digital streaming. Investors hoping to hedge against the risk of future major pandemic impacts may invest in digital streaming platforms positively impacted by more shutdowns. At the same time, they may consider simultaneously investing in airlines positively impacted by fewer shutdowns. In theory, these two unrelated industries may minimize overall portfolio risk. Important How many stocks do you need to own to be properly diversified? A study published in the Journal of Risk and Financial Management found there are simply too many variables to consider, and an optimal number of stocks that constitute a well-diversified portfolio does not exist. Corporate Lifecycle Stages Growth vs. Value Public equities tend to be broken into two categories growth stocks and value stocks . Growth stocks are stocks in companies that are expected to experience profit or revenue growth greater than the industry average. Value stocks are stocks in companies that appear to be trading at a discount based on the current fundamentals of a company. Growth stocks tend to be more risky as the expected growth of a company may not materialize. For example, if the Federal Reserve constricts monetary policy, less capital is usually available or it is more expensive to borrow, creating a more difficult scenario for growth companies. However, growth companies may tap into seemingly limitless potential and exceed expectations, generating even greater returns than expected. On the other hand, value stocks tend to be more established, stable companies. While these companies may have already experienced most of their potential, they usually carry less risk. By diversifying into both, an investor would capitalize on the future potential of some companies while also recognizing the existing benefits of others. Market Capitalizations Large vs. Small Investors may want to consider investing across different securities based on the underlying market capitalization of the asset or company. Consider the vast operational differences between Apple and Newell Brands Inc. In July 2023, both companies were in the SP 500, with Apple representing 7.6 of the index and Newell Brands representing 0.0065. Each company will have a considerably different approach to raising capital, introducing new products to the market, brand recognition, and growth potential. Lower cap stocks have more room to grow, though higher cap stocks tend to be safer investments. Risk Profiles Across almost every asset class, investors can choose the underlying risk profile of the security. For example, consider fixed-income securities. An investor can choose to buy bonds from the top-rated governments in the world or from nearly defunct private companies raising emergency funds . There are considerable differences between several 10-year bonds based on the issuer, their credit rating, future operational outlook, and existing level of debt. The same can be said for other types of investments. Real estate development projects with more risk may carry greater upside than established operating properties. Meanwhile, cryptocurrencies with longer histories and greater adoption, such as Bitcoin, carry less risk relative to smaller market cap coins or tokens. Tip Diversification may not be the best strategy for investors wanting to maximize their returns. Consider YOLO you only live once strategies where 100 of capital is placed in a high-risk investment. Though there is a higher probability of making life-changing money, there is also the highest probability of losing it due to poor diversification. Maturity Lengths Specific to fixed-income securities such as bonds, different term lengths impact risk profiles. Generally, the longer the maturity , the higher the risk of fluctuations in the bonds prices due to changes in interest rates. Short-term bonds tend to offer lower interest rates however, they also tend to be less impacted by uncertainty in future yield curves. Investors more comfortable with risk may consider adding longer term bonds that tend to pay higher degrees of interest. Maturity length is also prevalent in other asset classes. Consider the difference between short-term lease agreements for residential properties i.e., up to one year and long-term lease agreements for commercial properties i.e., sometimes five years or greater. Though there is more security in collecting rent revenue by locking into a long-term agreement, investors sacrifice flexibility to increase prices or change tenants. Physical Locations Foreign vs. Domestic Investors can reap further diversification benefits by investing in foreign securities. For example, forces depressing the U.S. economy may not affect Japans economy in the same way. Therefore, holding Japanese stocks gives an investor a small cushion of protection against losses during an American economic downturn. Alternatively, there may be a greater potential upside with associated higher degrees of risk when diversifying across developed and emerging countries. Consider Pakistans current classification as a frontier market participant recently downgraded from an emerging market participant. Investors willing to take on higher levels of risk may want to consider the higher growth potential of smaller yet-to-be-fully established markets such as Pakistan. Tangibility Financial instruments such as stocks and bonds are intangible investments they can not be physically touched or felt. On the other hand, tangible investments such as land, real estate, farmland, precious metals, or commodities can be touched and have real-world applications. These real assets have different investment profiles as they can be consumed, rented, developed, or treated differently than intangible or digital assets. There are also unique risks specific to tangible assets. Real property can be vandalized, physically stolen, damaged by natural conditions, or become obsolete. Real assets may also require storage, insurance, or security costs to carry. Though the revenue stream differs from financial instruments, the input costs to protect tangible assets are also different. Diversification Across Platforms Regardless of how an investor considers building their portfolio, another aspect of diversification relates to how those assets are held. Though this is not an implication of the investments risk, it is an additional risk worth considering as it may be diversifiable. For example, consider an individual with 400,000 of U.S. currency. In all three of the situations below, the investor has the same asset allocation. However, their risk profile is different The individual may deposit 200,000 at one bank and 200,000 at a second bank. Both deposits are under the FDIC insurance limit per bank and are fully insured. The individual may deposit 400,000 at a single bank. Only a portion of the deposit is covered by insurance. In addition, should that single bank experience a bank run, the individual may not have immediate access to cash. The individual may physically store 400,000 of cash in their home. Though immediately accessible, the individual will not yield any interest or growth on their cash. In addition, the individual may lose capital in the event of theft, fire, or by misplacing it. The same concept above relates to almost every asset class. For example, Celsius Network filed for bankruptcy in July 2022. Investors holding cryptocurrency with the exchange experienced the inability to withdraw or transfer funds. Had investors diversified across platforms, the risk of loss would have been spread across different exchanges. Fast Fact Consider different strategies to offset technology risk and physical risk. For example, owning physical gold bars and gold ETFs diversifies your portfolio across various risks. If your physical holdings were to be stolen, at least 100 of your gold ownership was not lost. Diversification and Retail Investors Time and budget constraints can make it difficult for noninstitutional investorsi.e., individualsto create an adequately diversified portfolio. This challenge is a key to why mutual funds are so popular with retail investors. Buying shares in a mutual fund offers an inexpensive way to diversify investments. While mutual funds provide diversification across various asset classes, exchange-traded funds ETFs afford investor access to narrow markets, such as commodities and international plays, that would ordinarily be difficult to access. An individual with a 100,000 portfolio can spread the investment among ETFs with no overlap. There are several reasons why this is advantageous to investors. First, it may be too costly for retail investors to buy securities using different market orders. In addition, investors must then track their portfolios weight to ensure proper diversification. Though an investor sacrifices a say in all of the underlying companies being invested in, they simply choose an easier investment approach that prioritizes minimizing risk. Pros and Cons of Diversification The primary purpose of diversification is to mitigate risk. By spreading your investment across different asset classes, industries, or maturities, you are less likely to experience market shocks that impact every single one of your investments the same. There are other benefits to be had as well. Some investors may find diversification makes investing more fun as it encourages exploring different unique investments. Diversification may also increase the chance of hitting positive news. Instead of hoping for favorable news specific to one company, positive news impacting one of dozens of companies may benefit your portfolio. However, there are drawbacks to diversification. The more holdings a portfolio has, the more time-consuming it can be to manageand the more expensive, since buying and selling many different holdings incurs more transaction fees and brokerage commissions. More fundamentally, diversifications spreading-out strategy works both ways, lessening the risk and the reward. For instance, imagine youve invested 120,000 equally among six stocks, and one stock doubles in value. Your original 20,000 stake is now worth 40,000. Youve made a lot, sure, but not as much as if your entire 120,000 had been invested in that one company. By protecting you on the downside, diversification limits you on the upsideat least in the short term. Pros Reduces portfolio risk Hedges against market volatility Offers potentially higher returns long-term May be more enjoyable for investors to research new investments Cons Limits gains short-term Time-consuming to manage Incurs more transaction fees, commissions May be overwhelming for newer, unexperienced investors Diversifiable vs. Non-Diversifiable Risk The idea behind diversification is to minimize or even eliminate risk within a portfolio. However, there are certain types of risks you can diversify away, and certain types of risks exist regardless of how you diversify. These types of risks are called unsystematic and systematic risks . Consider the impact of COVID-19. Due to the global health crisis, many businesses stopped operating. Employees across many industries were laid off, and consumer spending across all sectors declined. On one hand, the economic slowdown negatively impacted almost every sector. On the other, nearly every sector then benefited from government intervention and monetary stimulus. The impact of COVID-19 on financial markets was systematic. In general, diversification aims to reduce unsystematic risk. These are the risks specific to an investment that are unique to that holding. Examples of diversifiable, non-systematic risks include Business risk The risk related to a specific company based on the nature of its company and what it does in the market. Financial risk The risks related to a specific company or organizations financial health, liquidity, and long-term solvency. Operational risk The risk related to breakdowns in manufacturing or goods distribution processes. Regulatory risk The risk that legislation may adversely impact the asset. Through diversification, investors strive to reduce the risks above, which are controllable based on the investments held. Measuring Diversification It can become complex and cumbersome to measure how diversified a portfolio is . In reality, it is impossible to calculate the actual degree of diversification there are simply too many variables to consider across too many assets to truly quantify a single measure of diversification. Still, analysts and portfolio managers use several measurements to get a rough idea of how diversified a portfolio is. Correlation Coefficient A correlation coefficient is a statistical measurement that compares the relationship between two variables. This statistical calculation tracks the movement of two assets and whether the assets tend to move in the same direction. The correlation coefficient result varies from -1 to 1, with interpretations ranging from Closer to -1 There is strong diversification between the two assets, as the investments move in opposite directions. There is a strong negative correlation between the two variables being analyzed. Closer to 0 There is moderate diversification between the two assets, as the investments have no correlation. The assets sometimes move together, while other times, they dont. Closer to 1 There is a strong lack of diversification between the two assets, as the investments move in the same direction. There is a strong positive correlation between the two variables being analyzed. Standard Deviation Standard deviation SD measures how often and far an outcome occurs away from the mean. For investments, standard deviation measures how far away from an assets average return other returns fall. Analysts use SD to estimate risk based on return frequency. For example, imagine two investments, each with an average annual return of 5. One has a high standard deviation, which means the investment returns can vary greatly. The other investment has a low standard deviation, meaning its returns have been closer to 5. The higher the standard deviation, the more risk there isbut there is a chance for higher returns. A portfolio full of investments with high standard deviations may have higher earning potential. However, these assets may be more likely to experience similar risks across asset classes. Smart Beta Smart beta strategies offer diversification by tracking underlying indices but do not necessarily weigh stocks according to their market cap. ETF managers further screen equity issues on fundamentals and rebalance portfolios according to objective analysis, not just company size. While smart beta portfolios are unmanaged, the primary goal becomes the outperformance of the index itself. CountWeighting In its most basic form, a portfolios diversification can be measured by counting the number of assets or determining the weight of each asset. When counting the number of assets, consider the number of each type for the strategies above. For example, an investor can count that of the 20 equities they hold, 15 are in the technology sector. Alternatively, investors can measure diversification by allocating percentages to what they are invested in. So, in this view, the investor with 15 equities in tech has 75 of their equity holdings in a single industry. On a broader portfolio basis, investors more often compare equity, bonds, and alternative assets to create their diversification targets. For example, traditional portfolios tended to skew towards 60 equities and 40 bondsthough some strategies call for different diversification based on age. Other theories claim that holding alternative assets has added benefits for example, 60 equities, 20 bonds, and 20 alternatives. Example of Diversification Imagine an aggressive investor , who can assume a higher risk level, wishes to construct a portfolio composed of Japanese equities, Australian bonds, and cotton futures. They could purchase stakes in the iShares MSCI Japan ETF, the Vanguard Australian Government Bond Index ETF, and the iPath Bloomberg Cotton Subindex Total Return ETN. With this mix of ETF shares, due to the specific qualities of the targeted asset classes and the transparency of the holdings, the investor ensures true diversification in their holdings. Also, with different correlations, or responses to outside forces, among the securities, they can slightly lessen their risk exposure. What Are the Benefits of Diversification? In theory, holding investments that are different from each other reduces the overall risk of the assets youre invested in. If something bad happens to one investment, youre more likely to have assets that are not impacted if you were diversified. Diversification may result in a larger profit if you are extended into asset classes you wouldnt otherwise have invested in. Also, some investors find diversification more enjoyable to pursue as they research new companies, explore different asset classes, and own different types of investments. What Are the Methods of Diversification? There are many different ways to diversify the primary method of diversification is to buy different types of asset classes. For example, instead of putting your entire portfolio into public stock, you may consider buying some bonds to offset some market risk of stocks. In addition to investing in different asset classes, you can diversify into different industries, geographical locations, term lengths, or market caps. The primary goal of diversification is to invest in a broad range of assets that face different risks. Is Diversification a Good Strategy? For investors seeking to minimize risk, diversification is a strong strategy. That said, diversification may minimize returns, as the goal of diversification is to reduce the risk within a portfolio. By reducing risk, an investor is willing to take less profit in exchange for the preservation of capital. The Bottom Line Diversification is a very important concept in financial planning and investment management. It is the idea that by investing in different things, the overall risk of your portfolio is lower. Instead of putting all your money into a single asset, spreading your wealth across different assets puts you at less risk of losing capital. With the ease of transacting and investing online, it is now incredibly easy to diversify your portfolio through different asset classes and other strategies.",
  "matched_keywords": [
    "stocks",
    "equity",
    "mutual funds",
    "ETF",
    "interest rates",
    "NSE",
    "portfolio",
    "investment",
    "FDI",
    "monetary policy",
    "asset allocation",
    "bonds",
    "debt",
    "commodities",
    "crypto"
  ],
  "embedding": [
    0.051878031343221664,
    -0.06206519529223442,
    -0.02702997252345085,
    0.022912532091140747,
    0.03530003875494003,
    0.03708744794130325,
    0.07640320062637329,
    0.013269945047795773,
    0.05553999915719032,
    -0.07884809374809265,
    -0.0034727260936051607,
    0.032507553696632385,
    0.030607175081968307,
    -0.002987511223182082,
    -0.02917321026325226,
    -0.056193482130765915,
    -0.048762381076812744,
    0.050568338483572006,
    -0.11987833678722382,
    0.07040361315011978,
    0.09204316884279251,
    -0.05979553982615471,
    -0.07324668765068054,
    0.011112604290246964,
    0.034814685583114624,
    0.021232428029179573,
    0.03199704736471176,
    -0.021765438839793205,
    -0.044355109333992004,
    -0.026218540966510773,
    0.0642150267958641,
    0.001745979767292738,
    -0.01941019669175148,
    0.010634463280439377,
    -0.07245014607906342,
    0.09113634377717972,
    -0.10437479615211487,
    0.04967851936817169,
    0.07049509882926941,
    0.08395323902368546,
    -0.05660245940089226,
    0.04047035425901413,
    -0.01622283272445202,
    -0.03498184308409691,
    0.038037754595279694,
    0.0036693380679935217,
    -0.06551767140626907,
    -0.10165099799633026,
    0.02965530753135681,
    -0.06565185636281967,
    -0.029281606897711754,
    0.043667346239089966,
    -0.08614357560873032,
    -0.07436508685350418,
    -0.04367167875170708,
    -0.03466001898050308,
    -0.06673511117696762,
    -0.025027183815836906,
    -0.004061030223965645,
    -0.016628127545118332,
    0.10663709789514542,
    -0.009917236864566803,
    0.09557121247053146,
    -0.028646215796470642,
    0.012034586630761623,
    -0.07032749801874161,
    -0.018867604434490204,
    0.07038016617298126,
    0.012397080659866333,
    0.004927345085889101,
    0.010855802334845066,
    -0.027606310322880745,
    -0.07532215118408203,
    0.023772496730089188,
    -0.008098481222987175,
    0.02826586924493313,
    0.019255833700299263,
    0.007687298581004143,
    -0.010511177591979504,
    0.04169004410505295,
    0.01889536902308464,
    0.011473543010652065,
    0.008898629806935787,
    -0.059287115931510925,
    0.07225588709115982,
    0.008201341144740582,
    -0.05094771459698677,
    -0.054566286504268646,
    0.013285002671182156,
    -0.03318369761109352,
    -0.06667876243591309,
    -0.0504475012421608,
    0.06180715560913086,
    0.04913424700498581,
    -0.010793128050863743,
    -0.03782644122838974,
    -0.03609937056899071,
    0.004394281189888716,
    0.045898325741291046,
    -0.007696052081882954,
    0.04796956852078438,
    0.031041322275996208,
    0.03514968603849411,
    -0.0381859727203846,
    -0.013270997442305088,
    -0.04256875813007355,
    -0.0024983673356473446,
    -0.06121419742703438,
    0.00858491100370884,
    -0.033239539712667465,
    -0.020183153450489044,
    0.07528303563594818,
    -0.054556287825107574,
    -0.008511281572282314,
    -0.04403224214911461,
    0.11379899084568024,
    -0.047725602984428406,
    0.028704388067126274,
    0.02861003763973713,
    0.17237982153892517,
    -0.016514452174305916,
    0.04573580622673035,
    0.10232315212488174,
    -0.005941587965935469,
    -0.007909408770501614,
    0.0372195839881897,
    -0.034236807376146317,
    4.39496693152917e-33,
    -0.056214019656181335,
    -0.04767347872257233,
    -0.021727588027715683,
    0.12669864296913147,
    -0.09196140617132187,
    -0.031051913276314735,
    0.03540504351258278,
    -0.06173933669924736,
    -0.09556596726179123,
    0.05367119237780571,
    0.06663770228624344,
    0.08636337518692017,
    0.024261832237243652,
    0.06184926629066467,
    0.057916589081287384,
    -0.013310940004885197,
    -0.0208255797624588,
    0.10004133731126785,
    0.08997657895088196,
    -0.13438759744167328,
    0.03913257643580437,
    0.05101391300559044,
    0.044411756098270416,
    -0.030759625136852264,
    0.03779464587569237,
    -0.0965055599808693,
    -0.012938715517520905,
    -0.025289859622716904,
    -0.0256327036768198,
    0.015745865181088448,
    0.006877048406749964,
    0.0946873351931572,
    -0.08836130797863007,
    -0.03930393606424332,
    0.02222832478582859,
    0.05070028454065323,
    -0.02511201985180378,
    -0.014215745963156223,
    0.01422650646418333,
    0.008865363895893097,
    -0.04828048124909401,
    -0.023044561967253685,
    -0.04980412498116493,
    0.004831035155802965,
    0.00814136117696762,
    0.0561201386153698,
    0.0566428042948246,
    0.03199592977762222,
    -0.08046174794435501,
    -0.03319252282381058,
    -0.014276786707341671,
    -0.035601288080215454,
    0.015914512798190117,
    0.03907565400004387,
    -0.018502376973628998,
    0.018788669258356094,
    -0.004439536947757006,
    0.01996660605072975,
    -0.07241102308034897,
    -0.04507247358560562,
    -0.07527051120996475,
    -0.01105539035052061,
    -0.09116101264953613,
    0.011713268235325813,
    -0.014631778001785278,
    0.036878928542137146,
    0.035025715827941895,
    0.04752875119447708,
    0.023837480694055557,
    0.07050934433937073,
    -0.004119856283068657,
    -0.042758647352457047,
    -0.028301168233156204,
    -0.031501539051532745,
    -0.04639069363474846,
    0.027509652078151703,
    -0.020046543329954147,
    0.04535837844014168,
    0.03275623172521591,
    0.006546340882778168,
    0.002859673462808132,
    0.055366698652505875,
    0.041724368929862976,
    -0.001132985926233232,
    -0.11175328493118286,
    0.056456808000802994,
    0.07867814600467682,
    -0.0023849750868976116,
    0.01697276346385479,
    -0.00829183030873537,
    -0.00011263794294791296,
    0.035562098026275635,
    -0.022007057443261147,
    -0.070139080286026,
    0.03561019152402878,
    -5.7162501325022684e-33,
    -0.060075514018535614,
    0.0069907535798847675,
    -0.051872264593839645,
    -0.016453875228762627,
    0.030021125450730324,
    -0.0277841929346323,
    -0.032594382762908936,
    -0.026413802057504654,
    -0.13035352528095245,
    -0.16995686292648315,
    -0.11058677732944489,
    0.00036502775037661195,
    0.08930785208940506,
    -0.05657476559281349,
    -0.14445166289806366,
    -0.042486004531383514,
    -0.009153145365417004,
    0.052923865616321564,
    -0.04410380497574806,
    -0.029439300298690796,
    0.01657034642994404,
    -0.005940199363976717,
    0.046038027852773666,
    -0.0363205224275589,
    -0.002009890042245388,
    0.02094097249209881,
    -0.12358821928501129,
    -0.0020122728310525417,
    0.10870928317308426,
    -0.036307428032159805,
    0.0298157949000597,
    0.03472253680229187,
    -0.010018651373684406,
    -0.012126779183745384,
    -0.04465486481785774,
    -0.006550416816025972,
    -0.02616661787033081,
    -0.0773739293217659,
    0.07643842697143555,
    0.08136402070522308,
    -0.08653005212545395,
    -0.00568320183083415,
    0.10083157569169998,
    -0.07348737120628357,
    0.022765889763832092,
    -0.021507970988750458,
    0.03389357030391693,
    -0.027695011347532272,
    0.08307714760303497,
    -0.030270665884017944,
    0.009812187403440475,
    -0.009044080041348934,
    -0.02972874604165554,
    0.05573149397969246,
    -0.02981732040643692,
    -0.028999293223023415,
    0.003818998346105218,
    -0.007193687837570906,
    -0.03390277177095413,
    0.06473661959171295,
    0.030574779957532883,
    0.015889329835772514,
    -0.013629545457661152,
    0.1268189549446106,
    -0.07905905693769455,
    -0.07848513871431351,
    -0.0783633217215538,
    -0.08874082565307617,
    -0.04791973903775215,
    -0.044801052659749985,
    0.04839097708463669,
    -0.05788557603955269,
    0.07494183629751205,
    -0.02485889010131359,
    -0.006195929367095232,
    0.00024713226594030857,
    0.020708130672574043,
    0.021175390109419823,
    0.0019037849269807339,
    -0.0022565091494470835,
    -0.007114344742149115,
    -0.020843416452407837,
    0.022123193368315697,
    -0.0020442488603293896,
    -0.0031053132843226194,
    0.04128871485590935,
    0.0020253530237823725,
    0.001986527582630515,
    0.008684561587870121,
    -0.0586974062025547,
    -0.035307079553604126,
    -0.058561284095048904,
    0.0029506199061870575,
    0.03620448708534241,
    -0.01636006310582161,
    -5.153598792162484e-08,
    0.06615088880062103,
    0.03440692275762558,
    0.026496712118387222,
    0.0023001579102128744,
    -0.04379855841398239,
    -0.022624026983976364,
    -0.019599631428718567,
    -0.044209226965904236,
    0.060622960329055786,
    0.009759252890944481,
    0.018887687474489212,
    -0.03794228285551071,
    -0.044626377522945404,
    0.06888045370578766,
    0.030023619532585144,
    -0.030342549085617065,
    0.014222795143723488,
    0.03175356611609459,
    0.06273162364959717,
    0.03402027487754822,
    0.03565521165728569,
    -0.043282486498355865,
    0.05392863228917122,
    -0.00905726756900549,
    0.05479005351662636,
    0.02383260987699032,
    -0.008050121366977692,
    0.01764173060655594,
    0.024143198505043983,
    0.0804862529039383,
    0.021979056298732758,
    -0.01513622049242258,
    0.07273876667022705,
    0.0348929725587368,
    -0.016861237585544586,
    0.12480764836072922,
    0.04858938232064247,
    0.005813147872686386,
    -0.04358535632491112,
    0.13165120780467987,
    0.0012037022970616817,
    -0.04934758320450783,
    -0.007154133636504412,
    0.04682755842804909,
    -0.04544321820139885,
    0.006896662060171366,
    0.0551990270614624,
    0.03746833652257919,
    0.03460138291120529,
    0.0015353370690718293,
    -0.03709815442562103,
    -0.028735578060150146,
    -0.039159391075372696,
    -0.021882466971874237,
    -0.03813603147864342,
    0.07166166603565216,
    -0.041252024471759796,
    0.05005672946572304,
    0.009074862115085125,
    -0.021060770377516747,
    -0.04321571812033653,
    -0.06027800589799881,
    -0.06583792716264725,
    0.00356493191793561
  ],
  "metadata": {
    "url": "https://www.investopedia.com/terms/d/diversification.asp",
    "title": "What Is Diversification? Definition as Investing Strategy",
    "author": "Troy Segal",
    "date": "Updated May 06, 2025",
    "category": "Investing",
    "content_type": "definition",
    "word_count": 3415,
    "source": "www.investopedia.com"
  }
}