{
  "url": "https://www.fool.com/investing/stock-market/market-sectors/",
  "title": "What Are the 11 Stock Market Sectors?",
  "text": "Home Investing Stock Market Market Sectors What Are the 11 Stock Market Sectors? By Matthew Frankel, CFP Updated Jan 11, 2025 at 131PM Key Points Stock market sectors group similar stocks, easing comparison and investment decisions. Sector-based ETFs and mutual funds offer a low-risk entry into specific market areas. Key sectors include Energy, Healthcare, and IT, each with distinctive leading companies. Investor Alert Our 10 best stocks to buy right now Key findings are powered by ChatGPT and based solely off the content from this article. Findings are reviewed by our editorial team. The author and editors take ultimate responsibility for the content. What is a stock market sector? A stock market sector is a group of stocks that have a lot in common with each other, usually because they are in similar industries. There are 11 different stock market sectors, according to the most commonly used classification system, known as the Global Industry Classification Standard GICS. We categorize stocks into sectors to make it easy to compare companies that have similar business models. Sectors also make it easier to compare which stocks are making the most money. Image source The Motley Fool 11 sectors Investing in stock sectors At a glance, the 11 GICS stock market sectors are Energy Materials Industrials Utilities Healthcare Financials Consumer Discretionary Consumer Staples Information Technology Communication Services Real Estate 1. Energy sector The energy sector covers companies that do business in the oil and natural gas industry. It includes oil and gas exploration and production companies, as well as producers of other consumable fuels like coal and ethanol. The energy sector also includes the related businesses that provide equipment, materials, and services to oil and gas producers. It doesnt include many renewable energy companies, which instead are considered utilities. Large U.S. stocks in the energy sector are ExxonMobil XOM -0.5 and Chevron CVX -1.0 . 2. Materials sector The materials sector includes companies that provide various goods for use in manufacturing and other applications. Youll find makers of chemicals , construction materials, and containers and packaging within the materials sector, along with mining stocks and companies specializing in making paper and forest products . Well-known materials stocks include paint maker Sherwin-Williams SHW 0.87 and chemicals manufacturer DuPont DD -2.48 . 3. Industrials sector The industrials sector encompasses a wide range of different businesses that generally involve the use of heavy equipment. Transportation stocks such as airlines , railroads , and logistics companies are found within the industrials sector, as are companies in the aerospace , defense , construction , and engineering industries. Companies making building products, electrical equipment, and machinery also fall into this sector, as do many conglomerates . UPS UPS -0.55 and RTX RTX 1.35 are the largest U.S. industrials stocks. 4. Utilities sector The utilities sector encompasses every different type of utility company you can imagine. Within the sector, youll find utilities specializing in making electrical power available to residential and commercial customers, as well as specialists in natural gas transmission and distribution. Other utilities are responsible for delivering water to customers. Some utility companies engage in more than one of these different subspecialties. In addition, independent producers of power and renewable electricity also land in the utilities sector, even though they dont exactly resemble the traditional regulated utility. Utilities tend to be regional in scope, so you might have heard of Duke Energy DUK 1.9 in the Southeast U.S., Consolidated Edison ED 1.21 in the Northeast, and American Electric Power AEP 0.97 across much of the Ohio Valley and the Southern Plains states. 5. Healthcare sector The healthcare sector has two primary components. One component includes companies that develop pharmaceuticals and treatments based on biotechnology , as well as the analytical tools and supplies needed for the clinical trials that test those treatments. The other encompasses healthcare equipment and services, including surgical supplies, medical diagnostic tools , and health insurance. Telemedicine is a particularly interesting part of the healthcare sector that falls into the latter category. UnitedHealth Group UNH 0.98 and Johnson Johnson JNJ 0.98 are the two stocks at the top of the healthcare sector, with a combined market cap of almost 1 trillion between them. 6. Financials sector The financials sector includes businesses that are primarily related to handling money. Banks are a key industry group within the sector, but youll also find insurance companies , brokerage houses, consumer finance providers, and mortgage-related real estate investment trusts among financials. The financial sector also includes some of the best-known financial technology, or fintech , companies. Warren Buffetts Berkshire Hathaway BRK.A -0.16 BRK.B -0.44 and financial giant JPMorgan Chase JPM -0.11 are among the best-known stocks in the financials sector. Definition Icon Fintech Fintech, short for financial technology, are a variety of software platforms, apps, and hardware solutions that leverage tech to make financial processes easier, more efficient and more profitable. 7. Consumer discretionary sector The consumer discretionary sector covers goods and services for which consumer demand depends upon consumer financial status. For example, if you make 25,000 per year, you probably buy a different car than someone who makes 25 million per year. The sector includes companies that sell higher-priced items like automobiles and luxury goods , as well as leisure products . Youll find both brick-and-mortar and e-commerce-based retail companies in this category, along with hotel and restaurant stocks. Amazon AMZN -0.31 and McDonalds MCD 0.67 are among the biggest stocks in the sector. 8. Consumer staples sector The consumer staples sector includes goods and services that consumers need, regardless of their current financial condition or the current economic climate. The category includes companies in the food , beverage , and tobacco industries , as well as household and personal care products. Youll also find retail companies that specialize in selling staples, such as grocery retailers, in this group. Coca-Cola KO 0.98 and Procter Gamble PG 0.88 are two of the most valuable consumer staples stocks in the U.S. market. 9. Information technology sector Also commonly referred to as simply the tech sector, the information technology sector covers companies involved in the different categories of technological innovation. Some companies in information technology focus on creating software or providing services related to implementing technological solutions like cybersecurity , while others are more involved in building the equipment, components, and hardware that make tech possible. Information technology also includes makers of semiconductors and the equipment used to produce semiconductor chips. Apple AAPL 0.76 and Nvidia NVDA -2.85 have been switching places at the top of the list of large U.S. stocks in the information technology sector. 10. Communication services sector The communication services sector is among the newest of the GICS sectors and includes a couple of major areas that used to be part of other sectors. Telecommunication services providers make up one wing of the sector. At the other end are media and entertainment companies, including both older media like television and radio and interactive media via the internet and newer forms of communication. Social media giant Meta META 0.49 and search engine pioneer Alphabet GOOG 0.06 L GOOG 0.06 are among the biggest stocks in communication services. 11. Real estate sector The real estate sector is the newest GICS sector, having formerly been part of the financial sector. It generally includes two different types of investments related to real estate. Some stocks in the sector are responsible for developing new real estate projects and then managing them by obtaining tenants for various spaces within the project property. In addition, most real estate investment trusts , or REITs pronounced REETS, which are special tax-favored business entities that operate in various areas of the real estate industry, get counted within the real estate sector. Among the top stocks in the real estate sector, youll find cellular communications tower specialist American Tower AMT 0.58 and major shopping mall owner and operator Simon Property Group SPG -0.2 . Related investing topics How to Invest Money A Step-by-Step Guide Before you put down your hard-earned cash, consider your investment style. Student Loans Everything You Need to Know Theres a lot to unpack about student loans, so heres a guide to get you started. Understanding Treasury Bonds and Other Investments Issued by the U.S. government to raise money, T-bonds should have a place in your portfolio. Sector investing Sector investing If you are interested in a certain sector but are not ready to invest in a specific company within that sector, you can still participate in sector investing. Seek out lower-risk investments like exchange-traded funds ETFs and mutual funds that are specifically tied to a sector. For example, if you arent comfortable evaluating health care stocks but want exposure in your portfolio, an index fund that tracks the sector could be the best way to go. Sector investing plays an increasingly important role in the strategies that investors use today. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fools board of directors. JPMorgan Chase is an advertising partner of Motley Fool Money. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fools board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fools board of directors. Matt Frankel has positions in Amazon, Berkshire Hathaway, and Simon Property Group. The Motley Fool has positions in and recommends Alphabet, Amazon, American Tower, Apple, Berkshire Hathaway, Chevron, JPMorgan Chase, Meta Platforms, Nvidia, and Simon Property Group. The Motley Fool recommends Duke Energy, Johnson Johnson, RTX, Sherwin-Williams, United Parcel Service, and UnitedHealth Group and recommends the following options long January 2026 180 calls on American Tower and short January 2026 185 calls on American Tower. The Motley Fool has a disclosure policy . Related Articles 2 Top Stocks to Buy Right Now Could Buying SoFi Technologies Stock Today Set You Up for Life? Vice President JD Vance Just Delivered Incredible News to Bitcoin Investors Billionaire Bill Ackman Has 51 of His Hedge Funds 13.6 Billion Portfolio Invested in Just 3 Stocks 1 Top Cryptocurrency to Buy Before It Soars 450, According to Standard Chartered Prediction These 3 Cryptos Will Outperform Bitcoin in 2025 1 No-Brainer Artificial Intelligence AI ETF to Buy With 50 During the SP 500 Bull Market Our Guides Top 3 Financial Stocks for 2025 Investing in Top Utility Stocks Investing in Consumer Staples Stocks Investing in Top Consumer Discretionary Stocks Investing in Energy Stocks Investing in the Best Healthcare Stocks Investing in Industrial Stocks Investing in Tech Stocks Materials Stocks to Invest in 2025 Investing in Communication Stocks How to Invest in Real Estate A Complete Guide Investing in Sector ETFs arrow-left arrow-right What is a stock market sector? A stock market sector is a group of stocks that have a lot in common with each other, usually because they are in similar industries. There are 11 different stock market sectors, according to the most commonly used classification system, known as the Global Industry Classification Standard GICS. We categorize stocks into sectors to make it easy to compare companies that have similar business models. Sectors also make it easier to compare which stocks are making the most money. Image source The Motley Fool 11 sectors Investing in stock sectors At a glance, the 11 GICS stock market sectors are Energy Materials Industrials Utilities Healthcare Financials Consumer Discretionary Consumer Staples Information Technology Communication Services Real Estate 1. Energy sector The energy sector covers companies that do business in the oil and natural gas industry. It includes oil and gas exploration and production companies, as well as producers of other consumable fuels like coal and ethanol. The energy sector also includes the related businesses that provide equipment, materials, and services to oil and gas producers. It doesnt include many renewable energy companies, which instead are considered utilities. Large U.S. stocks in the energy sector are ExxonMobil XOM -0.5 and Chevron CVX -1.0 . 2. Materials sector The materials sector includes companies that provide various goods for use in manufacturing and other applications. Youll find makers of chemicals , construction materials, and containers and packaging within the materials sector, along with mining stocks and companies specializing in making paper and forest products . Well-known materials stocks include paint maker Sherwin-Williams SHW 0.87 and chemicals manufacturer DuPont DD -2.48 . 3. Industrials sector The industrials sector encompasses a wide range of different businesses that generally involve the use of heavy equipment. Transportation stocks such as airlines , railroads , and logistics companies are found within the industrials sector, as are companies in the aerospace , defense , construction , and engineering industries. Companies making building products, electrical equipment, and machinery also fall into this sector, as do many conglomerates . UPS UPS -0.55 and RTX RTX 1.35 are the largest U.S. industrials stocks. 4. Utilities sector The utilities sector encompasses every different type of utility company you can imagine. Within the sector, youll find utilities specializing in making electrical power available to residential and commercial customers, as well as specialists in natural gas transmission and distribution. Other utilities are responsible for delivering water to customers. Some utility companies engage in more than one of these different subspecialties. In addition, independent producers of power and renewable electricity also land in the utilities sector, even though they dont exactly resemble the traditional regulated utility. Utilities tend to be regional in scope, so you might have heard of Duke Energy DUK 1.9 in the Southeast U.S., Consolidated Edison ED 1.21 in the Northeast, and American Electric Power AEP 0.97 across much of the Ohio Valley and the Southern Plains states. 5. Healthcare sector The healthcare sector has two primary components. One component includes companies that develop pharmaceuticals and treatments based on biotechnology , as well as the analytical tools and supplies needed for the clinical trials that test those treatments. The other encompasses healthcare equipment and services, including surgical supplies, medical diagnostic tools , and health insurance. Telemedicine is a particularly interesting part of the healthcare sector that falls into the latter category. UnitedHealth Group UNH 0.98 and Johnson Johnson JNJ 0.98 are the two stocks at the top of the healthcare sector, with a combined market cap of almost 1 trillion between them. 6. Financials sector The financials sector includes businesses that are primarily related to handling money. Banks are a key industry group within the sector, but youll also find insurance companies , brokerage houses, consumer finance providers, and mortgage-related real estate investment trusts among financials. The financial sector also includes some of the best-known financial technology, or fintech , companies. Warren Buffetts Berkshire Hathaway BRK.A -0.16 BRK.B -0.44 and financial giant JPMorgan Chase JPM -0.11 are among the best-known stocks in the financials sector. Definition Icon Fintech Fintech, short for financial technology, are a variety of software platforms, apps, and hardware solutions that leverage tech to make financial processes easier, more efficient and more profitable. 7. Consumer discretionary sector The consumer discretionary sector covers goods and services for which consumer demand depends upon consumer financial status. For example, if you make 25,000 per year, you probably buy a different car than someone who makes 25 million per year. The sector includes companies that sell higher-priced items like automobiles and luxury goods , as well as leisure products . Youll find both brick-and-mortar and e-commerce-based retail companies in this category, along with hotel and restaurant stocks. Amazon AMZN -0.31 and McDonalds MCD 0.67 are among the biggest stocks in the sector. 8. Consumer staples sector The consumer staples sector includes goods and services that consumers need, regardless of their current financial condition or the current economic climate. The category includes companies in the food , beverage , and tobacco industries , as well as household and personal care products. Youll also find retail companies that specialize in selling staples, such as grocery retailers, in this group. Coca-Cola KO 0.98 and Procter Gamble PG 0.88 are two of the most valuable consumer staples stocks in the U.S. market. 9. Information technology sector Also commonly referred to as simply the tech sector, the information technology sector covers companies involved in the different categories of technological innovation. Some companies in information technology focus on creating software or providing services related to implementing technological solutions like cybersecurity , while others are more involved in building the equipment, components, and hardware that make tech possible. Information technology also includes makers of semiconductors and the equipment used to produce semiconductor chips. Apple AAPL 0.76 and Nvidia NVDA -2.85 have been switching places at the top of the list of large U.S. stocks in the information technology sector. 10. Communication services sector The communication services sector is among the newest of the GICS sectors and includes a couple of major areas that used to be part of other sectors. Telecommunication services providers make up one wing of the sector. At the other end are media and entertainment companies, including both older media like television and radio and interactive media via the internet and newer forms of communication. Social media giant Meta META 0.49 and search engine pioneer Alphabet GOOG 0.06 L GOOG 0.06 are among the biggest stocks in communication services. 11. Real estate sector The real estate sector is the newest GICS sector, having formerly been part of the financial sector. It generally includes two different types of investments related to real estate. Some stocks in the sector are responsible for developing new real estate projects and then managing them by obtaining tenants for various spaces within the project property. In addition, most real estate investment trusts , or REITs pronounced REETS, which are special tax-favored business entities that operate in various areas of the real estate industry, get counted within the real estate sector. Among the top stocks in the real estate sector, youll find cellular communications tower specialist American Tower AMT 0.58 and major shopping mall owner and operator Simon Property Group SPG -0.2 . Related investing topics How to Invest Money A Step-by-Step Guide Before you put down your hard-earned cash, consider your investment style. Student Loans Everything You Need to Know Theres a lot to unpack about student loans, so heres a guide to get you started. Understanding Treasury Bonds and Other Investments Issued by the U.S. government to raise money, T-bonds should have a place in your portfolio. Sector investing Sector investing If you are interested in a certain sector but are not ready to invest in a specific company within that sector, you can still participate in sector investing. Seek out lower-risk investments like exchange-traded funds ETFs and mutual funds that are specifically tied to a sector. For example, if you arent comfortable evaluating health care stocks but want exposure in your portfolio, an index fund that tracks the sector could be the best way to go. Sector investing plays an increasingly important role in the strategies that investors use today. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fools board of directors. JPMorgan Chase is an advertising partner of Motley Fool Money. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fools board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fools board of directors. Matt Frankel has positions in Amazon, Berkshire Hathaway, and Simon Property Group. The Motley Fool has positions in and recommends Alphabet, Amazon, American Tower, Apple, Berkshire Hathaway, Chevron, JPMorgan Chase, Meta Platforms, Nvidia, and Simon Property Group. The Motley Fool recommends Duke Energy, Johnson Johnson, RTX, Sherwin-Williams, United Parcel Service, and UnitedHealth Group and recommends the following options long January 2026 180 calls on American Tower and short January 2026 185 calls on American Tower. The Motley Fool has a disclosure policy . Related Articles 2 Top Stocks to Buy Right Now Could Buying SoFi Technologies Stock Today Set You Up for Life? Vice President JD Vance Just Delivered Incredible News to Bitcoin Investors Billionaire Bill Ackman Has 51 of His Hedge Funds 13.6 Billion Portfolio Invested in Just 3 Stocks 1 Top Cryptocurrency to Buy Before It Soars 450, According to Standard Chartered Prediction These 3 Cryptos Will Outperform Bitcoin in 2025 1 No-Brainer Artificial Intelligence AI ETF to Buy With 50 During the SP 500 Bull Market Premium Investing Services Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fools premium services. View Premium Services",
  "matched_keywords": [
    "stocks",
    "mutual funds",
    "ETF",
    "NSE",
    "portfolio",
    "investment",
    "bonds",
    "crypto"
  ],
  "embedding": [
    0.02397392876446247,
    -0.0860758051276207,
    -0.029568525031208992,
    0.014669843018054962,
    0.10091014951467514,
    -0.03321380540728569,
    0.02894042246043682,
    -0.03412793204188347,
    -0.012578373774886131,
    -0.08200924843549728,
    -0.05747673287987709,
    0.038304030895233154,
    -0.0009248447604477406,
    -0.004202829208225012,
    0.05020846426486969,
    -0.16379572451114655,
    0.030246512964367867,
    -0.02947256714105606,
    -0.031366780400276184,
    0.003426095936447382,
    -0.03603937476873398,
    -0.01922633685171604,
    0.07381458580493927,
    0.024548985064029694,
    0.023921547457575798,
    0.013619517907500267,
    0.02592138946056366,
    0.03037279099225998,
    -0.15104082226753235,
    0.0016739297425374389,
    -0.020926615223288536,
    0.041640158742666245,
    0.043147798627614975,
    0.007146473508328199,
    -0.01747235469520092,
    0.08685453236103058,
    0.018610956147313118,
    0.05290701985359192,
    0.08032586425542831,
    0.03898138552904129,
    -0.06421500444412231,
    -0.0556846484541893,
    0.010710821487009525,
    -0.025267699733376503,
    0.051706839352846146,
    -0.028375187888741493,
    -0.03630830720067024,
    -0.06152515113353729,
    0.058573782444000244,
    -0.002292503835633397,
    -0.06550832837820053,
    -0.003968491684645414,
    -0.03063978999853134,
    0.09989022463560104,
    0.010496880859136581,
    0.020882640033960342,
    -0.08470765501260757,
    -0.012267455458641052,
    0.025548497214913368,
    0.026040267199277878,
    0.03321375325322151,
    -0.06882663071155548,
    0.06274311989545822,
    -0.02502463571727276,
    0.022615503519773483,
    0.018665868788957596,
    -0.06744026392698288,
    0.05997559055685997,
    -0.05023200437426567,
    -0.09510169923305511,
    0.09424793720245361,
    -0.02897420898079872,
    -0.08580952137708664,
    -0.026476414874196053,
    -0.05738035961985588,
    0.011442572809755802,
    -0.01606387086212635,
    0.037841975688934326,
    0.05387279763817787,
    -0.03318047896027565,
    0.015953505411744118,
    0.042807646095752716,
    -0.01445364486426115,
    -0.014572151936590672,
    -0.05480464547872543,
    -0.012075354345142841,
    0.03377288579940796,
    -0.01328879315406084,
    -0.060303132981061935,
    0.030673794448375702,
    0.01126174908131361,
    0.020059090107679367,
    0.03837260603904724,
    0.009513096883893013,
    0.12871268391609192,
    0.008719095960259438,
    -0.028740715235471725,
    -0.06403409689664841,
    -0.03191424906253815,
    -0.05014118179678917,
    0.08471418917179108,
    -0.039313506335020065,
    0.02957492507994175,
    0.03735636547207832,
    -0.06395883858203888,
    -0.09045081585645676,
    -0.0038254179526120424,
    0.06638506799936295,
    0.05239129066467285,
    -0.029318634420633316,
    -0.04610500857234001,
    0.11119063943624496,
    -0.06327033042907715,
    -0.0646468922495842,
    -0.0358116552233696,
    0.010625423863530159,
    0.010925049893558025,
    -0.04128694906830788,
    0.06898996233940125,
    0.09286762773990631,
    0.02384621649980545,
    0.015514739789068699,
    -0.0030364159028977156,
    -0.006999752949923277,
    0.06840117275714874,
    0.009255972690880299,
    -0.09939374029636383,
    4.9607896679295394e-33,
    -0.021110624074935913,
    0.02179327979683876,
    -0.00252760061994195,
    0.0416598916053772,
    -0.10862991958856583,
    0.012587481178343296,
    -0.053992241621017456,
    -0.04821615293622017,
    0.0414707325398922,
    -0.0007445923401974142,
    -0.055243492126464844,
    0.1375446915626526,
    -0.0223837997764349,
    0.04001308232545853,
    0.035843707621097565,
    -0.00585945462808013,
    -0.0683739185333252,
    0.05772538483142853,
    0.07022220641374588,
    -0.12007839977741241,
    -0.00015167771198321134,
    0.07260580360889435,
    0.02587776631116867,
    -0.005372288636863232,
    0.017962409183382988,
    -0.0717189759016037,
    -0.01550593227148056,
    -0.03614844009280205,
    0.04053404927253723,
    0.057118166238069534,
    0.05419791862368584,
    0.01667790673673153,
    -0.025687629356980324,
    -0.027145301923155785,
    -0.04953671246767044,
    -0.020963504910469055,
    -0.018155964091420174,
    0.011160352267324924,
    0.012892477214336395,
    -0.06174762174487114,
    -0.11191056668758392,
    -0.024905765429139137,
    -0.016269618645310402,
    0.020047208294272423,
    0.01559430081397295,
    0.06124652922153473,
    -0.0029868856072425842,
    0.017132220789790154,
    -0.02727186493575573,
    -0.013981498777866364,
    -0.01012751180678606,
    0.004642745479941368,
    0.014566933736205101,
    -0.041115306317806244,
    0.014268459752202034,
    0.004119549412280321,
    0.03182774782180786,
    -0.09059849381446838,
    -0.05156685411930084,
    0.08353431522846222,
    0.024560051038861275,
    0.04854525998234749,
    -0.030905628576874733,
    0.0016162735410034657,
    -0.03890189900994301,
    0.03041844815015793,
    0.05008269473910332,
    0.09125185012817383,
    -0.04609508439898491,
    0.1469494104385376,
    0.0474821962416172,
    -0.043996378779411316,
    -0.015705930069088936,
    0.0286647267639637,
    0.04324693977832794,
    0.009642412886023521,
    -0.06180604174733162,
    0.07282956689596176,
    -0.037976231426000595,
    0.05290839821100235,
    -0.009126822464168072,
    0.011826679110527039,
    -0.036159027367830276,
    0.007081837859004736,
    -0.01464817114174366,
    -0.017350487411022186,
    0.03929705172777176,
    -0.05500131472945213,
    -0.02326633408665657,
    -0.013865859247744083,
    -0.06436485797166824,
    0.010209514759480953,
    0.08143230527639389,
    0.058111000806093216,
    -0.03790675848722458,
    -5.602665052118188e-33,
    -0.02142348140478134,
    -0.008260891772806644,
    -0.034402016550302505,
    0.009209543466567993,
    -0.07850385457277298,
    -0.02739456482231617,
    0.0378766693174839,
    -0.08338868618011475,
    0.06258107721805573,
    0.06332124024629593,
    -0.028417646884918213,
    0.05542488768696785,
    0.022561905905604362,
    -0.023052049800753593,
    -0.05634129419922829,
    -0.04385777935385704,
    -0.026212409138679504,
    -0.00480957655236125,
    0.0014331352431327105,
    0.025755194947123528,
    0.06313224881887436,
    -0.00905163586139679,
    -0.015590736642479897,
    0.03383474424481392,
    -0.0139245530590415,
    0.07896456867456436,
    -0.1264687329530716,
    -0.0051021091639995575,
    0.056869324296712875,
    0.004759352188557386,
    -0.017440153285861015,
    -0.004001166671514511,
    -0.0027542547322809696,
    0.05767238512635231,
    -0.05767209455370903,
    -0.0020648923236876726,
    0.02224828489124775,
    -0.11019512265920639,
    -0.03241990879178047,
    -0.02996385283768177,
    0.0581057071685791,
    -0.03113471530377865,
    -0.007384705822914839,
    -0.03286101296544075,
    -0.037776827812194824,
    -0.041703373193740845,
    0.05547264590859413,
    0.10818609595298767,
    0.04300200939178467,
    0.04586676508188248,
    0.019988497719168663,
    0.054879914969205856,
    -0.012099575251340866,
    0.03701994568109512,
    -0.03918735682964325,
    0.044781506061553955,
    -0.019680898636579514,
    0.04081609100103378,
    -0.0880136787891388,
    0.03588542714715004,
    0.0605640783905983,
    0.10837125778198242,
    0.05221380293369293,
    0.07766424119472504,
    -0.05250897258520126,
    -0.024265719577670097,
    -0.03631555289030075,
    -0.03081333450973034,
    -0.020073695108294487,
    -0.039130743592977524,
    0.009336414746940136,
    -0.02690891921520233,
    0.019590970128774643,
    -0.08492119610309601,
    -0.059765640646219254,
    0.09007222950458527,
    0.036307744681835175,
    -0.0002468018501531333,
    -0.014789939858019352,
    0.053451742976903915,
    0.11419341713190079,
    -0.02415267936885357,
    -0.028459815308451653,
    0.05315133184194565,
    -0.026785191148519516,
    0.07478487491607666,
    0.03046157769858837,
    0.0029691436793655157,
    0.0734482929110527,
    0.006094046868383884,
    -0.05225721001625061,
    -0.08041886240243912,
    -0.009465987794101238,
    0.08788685500621796,
    -0.022878043353557587,
    -5.42220099930546e-08,
    -0.03214117884635925,
    -0.048683978617191315,
    0.0031764288432896137,
    -0.07361184060573578,
    -0.0469602607190609,
    -0.07560627907514572,
    -0.031245816498994827,
    0.03154084086418152,
    0.03698590397834778,
    0.045117005705833435,
    0.05743592977523804,
    0.03724396228790283,
    -0.1390218436717987,
    0.0005036012153141201,
    -0.08617956191301346,
    -0.09786888211965561,
    -0.09119675308465958,
    0.026023251935839653,
    0.041285812854766846,
    0.0027683372609317303,
    0.09882663935422897,
    -0.021474815905094147,
    0.025413941591978073,
    0.012802157551050186,
    0.020745042711496353,
    -0.05533542484045029,
    0.017961638048291206,
    -0.044927239418029785,
    0.024905962869524956,
    0.0866217240691185,
    0.02226615697145462,
    -0.08390217274427414,
    -0.017283858731389046,
    -0.038749031722545624,
    -0.012562285177409649,
    0.07209113240242004,
    0.05805336311459541,
    0.0327068455517292,
    -0.028406130149960518,
    0.023684581741690636,
    -0.0071529606357216835,
    -0.10222963988780975,
    -0.053713731467723846,
    -0.04524505138397217,
    -0.029815534129738808,
    -0.03776257485151291,
    -0.06309988349676132,
    0.024155814200639725,
    0.08578729629516602,
    0.0071489037945866585,
    -0.060634467750787735,
    0.023208843544125557,
    0.009778499603271484,
    0.0395016074180603,
    -0.047325827181339264,
    0.021355027332901955,
    -0.0499439463019371,
    -0.07204683125019073,
    -0.014975232072174549,
    0.005809907801449299,
    0.04537138715386391,
    -0.04135917127132416,
    0.04113968089222908,
    0.10519658774137497
  ],
  "metadata": {
    "url": "https://www.fool.com/investing/stock-market/market-sectors/",
    "title": "What Are the 11 Stock Market Sectors?",
    "author": "Matthew Frankel, CFP",
    "date": "",
    "category": "Home\n              \n            \n            >\n          \n        \n          \n            \n              Investing\n              \n            \n            >\n          \n        \n          \n            \n              Stock Market\n              \n            \n            >\n          \n        \n\n        \n          \n            Market Sectors",
    "content_type": "market",
    "word_count": 3433,
    "source": "www.fool.com"
  }
}