{
  "url": "https://www.investopedia.com/terms/i/inflation.asp",
  "title": "Inflation: What It Is and How to Control Inflation Rates",
  "text": "Inflation: What It Is and How to Control Inflation Rates What you need to know about the purchasing power of money and how it changes Inflation: What It Is and How to Control Inflation Rates What you need to know about the purchasing power of money and how it changes Table of Contents Expand Table of Contents What Is Inflation? Understanding Inflation Types Impact on Prices Protecting Your Finances Types of Price Indexes Formula Pros and Cons Controlling Inflation Deflation and Disinflation Hedging Examples FAQs The Bottom Line By Jason Fernando Full Bio Jason Fernando is a professional investor and writer who enjoys tackling and communicating complex business and financial problems. Learn about our editorial policies Updated February 25, 2025 Reviewed by Michael J Boyle Reviewed by Michael J Boyle Full Bio Michael Boyle is an experienced financial professional with more than 10 years working with financial planning, derivatives, equities, fixed income, project management, and analytics. Learn about our Financial Review Board Fact checked by Pete Rathburn Fact checked by Pete Rathburn Full Bio Pete Rathburn is a copy editor and fact-checker with expertise in economics and personal finance and over twenty years of experience in the classroom. Learn about our editorial policies Part of the Series Inflation Inflation: What It Is and How to Control Inflation Rates CURRENT ARTICLE Understanding Inflation 9 Common Effects of Inflation How to Profit From Inflation When Is Inflation Good for the Economy? How Does Current Cost of Living Compare to 20 Years Ago? Why Are P/E Ratios Higher When Inflation Is Low? What Causes Inflation and Who Profits From It? Types of Inflation Understand the Different Types of Inflation Wage Push Inflation Cost-Push Inflation Cost-Push Inflation vs. Demand-Pull Inflation: What's the Difference? Inflation vs. Stagflation: What's the difference? What Does Inflation Impact? What is the Relationship Between Inflation and Interest Rates? Inflation's Impact on Stock Returns How Does Inflation Affect Fixed-Income Investments? How Inflation Affects Your Cost of Living How Inflation Impacts Your Savings How Inflation Eats Away at Your Retirement Income What Impact Does Inflation Have on the Dollar Value Today? Inflation and Economic Recovery Understanding Hyperinflation Hyperinflation Why Didn't Quantitative Easing Lead to Hyperinflation? Worst Cases of Hyperinflation in History How the Great Inflation of the 1970s Happened Stagflation Understanding CPI Purchasing Power Consumer Price Index (CPI) Why Is the Consumer Price Index Controversial? Core Inflation Headline Inflation Related Terms (A-I) GDP Price Deflator Indexation Inflation Accounting Inflation-Adjusted Return Inflation Targeting Related Terms (J-Z) Real Economic Growth Rate Real Gross Domestic Product (GDP) Real Income Real Interest Rate Real Rate of Return Wage-Price Spiral By Jason Fernando Full Bio Jason Fernando is a professional investor and writer who enjoys tackling and communicating complex business and financial problems. Learn about our editorial policies Updated February 25, 2025 Reviewed by Michael J Boyle Reviewed by Michael J Boyle Full Bio Michael Boyle is an experienced financial professional with more than 10 years working with financial planning, derivatives, equities, fixed income, project management, and analytics. Learn about our Financial Review Board Fact checked by Pete Rathburn Fact checked by Pete Rathburn Full Bio Pete Rathburn is a copy editor and fact-checker with expertise in economics and personal finance and over twenty years of experience in the classroom. Learn about our editorial policies CURRENT ARTICLE Close What Is Inflation? Inflation is a gradual loss of purchasing power that is reflected in a broad rise in prices for goods and services over time. The inflation rate is calculated as the average price increase of a basket of selected goods and services over one year. High inflation means that prices are increasing quickly, while low inflation means that prices are growing more slowly. Inflation can be contrasted with deflation, which occurs when prices decline and purchasing power increases. Key Takeaways Inflation measures how quickly the prices of goods and services are rising. Inflation is classified into three types: demand-pull inflation, cost-push inflation, and built-in inflation. The most commonly used inflation indexes are the Consumer Price Index and the Wholesale Price Index. Inflation can be viewed positively or negatively depending on the individual viewpoint and rate of change. Those with tangible assets may like to see some inflation as it raises the value of their assets. 0 seconds of 1 minute, 9 seconds Volume 75% Press shift question mark to access a list of keyboard shortcuts Keyboard Shortcuts Enabled Disabled Shortcuts Open/Close / or ? Play/Pause SPACE Increase Volume ↑ Decrease Volume ↓ Seek Forward → Seek Backward ← Captions On/Off c Fullscreen/Exit Fullscreen f Mute/Unmute m Decrease Caption Size - Increase Caption Size + or = Seek % 0-9 Subtitle Settings Off English Font Color White Font Opacity 100% Font Size 100% Font Family sans-serif Character Edge None Edge Color Black Background Color Black Background Opacity 75% Window Color Black Window Opacity 0% Reset White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 200% 175% 150% 125% 100% 75% 50% Arial Courier Georgia Impact Lucida Console Tahoma Times New Roman Trebuchet MS Verdana None Raised Depressed Uniform Drop Shadow White Black Red Green Blue Yellow Magenta Cyan White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% Live 00:00 01:09 01:09 What Is Inflation? Understanding Inflation An increase in the money supply is the root of inflation, though this can play out through different mechanisms in the economy. A country’s money supply can be increased by the monetary authorities by: Printing and giving away more money to citizens Legally devaluing (reducing the value of) the legal tender currency Loaning new money into existence as reserve account credits through the banking system by purchasing government bonds from banks on the secondary market Other causes of inflation include supply bottlenecks and shortages of key goods, which can push prices to rise. Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. When inflation occurs, money loses its purchasing power. This can occur across any sector or throughout an entire economy. The expectation of inflation itself can further sustain the devaluation of money. Workers may demand higher wages and businesses may charge higher prices, in anticipation of sustained inflation. This, in turn, reinforces the factors that push prices up. Melissa Ling © Investopedia, 2019 Types of Inflation Inflation can be classified into three types: demand-pull inflation, cost-push inflation, and built-in inflation. Demand-Pull Effect Demand-pull inflation occurs when an increase in the supply of money and credit stimulates the overall demand for goods and services to increase more rapidly than the economy’s production capacity. This increases demand and leads to price rises. When people have more money, it leads to positive consumer sentiment. This, in turn, leads to higher spending, which pulls prices higher. It creates a demand-supply gap with higher demand and less flexible supply, which results in higher prices. Cost-Push Effect Cost-push inflation is a result of the increase in prices working through the production process inputs. When additions to the supply of money and credit are channeled into a commodity or other asset markets, costs for all kinds of intermediate goods rise. This is especially evident when there’s a negative economic shock to the supply of key commodities. These developments lead to higher costs for the finished product or service and work their way into rising consumer prices. For instance, when the money supply is expanded, it creates a speculative boom in oil prices . This means that the cost of energy can rise and contribute to rising consumer prices, which is reflected in various measures of inflation. Built-In Inflation Built-in inflation is related to adaptive expectations or the idea that people expect current inflation rates to continue in the future. As the price of goods and services rises, people may expect a continuous rise in the future at a similar rate. As such, workers may demand more costs or wages to maintain their standard of living. Their increased wages result in a higher cost of goods and services, and this wage-price spiral continues as one factor induces the other and vice versa. How Inflation Impacts Prices While it is easy to measure the price changes of individual products over time, human needs extend beyond just one or two products. Individuals need a big and diversified set of products as well as a host of services to live a comfortable life. They include commodities like food grains, metal, fuel, utilities like electricity and transportation, and services like healthcare , entertainment, and labor. Inflation aims to measure the overall impact of price changes for a diversified set of products and services. It allows for a single value representation of the increase in the price level of goods and services in an economy over a specified time. Prices rise, which means that one unit of money buys fewer goods and services. This loss of purchasing power impacts the cost of living for the common public which ultimately leads to a deceleration in economic growth. The consensus view among economists is that sustained inflation occurs when a nation’s money supply growth outpaces economic growth. 3% The increase in the Consumer Price Index for All Urban Consumers (CPI-U) over the 12 months ending January 2025 on an unadjusted basis. Prices increased by 0.5% on a seasonally adjusted basis in January 2025 from the previous month. 1 To combat this, the monetary authority (in most cases, the central bank ) takes the necessary steps to manage the money supply and credit to keep inflation within permissible limits and keep the economy running smoothly. Theoretically, monetarism is a popular theory that explains the relationship between inflation and the money supply of an economy. For example, following the Spanish conquest of the Aztec and Inca empires, massive amounts of gold and silver flowed into the Spanish and other European economies. Since the money supply rapidly increased, the value of money fell, contributing to rapidly rising prices. 2 Inflation is measured in a variety of ways depending on the types of goods and services. It is the opposite of deflation , which indicates a general decline in prices when the inflation rate falls below 0%. Keep in mind that deflation shouldn’t be confused with disinflation , which is a related term referring to a slowing down in the (positive) rate of inflation. Julie Bang / Investopedia How to Protect Your Finances During Inflation There are a range of measures that individuals can take to protect their finances against inflation. For instance, one may choose to invest in asset classes that outperform the market during inflationary times. This might include commodities like grain, beef, oil, electricity, and natural gas. Commodity prices typically stay one step ahead of product prices, and price increases for commodities are often seen as an indicator of inflation to come. Commodities, which can also be volatile, are easily affected by natural disasters, geopolitics, or conflict. Real estate income may also help buffer against inflation, as landlords can increase their rent to keep pace with the rise of prices overall. The U.S. government also offers Treasury Inflation-Protected Securities (TIPS) , a type of security indexed to inflation to protect against declines in purchasing power. Types of Price Indexes Depending upon the selected set of goods and services used, multiple types of baskets of goods are calculated and tracked as price indexes. The most commonly used price indexes are the Consumer Price Index (CPI) and the Wholesale Price Index (WPI) . Consumer Price Index (CPI) The CPI is a measure that examines the weighted average of prices of a basket of goods and services that are of primary consumer needs. They include transportation, food, and medical care. CPI is calculated by taking price changes for each item in the predetermined basket of goods and averaging them based on their relative weight in the whole basket. The prices in consideration are the retail prices of each item, as available for purchase by the individual citizens. CPI can impact the value of one currency against those of other nations. Changes in the CPI are used to assess price changes associated with the cost of living , making it one of the most frequently used statistics for identifying periods of inflation or deflation. In the United States, the Bureau of Labor Statistics (BLS) reports the CPI each month and has calculated it as far back as 1913. 3 Important The CPI-U, which was introduced in 1978, represents the buying habits of approximately 88% of the noninstitutional population of the United States. 4 5 Wholesale Price Index (WPI) The WPI is another popular measure of inflation. It measures and tracks the changes in the price of goods in the stages before the retail level. While WPI items vary from one country to another, they mostly include items at the producer or wholesale level. For example, it includes cotton prices for raw cotton, cotton yarn, cotton gray goods, and cotton clothing. 6 Although many countries and organizations use the WPI, many other countries, including the U.S., use a similar variant called the Producer Price Index (PPI) . 7 Producer Price Index (PPI) The PPI is a family of indexes that measures the average change in selling prices received by domestic producers of intermediate goods and services over time. The PPI measures price changes from the perspective of the seller and differs from the CPI, which measures price changes from the perspective of the buyer. 8 In all variants, the rise in the price of one component (say oil) may cancel out the price decline in another (say wheat) to a certain extent. Overall, each index represents the average weighted price change for the given constituents which may apply at the overall economy , sector, or commodity level. The Formula for Measuring Inflation The above-mentioned variants of price indexes can be used to calculate the value of inflation between two particular months (or years). While a lot of ready-made inflation calculators are already available on various financial portals and websites, it is always better to be aware of the underlying methodology to ensure accuracy with a clear understanding of the calculations. Mathematically, Percent Inflation Rate = (Final CPI Index Value ÷ Initial CPI Value) × 100 Say you wish to know how the purchasing power of $10,000 changed between January 1975 and January 2024. One can find price index data on various portals in a tabular form. From that table, pick up the corresponding CPI figures for the given two months. For September 1975, it was 52.1 (initial CPI value), and for January 2024, it was 308.417 (final CPI value). 9 10 Plugging in the formula yields: Percent Inflation Rate = (308.417 ÷ 52.1) × 100 = (5.9197) × 100 = 591.97% Since you wish to know how much $10,000 from January 1975 would be worth in January 2024, multiply the inflation rate by the amount to get the changed dollar value: Change in Dollar Value = 5.9197 × $10,000 = $59,197 This means that $10,000 in January 1975 will be worth $59,197 today. Essentially, if you purchased a basket of goods and services (as included in the CPI definition) worth $10,000 in 1975, the same basket would cost you $59,197 in January 2024. Advantages and Disadvantages of Inflation Inflation can be construed as either a good or a bad thing, depending upon which side one takes, and how rapidly the change occurs. Advantages Individuals with tangible assets (like property or stocked commodities) priced in their home currency may like to see some inflation as that raises the price of their assets, which they can sell at a higher rate. Inflation often leads to speculation by businesses in risky projects and by individuals who invest in company stocks because they expect better returns than inflation. An optimum level of inflation is often promoted to encourage spending to a certain extent instead of saving. If the purchasing power of money falls over time, there may be a greater incentive to spend now instead of saving and spending later. It may increase spending, which may boost economic activities in a country. A balanced approach is thought to keep the inflation value in an optimum and desirable range. Disadvantages Buyers of such assets may not be happy with inflation, as they will be required to shell out more money. People who hold assets valued in their home currency, such as cash or bonds, may not like inflation, as it erodes the real value of their holdings. As such, investors looking to protect their portfolios from inflation should consider inflation-hedged asset classes, such as gold, commodities, and real estate investment trusts (REITs). Inflation-indexed bonds are another popular option for investors to profit from inflation . High and variable rates of inflation can impose major costs on an economy. Businesses, workers, and consumers must all account for the effects of generally rising prices in their buying, selling, and planning decisions. This introduces an additional source of uncertainty into the economy, because they may guess wrong about the rate of future inflation. Time and resources expended on researching, estimating, and adjusting economic behavior are expected to rise to the general level of prices. That’s opposed to real economic fundamentals, which inevitably represent a cost to the economy as a whole. Even a low, stable, and easily predictable rate of inflation, which some consider otherwise optimal, may lead to serious problems in the economy. That’s because of how, where, and when the new money enters the economy. Whenever new money and credit enter the economy, it is always in the hands of specific individuals or business firms. The process of price level adjustments to the new money supply proceeds as they then spend the new money and it circulates from hand to hand and account to account through the economy. Inflation does drive up some prices first and drives up other prices later. This sequential change in purchasing power and prices (known as the Cantillon effect) means that the process of inflation not only increases the general price level over time but also distorts relative prices , wages, and rates of return along the way. 11 Economists, in general, understand that distortions of relative prices away from their economic equilibrium are not good for the economy, and Austrian economists even believe this process to be a major driver of cycles of recession in the economy. 12 Pros Leads to higher resale value of assets Optimum levels of inflation encourage spending Cons Buyers have to pay more for products and services Imposes higher prices on the economy Drives some prices up first and others later How Inflation Can Be Controlled A country’s financial regulator shoulders the important responsibility of keeping inflation in check. It is done by implementing measures through monetary policy , which refers to the actions of a central bank or other committees that determine the size and rate of growth of the money supply. In the U.S., the Fed’s monetary policy goals include moderate long-term interest rates, price stability, and maximum employment. Each of these goals is intended to promote a stable financial environment. The Federal Reserve clearly communicates long-term inflation goals in order to keep a steady long-term rate of inflation , which is thought to be beneficial to the economy. Price stability or a relatively constant level of inflation allows businesses to plan for the future since they know what to expect. The Fed believes that this will promote maximum employment, which is determined by non-monetary factors that fluctuate over time and are therefore subject to change. For this reason, the Fed doesn’t set a specific goal for maximum employment, and it is largely determined by employers’ assessments. Maximum employment does not mean zero unemployment, as at any given time there is a certain level of volatility as people vacate and start new jobs. 13 14 Hyperinflation is often described as a period of inflation of 50% or more per month. 15 Monetary authorities also take exceptional measures in extreme conditions of the economy. For instance, following the 2008 financial crisis, the U.S. Fed kept the interest rates near zero and pursued a bond-buying program called quantitative easing (QE) . 16 Some critics of the program alleged it would cause a spike in inflation in the U.S. dollar, but inflation peaked in 2007 and declined steadily over the next eight years. There are many complex reasons why QE didn’t lead to inflation or hyperinflation , though the simplest explanation is that the recession itself was a very prominent deflationary environment, and quantitative easing supported its effects. 17 18 Consequently, U.S. policymakers have attempted to keep inflation steady at around 2% per year. The European Central Bank (ECB) has also pursued aggressive quantitative easing to counter deflation in the eurozone, and some places have experienced negative interest rates . That’s due to fears that deflation could take hold in the eurozone and lead to economic stagnation. 19 20 Moreover, countries that experience higher rates of growth can absorb higher rates of inflation. India’s target is around 4% (with an upper tolerance of 6% and a lower tolerance of 2%), while Brazil aims for 3.25% (with an upper tolerance of 4.75% and a lower tolerance of 1.75%). 21 22 Meaning of Inflation, Deflation, and Disinflation While a high inflation rate means that prices are increasing, a low inflation rate does not mean that prices are falling. Counterintuitively, when the inflation rate falls, prices are still increasing, but at a slower rate than before. When the inflation rate falls (but remains positive), this is known as disinflation . Conversely, if the inflation rate becomes negative, that means that prices are falling. This is known as deflation , which can have negative effects on an economy. Because buying power increases over time, consumers have less incentive to spend money in the short term, resulting in falling economic activity. Hedging Against Inflation Stocks are considered to be the best hedge against inflation , as the rise in stock prices is inclusive of the effects of inflation. Since additions to the money supply in virtually all modern economies occur as bank credit injections through the financial system, much of the immediate effect on prices happens in financial assets that are priced in their home currency, such as stocks. Special financial instruments exist that one can use to safeguard investments against inflation. They include Treasury Inflation-Protected Securities (TIPS) , a low-risk treasury security that is indexed to inflation where the principal amount invested is increased by the percentage of inflation. 23 One can also opt for a TIPS mutual fund or TIPS-based exchange-traded fund (ETF) . To get access to stocks, ETFs, and other funds that can help avoid the dangers of inflation, you’ll likely need a brokerage account. Choosing a stockbroker can be a tedious process due to the variety among them. Gold is also considered to be a hedge against inflation, although this doesn’t always appear to be the case looking backward. Examples of Inflation Since all world currencies are fiat money , the money supply could increase rapidly for political reasons, resulting in rapid price level increases. The most famous example is the hyperinflation that struck the German Weimar Republic in the early 1920s. The nations that were victorious in World War I demanded reparations from Germany, which could not be paid in German paper currency, as this was of suspect value due to government borrowing. Germany attempted to print paper notes, buy foreign currency with them, and use that to pay their debts. This policy led to the rapid devaluation of the German mark along with the hyperinflation that accompanied the development. German consumers responded to the cycle by trying to spend their money as fast as possible, understanding that it would be worth less and less the longer they waited. More money flooded the economy, and its value plummeted to the point where people would paper their walls with practically worthless bills. Similar situations occurred in Peru in 1990 and in Zimbabwe between 2007 and 2008. 24 25 26 What Causes Inflation? There are three main causes of inflation: demand-pull inflation, cost-push inflation, and built-in inflation. Demand-pull inflation refers to situations where there are not enough products or services being produced to keep up with demand, causing their prices to increase. Cost-push inflation, on the other hand, occurs when the cost of producing products and services rises, forcing businesses to raise their prices. Built-in inflation (which is sometimes referred to as a wage-price spiral) occurs when workers demand higher wages to keep up with rising living costs. This, in turn, causes businesses to raise their prices in order to offset their rising wage costs, leading to a self-reinforcing loop of wage and price increases. Is Inflation Good or Bad? Too much inflation is generally considered bad for an economy, while too little inflation is also considered harmful. Many economists advocate for a middle ground of low to moderate inflation, of around 2% per year. Generally speaking, higher inflation harms savers because it erodes the purchasing power of the money they have saved; however, it can benefit borrowers because the inflation-adjusted value of their outstanding debts shrinks over time. What Are the Effects of Inflation? Inflation can affect the economy in several ways. For example, if inflation causes a nation’s currency to decline, this can benefit exporters by making their goods more affordable when priced in the currency of foreign nations. On the other hand, this could harm importers by making foreign-made goods more expensive. Higher inflation can also encourage spending, as consumers will aim to purchase goods quickly before their prices rise further. Savers, on the other hand, could see the real value of their savings erode, limiting their ability to spend or invest in the future. Why Was Inflation So High in 2024? Inflation has remained elevated since 2022 when inflation rates around the world rose to their highest levels since the early 1980s. While there is no single reason for this rapid rise in global prices, a series of events worked together to boost inflation to such high levels. 27 28 The COVID-19 pandemic led to lockdowns and other restrictions that greatly disrupted global supply chains, from factory closures to bottlenecks at maritime ports. Governments also issued stimulus checks and increased unemployment benefits to counter the financial impact on individuals and small businesses. When vaccines became widespread and the economy bounced back, demand (fueled in part by stimulus money and low interest rates) quickly outpaced supply, which struggled to get back to pre-COVID levels. Russia’s unprovoked invasion of Ukraine in early 2022 led to economic sanctions and trade restrictions on Russia, limiting the world’s supply of oil and gas since Russia is a large producer of fossil fuels. Food prices also rose as Ukraine’s large grain harvests could not be exported. As fuel and food prices rose, it led to similar increases down the value chains. The Fed raised interest rates to combat the high inflation, which significantly came down in 2023, though it remains above pre-pandemic levels . 29 9 The Bottom Line Inflation is a rise in prices, which results in the decline of purchasing power over time. Inflation is natural and the U.S. government targets an annual inflation rate of 2%; however, inflation can be dangerous when it increases too much, too fast. Inflation makes items more expensive, especially if wages do not rise by the same levels of inflation. Additionally, inflation erodes the value of some assets, especially cash. Governments and central banks seek to control inflation through monetary policy. Sponsored Trade on the Go. Anywhere, Anytime One of the world's largest crypto-asset exchanges is ready for you. Enjoy competitive fees and dedicated customer support while trading securely. You'll also have access to Binance tools that make it easier than ever to view your trade history, manage auto-investments, view price charts, and make conversions with zero fees. Make an account for free and join millions of traders and investors on the global crypto market. Close What Is Inflation? Inflation is a gradual loss of purchasing power that is reflected in a broad rise in prices for goods and services over time. The inflation rate is calculated as the average price increase of a basket of selected goods and services over one year. High inflation means that prices are increasing quickly, while low inflation means that prices are growing more slowly. Inflation can be contrasted with deflation, which occurs when prices decline and purchasing power increases. Key Takeaways Inflation measures how quickly the prices of goods and services are rising. Inflation is classified into three types: demand-pull inflation, cost-push inflation, and built-in inflation. The most commonly used inflation indexes are the Consumer Price Index and the Wholesale Price Index. Inflation can be viewed positively or negatively depending on the individual viewpoint and rate of change. Those with tangible assets may like to see some inflation as it raises the value of their assets. 0 seconds of 1 minute, 9 seconds Volume 75% Press shift question mark to access a list of keyboard shortcuts Keyboard Shortcuts Enabled Disabled Shortcuts Open/Close / or ? Play/Pause SPACE Increase Volume ↑ Decrease Volume ↓ Seek Forward → Seek Backward ← Captions On/Off c Fullscreen/Exit Fullscreen f Mute/Unmute m Decrease Caption Size - Increase Caption Size + or = Seek % 0-9 Subtitle Settings Off English Font Color White Font Opacity 100% Font Size 100% Font Family sans-serif Character Edge None Edge Color Black Background Color Black Background Opacity 75% Window Color Black Window Opacity 0% Reset White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 200% 175% 150% 125% 100% 75% 50% Arial Courier Georgia Impact Lucida Console Tahoma Times New Roman Trebuchet MS Verdana None Raised Depressed Uniform Drop Shadow White Black Red Green Blue Yellow Magenta Cyan White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% Live 00:00 01:09 01:09 What Is Inflation? Understanding Inflation An increase in the money supply is the root of inflation, though this can play out through different mechanisms in the economy. A country’s money supply can be increased by the monetary authorities by: Printing and giving away more money to citizens Legally devaluing (reducing the value of) the legal tender currency Loaning new money into existence as reserve account credits through the banking system by purchasing government bonds from banks on the secondary market Other causes of inflation include supply bottlenecks and shortages of key goods, which can push prices to rise. Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. When inflation occurs, money loses its purchasing power. This can occur across any sector or throughout an entire economy. The expectation of inflation itself can further sustain the devaluation of money. Workers may demand higher wages and businesses may charge higher prices, in anticipation of sustained inflation. This, in turn, reinforces the factors that push prices up. Melissa Ling © Investopedia, 2019 Types of Inflation Inflation can be classified into three types: demand-pull inflation, cost-push inflation, and built-in inflation. Demand-Pull Effect Demand-pull inflation occurs when an increase in the supply of money and credit stimulates the overall demand for goods and services to increase more rapidly than the economy’s production capacity. This increases demand and leads to price rises. When people have more money, it leads to positive consumer sentiment. This, in turn, leads to higher spending, which pulls prices higher. It creates a demand-supply gap with higher demand and less flexible supply, which results in higher prices. Cost-Push Effect Cost-push inflation is a result of the increase in prices working through the production process inputs. When additions to the supply of money and credit are channeled into a commodity or other asset markets, costs for all kinds of intermediate goods rise. This is especially evident when there’s a negative economic shock to the supply of key commodities. These developments lead to higher costs for the finished product or service and work their way into rising consumer prices. For instance, when the money supply is expanded, it creates a speculative boom in oil prices . This means that the cost of energy can rise and contribute to rising consumer prices, which is reflected in various measures of inflation. Built-In Inflation Built-in inflation is related to adaptive expectations or the idea that people expect current inflation rates to continue in the future. As the price of goods and services rises, people may expect a continuous rise in the future at a similar rate. As such, workers may demand more costs or wages to maintain their standard of living. Their increased wages result in a higher cost of goods and services, and this wage-price spiral continues as one factor induces the other and vice versa. How Inflation Impacts Prices While it is easy to measure the price changes of individual products over time, human needs extend beyond just one or two products. Individuals need a big and diversified set of products as well as a host of services to live a comfortable life. They include commodities like food grains, metal, fuel, utilities like electricity and transportation, and services like healthcare , entertainment, and labor. Inflation aims to measure the overall impact of price changes for a diversified set of products and services. It allows for a single value representation of the increase in the price level of goods and services in an economy over a specified time. Prices rise, which means that one unit of money buys fewer goods and services. This loss of purchasing power impacts the cost of living for the common public which ultimately leads to a deceleration in economic growth. The consensus view among economists is that sustained inflation occurs when a nation’s money supply growth outpaces economic growth. 3% The increase in the Consumer Price Index for All Urban Consumers (CPI-U) over the 12 months ending January 2025 on an unadjusted basis. Prices increased by 0.5% on a seasonally adjusted basis in January 2025 from the previous month. 1 To combat this, the monetary authority (in most cases, the central bank ) takes the necessary steps to manage the money supply and credit to keep inflation within permissible limits and keep the economy running smoothly. Theoretically, monetarism is a popular theory that explains the relationship between inflation and the money supply of an economy. For example, following the Spanish conquest of the Aztec and Inca empires, massive amounts of gold and silver flowed into the Spanish and other European economies. Since the money supply rapidly increased, the value of money fell, contributing to rapidly rising prices. 2 Inflation is measured in a variety of ways depending on the types of goods and services. It is the opposite of deflation , which indicates a general decline in prices when the inflation rate falls below 0%. Keep in mind that deflation shouldn’t be confused with disinflation , which is a related term referring to a slowing down in the (positive) rate of inflation. Julie Bang / Investopedia How to Protect Your Finances During Inflation There are a range of measures that individuals can take to protect their finances against inflation. For instance, one may choose to invest in asset classes that outperform the market during inflationary times. This might include commodities like grain, beef, oil, electricity, and natural gas. Commodity prices typically stay one step ahead of product prices, and price increases for commodities are often seen as an indicator of inflation to come. Commodities, which can also be volatile, are easily affected by natural disasters, geopolitics, or conflict. Real estate income may also help buffer against inflation, as landlords can increase their rent to keep pace with the rise of prices overall. The U.S. government also offers Treasury Inflation-Protected Securities (TIPS) , a type of security indexed to inflation to protect against declines in purchasing power. Types of Price Indexes Depending upon the selected set of goods and services used, multiple types of baskets of goods are calculated and tracked as price indexes. The most commonly used price indexes are the Consumer Price Index (CPI) and the Wholesale Price Index (WPI) . Consumer Price Index (CPI) The CPI is a measure that examines the weighted average of prices of a basket of goods and services that are of primary consumer needs. They include transportation, food, and medical care. CPI is calculated by taking price changes for each item in the predetermined basket of goods and averaging them based on their relative weight in the whole basket. The prices in consideration are the retail prices of each item, as available for purchase by the individual citizens. CPI can impact the value of one currency against those of other nations. Changes in the CPI are used to assess price changes associated with the cost of living , making it one of the most frequently used statistics for identifying periods of inflation or deflation. In the United States, the Bureau of Labor Statistics (BLS) reports the CPI each month and has calculated it as far back as 1913. 3 Important The CPI-U, which was introduced in 1978, represents the buying habits of approximately 88% of the noninstitutional population of the United States. 4 5 Wholesale Price Index (WPI) The WPI is another popular measure of inflation. It measures and tracks the changes in the price of goods in the stages before the retail level. While WPI items vary from one country to another, they mostly include items at the producer or wholesale level. For example, it includes cotton prices for raw cotton, cotton yarn, cotton gray goods, and cotton clothing. 6 Although many countries and organizations use the WPI, many other countries, including the U.S., use a similar variant called the Producer Price Index (PPI) . 7 Producer Price Index (PPI) The PPI is a family of indexes that measures the average change in selling prices received by domestic producers of intermediate goods and services over time. The PPI measures price changes from the perspective of the seller and differs from the CPI, which measures price changes from the perspective of the buyer. 8 In all variants, the rise in the price of one component (say oil) may cancel out the price decline in another (say wheat) to a certain extent. Overall, each index represents the average weighted price change for the given constituents which may apply at the overall economy , sector, or commodity level. The Formula for Measuring Inflation The above-mentioned variants of price indexes can be used to calculate the value of inflation between two particular months (or years). While a lot of ready-made inflation calculators are already available on various financial portals and websites, it is always better to be aware of the underlying methodology to ensure accuracy with a clear understanding of the calculations. Mathematically, Percent Inflation Rate = (Final CPI Index Value ÷ Initial CPI Value) × 100 Say you wish to know how the purchasing power of $10,000 changed between January 1975 and January 2024. One can find price index data on various portals in a tabular form. From that table, pick up the corresponding CPI figures for the given two months. For September 1975, it was 52.1 (initial CPI value), and for January 2024, it was 308.417 (final CPI value). 9 10 Plugging in the formula yields: Percent Inflation Rate = (308.417 ÷ 52.1) × 100 = (5.9197) × 100 = 591.97% Since you wish to know how much $10,000 from January 1975 would be worth in January 2024, multiply the inflation rate by the amount to get the changed dollar value: Change in Dollar Value = 5.9197 × $10,000 = $59,197 This means that $10,000 in January 1975 will be worth $59,197 today. Essentially, if you purchased a basket of goods and services (as included in the CPI definition) worth $10,000 in 1975, the same basket would cost you $59,197 in January 2024. Advantages and Disadvantages of Inflation Inflation can be construed as either a good or a bad thing, depending upon which side one takes, and how rapidly the change occurs. Advantages Individuals with tangible assets (like property or stocked commodities) priced in their home currency may like to see some inflation as that raises the price of their assets, which they can sell at a higher rate. Inflation often leads to speculation by businesses in risky projects and by individuals who invest in company stocks because they expect better returns than inflation. An optimum level of inflation is often promoted to encourage spending to a certain extent instead of saving. If the purchasing power of money falls over time, there may be a greater incentive to spend now instead of saving and spending later. It may increase spending, which may boost economic activities in a country. A balanced approach is thought to keep the inflation value in an optimum and desirable range. Disadvantages Buyers of such assets may not be happy with inflation, as they will be required to shell out more money. People who hold assets valued in their home currency, such as cash or bonds, may not like inflation, as it erodes the real value of their holdings. As such, investors looking to protect their portfolios from inflation should consider inflation-hedged asset classes, such as gold, commodities, and real estate investment trusts (REITs). Inflation-indexed bonds are another popular option for investors to profit from inflation . High and variable rates of inflation can impose major costs on an economy. Businesses, workers, and consumers must all account for the effects of generally rising prices in their buying, selling, and planning decisions. This introduces an additional source of uncertainty into the economy, because they may guess wrong about the rate of future inflation. Time and resources expended on researching, estimating, and adjusting economic behavior are expected to rise to the general level of prices. That’s opposed to real economic fundamentals, which inevitably represent a cost to the economy as a whole. Even a low, stable, and easily predictable rate of inflation, which some consider otherwise optimal, may lead to serious problems in the economy. That’s because of how, where, and when the new money enters the economy. Whenever new money and credit enter the economy, it is always in the hands of specific individuals or business firms. The process of price level adjustments to the new money supply proceeds as they then spend the new money and it circulates from hand to hand and account to account through the economy. Inflation does drive up some prices first and drives up other prices later. This sequential change in purchasing power and prices (known as the Cantillon effect) means that the process of inflation not only increases the general price level over time but also distorts relative prices , wages, and rates of return along the way. 11 Economists, in general, understand that distortions of relative prices away from their economic equilibrium are not good for the economy, and Austrian economists even believe this process to be a major driver of cycles of recession in the economy. 12 Pros Leads to higher resale value of assets Optimum levels of inflation encourage spending Cons Buyers have to pay more for products and services Imposes higher prices on the economy Drives some prices up first and others later How Inflation Can Be Controlled A country’s financial regulator shoulders the important responsibility of keeping inflation in check. It is done by implementing measures through monetary policy , which refers to the actions of a central bank or other committees that determine the size and rate of growth of the money supply. In the U.S., the Fed’s monetary policy goals include moderate long-term interest rates, price stability, and maximum employment. Each of these goals is intended to promote a stable financial environment. The Federal Reserve clearly communicates long-term inflation goals in order to keep a steady long-term rate of inflation , which is thought to be beneficial to the economy. Price stability or a relatively constant level of inflation allows businesses to plan for the future since they know what to expect. The Fed believes that this will promote maximum employment, which is determined by non-monetary factors that fluctuate over time and are therefore subject to change. For this reason, the Fed doesn’t set a specific goal for maximum employment, and it is largely determined by employers’ assessments. Maximum employment does not mean zero unemployment, as at any given time there is a certain level of volatility as people vacate and start new jobs. 13 14 Hyperinflation is often described as a period of inflation of 50% or more per month. 15 Monetary authorities also take exceptional measures in extreme conditions of the economy. For instance, following the 2008 financial crisis, the U.S. Fed kept the interest rates near zero and pursued a bond-buying program called quantitative easing (QE) . 16 Some critics of the program alleged it would cause a spike in inflation in the U.S. dollar, but inflation peaked in 2007 and declined steadily over the next eight years. There are many complex reasons why QE didn’t lead to inflation or hyperinflation , though the simplest explanation is that the recession itself was a very prominent deflationary environment, and quantitative easing supported its effects. 17 18 Consequently, U.S. policymakers have attempted to keep inflation steady at around 2% per year. The European Central Bank (ECB) has also pursued aggressive quantitative easing to counter deflation in the eurozone, and some places have experienced negative interest rates . That’s due to fears that deflation could take hold in the eurozone and lead to economic stagnation. 19 20 Moreover, countries that experience higher rates of growth can absorb higher rates of inflation. India’s target is around 4% (with an upper tolerance of 6% and a lower tolerance of 2%), while Brazil aims for 3.25% (with an upper tolerance of 4.75% and a lower tolerance of 1.75%). 21 22 Meaning of Inflation, Deflation, and Disinflation While a high inflation rate means that prices are increasing, a low inflation rate does not mean that prices are falling. Counterintuitively, when the inflation rate falls, prices are still increasing, but at a slower rate than before. When the inflation rate falls (but remains positive), this is known as disinflation . Conversely, if the inflation rate becomes negative, that means that prices are falling. This is known as deflation , which can have negative effects on an economy. Because buying power increases over time, consumers have less incentive to spend money in the short term, resulting in falling economic activity. Hedging Against Inflation Stocks are considered to be the best hedge against inflation , as the rise in stock prices is inclusive of the effects of inflation. Since additions to the money supply in virtually all modern economies occur as bank credit injections through the financial system, much of the immediate effect on prices happens in financial assets that are priced in their home currency, such as stocks. Special financial instruments exist that one can use to safeguard investments against inflation. They include Treasury Inflation-Protected Securities (TIPS) , a low-risk treasury security that is indexed to inflation where the principal amount invested is increased by the percentage of inflation. 23 One can also opt for a TIPS mutual fund or TIPS-based exchange-traded fund (ETF) . To get access to stocks, ETFs, and other funds that can help avoid the dangers of inflation, you’ll likely need a brokerage account. Choosing a stockbroker can be a tedious process due to the variety among them. Gold is also considered to be a hedge against inflation, although this doesn’t always appear to be the case looking backward. Examples of Inflation Since all world currencies are fiat money , the money supply could increase rapidly for political reasons, resulting in rapid price level increases. The most famous example is the hyperinflation that struck the German Weimar Republic in the early 1920s. The nations that were victorious in World War I demanded reparations from Germany, which could not be paid in German paper currency, as this was of suspect value due to government borrowing. Germany attempted to print paper notes, buy foreign currency with them, and use that to pay their debts. This policy led to the rapid devaluation of the German mark along with the hyperinflation that accompanied the development. German consumers responded to the cycle by trying to spend their money as fast as possible, understanding that it would be worth less and less the longer they waited. More money flooded the economy, and its value plummeted to the point where people would paper their walls with practically worthless bills. Similar situations occurred in Peru in 1990 and in Zimbabwe between 2007 and 2008. 24 25 26 What Causes Inflation? There are three main causes of inflation: demand-pull inflation, cost-push inflation, and built-in inflation. Demand-pull inflation refers to situations where there are not enough products or services being produced to keep up with demand, causing their prices to increase. Cost-push inflation, on the other hand, occurs when the cost of producing products and services rises, forcing businesses to raise their prices. Built-in inflation (which is sometimes referred to as a wage-price spiral) occurs when workers demand higher wages to keep up with rising living costs. This, in turn, causes businesses to raise their prices in order to offset their rising wage costs, leading to a self-reinforcing loop of wage and price increases. Is Inflation Good or Bad? Too much inflation is generally considered bad for an economy, while too little inflation is also considered harmful. Many economists advocate for a middle ground of low to moderate inflation, of around 2% per year. Generally speaking, higher inflation harms savers because it erodes the purchasing power of the money they have saved; however, it can benefit borrowers because the inflation-adjusted value of their outstanding debts shrinks over time. What Are the Effects of Inflation? Inflation can affect the economy in several ways. For example, if inflation causes a nation’s currency to decline, this can benefit exporters by making their goods more affordable when priced in the currency of foreign nations. On the other hand, this could harm importers by making foreign-made goods more expensive. Higher inflation can also encourage spending, as consumers will aim to purchase goods quickly before their prices rise further. Savers, on the other hand, could see the real value of their savings erode, limiting their ability to spend or invest in the future. Why Was Inflation So High in 2024? Inflation has remained elevated since 2022 when inflation rates around the world rose to their highest levels since the early 1980s. While there is no single reason for this rapid rise in global prices, a series of events worked together to boost inflation to such high levels. 27 28 The COVID-19 pandemic led to lockdowns and other restrictions that greatly disrupted global supply chains, from factory closures to bottlenecks at maritime ports. Governments also issued stimulus checks and increased unemployment benefits to counter the financial impact on individuals and small businesses. When vaccines became widespread and the economy bounced back, demand (fueled in part by stimulus money and low interest rates) quickly outpaced supply, which struggled to get back to pre-COVID levels. Russia’s unprovoked invasion of Ukraine in early 2022 led to economic sanctions and trade restrictions on Russia, limiting the world’s supply of oil and gas since Russia is a large producer of fossil fuels. Food prices also rose as Ukraine’s large grain harvests could not be exported. As fuel and food prices rose, it led to similar increases down the value chains. The Fed raised interest rates to combat the high inflation, which significantly came down in 2023, though it remains above pre-pandemic levels . 29 9 The Bottom Line Inflation is a rise in prices, which results in the decline of purchasing power over time. Inflation is natural and the U.S. government targets an annual inflation rate of 2%; however, inflation can be dangerous when it increases too much, too fast. Inflation makes items more expensive, especially if wages do not rise by the same levels of inflation. Additionally, inflation erodes the value of some assets, especially cash. Governments and central banks seek to control inflation through monetary policy. Sponsored Trade on the Go. Anywhere, Anytime One of the world's largest crypto-asset exchanges is ready for you. Enjoy competitive fees and dedicated customer support while trading securely. You'll also have access to Binance tools that make it easier than ever to view your trade history, manage auto-investments, view price charts, and make conversions with zero fees. Make an account for free and join millions of traders and investors on the global crypto market. What Is Inflation? Inflation is a gradual loss of purchasing power that is reflected in a broad rise in prices for goods and services over time. The inflation rate is calculated as the average price increase of a basket of selected goods and services over one year. High inflation means that prices are increasing quickly, while low inflation means that prices are growing more slowly. Inflation can be contrasted with deflation, which occurs when prices decline and purchasing power increases. Key Takeaways Inflation measures how quickly the prices of goods and services are rising. Inflation is classified into three types: demand-pull inflation, cost-push inflation, and built-in inflation. The most commonly used inflation indexes are the Consumer Price Index and the Wholesale Price Index. Inflation can be viewed positively or negatively depending on the individual viewpoint and rate of change. Those with tangible assets may like to see some inflation as it raises the value of their assets. 0 seconds of 1 minute, 9 seconds Volume 75% Press shift question mark to access a list of keyboard shortcuts Keyboard Shortcuts Enabled Disabled Shortcuts Open/Close / or ? Play/Pause SPACE Increase Volume ↑ Decrease Volume ↓ Seek Forward → Seek Backward ← Captions On/Off c Fullscreen/Exit Fullscreen f Mute/Unmute m Decrease Caption Size - Increase Caption Size + or = Seek % 0-9 Subtitle Settings Off English Font Color White Font Opacity 100% Font Size 100% Font Family sans-serif Character Edge None Edge Color Black Background Color Black Background Opacity 75% Window Color Black Window Opacity 0% Reset White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 200% 175% 150% 125% 100% 75% 50% Arial Courier Georgia Impact Lucida Console Tahoma Times New Roman Trebuchet MS Verdana None Raised Depressed Uniform Drop Shadow White Black Red Green Blue Yellow Magenta Cyan White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% Live 00:00 01:09 01:09 What Is Inflation? Understanding Inflation An increase in the money supply is the root of inflation, though this can play out through different mechanisms in the economy. A country’s money supply can be increased by the monetary authorities by: Printing and giving away more money to citizens Legally devaluing (reducing the value of) the legal tender currency Loaning new money into existence as reserve account credits through the banking system by purchasing government bonds from banks on the secondary market Other causes of inflation include supply bottlenecks and shortages of key goods, which can push prices to rise. Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. When inflation occurs, money loses its purchasing power. This can occur across any sector or throughout an entire economy. The expectation of inflation itself can further sustain the devaluation of money. Workers may demand higher wages and businesses may charge higher prices, in anticipation of sustained inflation. This, in turn, reinforces the factors that push prices up. Melissa Ling © Investopedia, 2019 Types of Inflation Inflation can be classified into three types: demand-pull inflation, cost-push inflation, and built-in inflation. Demand-Pull Effect Demand-pull inflation occurs when an increase in the supply of money and credit stimulates the overall demand for goods and services to increase more rapidly than the economy’s production capacity. This increases demand and leads to price rises. When people have more money, it leads to positive consumer sentiment. This, in turn, leads to higher spending, which pulls prices higher. It creates a demand-supply gap with higher demand and less flexible supply, which results in higher prices. Cost-Push Effect Cost-push inflation is a result of the increase in prices working through the production process inputs. When additions to the supply of money and credit are channeled into a commodity or other asset markets, costs for all kinds of intermediate goods rise. This is especially evident when there’s a negative economic shock to the supply of key commodities. These developments lead to higher costs for the finished product or service and work their way into rising consumer prices. For instance, when the money supply is expanded, it creates a speculative boom in oil prices . This means that the cost of energy can rise and contribute to rising consumer prices, which is reflected in various measures of inflation. Built-In Inflation Built-in inflation is related to adaptive expectations or the idea that people expect current inflation rates to continue in the future. As the price of goods and services rises, people may expect a continuous rise in the future at a similar rate. As such, workers may demand more costs or wages to maintain their standard of living. Their increased wages result in a higher cost of goods and services, and this wage-price spiral continues as one factor induces the other and vice versa. How Inflation Impacts Prices While it is easy to measure the price changes of individual products over time, human needs extend beyond just one or two products. Individuals need a big and diversified set of products as well as a host of services to live a comfortable life. They include commodities like food grains, metal, fuel, utilities like electricity and transportation, and services like healthcare , entertainment, and labor. Inflation aims to measure the overall impact of price changes for a diversified set of products and services. It allows for a single value representation of the increase in the price level of goods and services in an economy over a specified time. Prices rise, which means that one unit of money buys fewer goods and services. This loss of purchasing power impacts the cost of living for the common public which ultimately leads to a deceleration in economic growth. The consensus view among economists is that sustained inflation occurs when a nation’s money supply growth outpaces economic growth. 3% The increase in the Consumer Price Index for All Urban Consumers (CPI-U) over the 12 months ending January 2025 on an unadjusted basis. Prices increased by 0.5% on a seasonally adjusted basis in January 2025 from the previous month. 1 To combat this, the monetary authority (in most cases, the central bank ) takes the necessary steps to manage the money supply and credit to keep inflation within permissible limits and keep the economy running smoothly. Theoretically, monetarism is a popular theory that explains the relationship between inflation and the money supply of an economy. For example, following the Spanish conquest of the Aztec and Inca empires, massive amounts of gold and silver flowed into the Spanish and other European economies. Since the money supply rapidly increased, the value of money fell, contributing to rapidly rising prices. 2 Inflation is measured in a variety of ways depending on the types of goods and services. It is the opposite of deflation , which indicates a general decline in prices when the inflation rate falls below 0%. Keep in mind that deflation shouldn’t be confused with disinflation , which is a related term referring to a slowing down in the (positive) rate of inflation. Julie Bang / Investopedia How to Protect Your Finances During Inflation There are a range of measures that individuals can take to protect their finances against inflation. For instance, one may choose to invest in asset classes that outperform the market during inflationary times. This might include commodities like grain, beef, oil, electricity, and natural gas. Commodity prices typically stay one step ahead of product prices, and price increases for commodities are often seen as an indicator of inflation to come. Commodities, which can also be volatile, are easily affected by natural disasters, geopolitics, or conflict. Real estate income may also help buffer against inflation, as landlords can increase their rent to keep pace with the rise of prices overall. The U.S. government also offers Treasury Inflation-Protected Securities (TIPS) , a type of security indexed to inflation to protect against declines in purchasing power. Types of Price Indexes Depending upon the selected set of goods and services used, multiple types of baskets of goods are calculated and tracked as price indexes. The most commonly used price indexes are the Consumer Price Index (CPI) and the Wholesale Price Index (WPI) . Consumer Price Index (CPI) The CPI is a measure that examines the weighted average of prices of a basket of goods and services that are of primary consumer needs. They include transportation, food, and medical care. CPI is calculated by taking price changes for each item in the predetermined basket of goods and averaging them based on their relative weight in the whole basket. The prices in consideration are the retail prices of each item, as available for purchase by the individual citizens. CPI can impact the value of one currency against those of other nations. Changes in the CPI are used to assess price changes associated with the cost of living , making it one of the most frequently used statistics for identifying periods of inflation or deflation. In the United States, the Bureau of Labor Statistics (BLS) reports the CPI each month and has calculated it as far back as 1913. 3 Important The CPI-U, which was introduced in 1978, represents the buying habits of approximately 88% of the noninstitutional population of the United States. 4 5 Wholesale Price Index (WPI) The WPI is another popular measure of inflation. It measures and tracks the changes in the price of goods in the stages before the retail level. While WPI items vary from one country to another, they mostly include items at the producer or wholesale level. For example, it includes cotton prices for raw cotton, cotton yarn, cotton gray goods, and cotton clothing. 6 Although many countries and organizations use the WPI, many other countries, including the U.S., use a similar variant called the Producer Price Index (PPI) . 7 Producer Price Index (PPI) The PPI is a family of indexes that measures the average change in selling prices received by domestic producers of intermediate goods and services over time. The PPI measures price changes from the perspective of the seller and differs from the CPI, which measures price changes from the perspective of the buyer. 8 In all variants, the rise in the price of one component (say oil) may cancel out the price decline in another (say wheat) to a certain extent. Overall, each index represents the average weighted price change for the given constituents which may apply at the overall economy , sector, or commodity level. The Formula for Measuring Inflation The above-mentioned variants of price indexes can be used to calculate the value of inflation between two particular months (or years). While a lot of ready-made inflation calculators are already available on various financial portals and websites, it is always better to be aware of the underlying methodology to ensure accuracy with a clear understanding of the calculations. Mathematically, Percent Inflation Rate = (Final CPI Index Value ÷ Initial CPI Value) × 100 Say you wish to know how the purchasing power of $10,000 changed between January 1975 and January 2024. One can find price index data on various portals in a tabular form. From that table, pick up the corresponding CPI figures for the given two months. For September 1975, it was 52.1 (initial CPI value), and for January 2024, it was 308.417 (final CPI value). 9 10 Plugging in the formula yields: Percent Inflation Rate = (308.417 ÷ 52.1) × 100 = (5.9197) × 100 = 591.97% Since you wish to know how much $10,000 from January 1975 would be worth in January 2024, multiply the inflation rate by the amount to get the changed dollar value: Change in Dollar Value = 5.9197 × $10,000 = $59,197 This means that $10,000 in January 1975 will be worth $59,197 today. Essentially, if you purchased a basket of goods and services (as included in the CPI definition) worth $10,000 in 1975, the same basket would cost you $59,197 in January 2024. Advantages and Disadvantages of Inflation Inflation can be construed as either a good or a bad thing, depending upon which side one takes, and how rapidly the change occurs. Advantages Individuals with tangible assets (like property or stocked commodities) priced in their home currency may like to see some inflation as that raises the price of their assets, which they can sell at a higher rate. Inflation often leads to speculation by businesses in risky projects and by individuals who invest in company stocks because they expect better returns than inflation. An optimum level of inflation is often promoted to encourage spending to a certain extent instead of saving. If the purchasing power of money falls over time, there may be a greater incentive to spend now instead of saving and spending later. It may increase spending, which may boost economic activities in a country. A balanced approach is thought to keep the inflation value in an optimum and desirable range. Disadvantages Buyers of such assets may not be happy with inflation, as they will be required to shell out more money. People who hold assets valued in their home currency, such as cash or bonds, may not like inflation, as it erodes the real value of their holdings. As such, investors looking to protect their portfolios from inflation should consider inflation-hedged asset classes, such as gold, commodities, and real estate investment trusts (REITs). Inflation-indexed bonds are another popular option for investors to profit from inflation . High and variable rates of inflation can impose major costs on an economy. Businesses, workers, and consumers must all account for the effects of generally rising prices in their buying, selling, and planning decisions. This introduces an additional source of uncertainty into the economy, because they may guess wrong about the rate of future inflation. Time and resources expended on researching, estimating, and adjusting economic behavior are expected to rise to the general level of prices. That’s opposed to real economic fundamentals, which inevitably represent a cost to the economy as a whole. Even a low, stable, and easily predictable rate of inflation, which some consider otherwise optimal, may lead to serious problems in the economy. That’s because of how, where, and when the new money enters the economy. Whenever new money and credit enter the economy, it is always in the hands of specific individuals or business firms. The process of price level adjustments to the new money supply proceeds as they then spend the new money and it circulates from hand to hand and account to account through the economy. Inflation does drive up some prices first and drives up other prices later. This sequential change in purchasing power and prices (known as the Cantillon effect) means that the process of inflation not only increases the general price level over time but also distorts relative prices , wages, and rates of return along the way. 11 Economists, in general, understand that distortions of relative prices away from their economic equilibrium are not good for the economy, and Austrian economists even believe this process to be a major driver of cycles of recession in the economy. 12 Pros Leads to higher resale value of assets Optimum levels of inflation encourage spending Cons Buyers have to pay more for products and services Imposes higher prices on the economy Drives some prices up first and others later How Inflation Can Be Controlled A country’s financial regulator shoulders the important responsibility of keeping inflation in check. It is done by implementing measures through monetary policy , which refers to the actions of a central bank or other committees that determine the size and rate of growth of the money supply. In the U.S., the Fed’s monetary policy goals include moderate long-term interest rates, price stability, and maximum employment. Each of these goals is intended to promote a stable financial environment. The Federal Reserve clearly communicates long-term inflation goals in order to keep a steady long-term rate of inflation , which is thought to be beneficial to the economy. Price stability or a relatively constant level of inflation allows businesses to plan for the future since they know what to expect. The Fed believes that this will promote maximum employment, which is determined by non-monetary factors that fluctuate over time and are therefore subject to change. For this reason, the Fed doesn’t set a specific goal for maximum employment, and it is largely determined by employers’ assessments. Maximum employment does not mean zero unemployment, as at any given time there is a certain level of volatility as people vacate and start new jobs. 13 14 Hyperinflation is often described as a period of inflation of 50% or more per month. 15 Monetary authorities also take exceptional measures in extreme conditions of the economy. For instance, following the 2008 financial crisis, the U.S. Fed kept the interest rates near zero and pursued a bond-buying program called quantitative easing (QE) . 16 Some critics of the program alleged it would cause a spike in inflation in the U.S. dollar, but inflation peaked in 2007 and declined steadily over the next eight years. There are many complex reasons why QE didn’t lead to inflation or hyperinflation , though the simplest explanation is that the recession itself was a very prominent deflationary environment, and quantitative easing supported its effects. 17 18 Consequently, U.S. policymakers have attempted to keep inflation steady at around 2% per year. The European Central Bank (ECB) has also pursued aggressive quantitative easing to counter deflation in the eurozone, and some places have experienced negative interest rates . That’s due to fears that deflation could take hold in the eurozone and lead to economic stagnation. 19 20 Moreover, countries that experience higher rates of growth can absorb higher rates of inflation. India’s target is around 4% (with an upper tolerance of 6% and a lower tolerance of 2%), while Brazil aims for 3.25% (with an upper tolerance of 4.75% and a lower tolerance of 1.75%). 21 22 Meaning of Inflation, Deflation, and Disinflation While a high inflation rate means that prices are increasing, a low inflation rate does not mean that prices are falling. Counterintuitively, when the inflation rate falls, prices are still increasing, but at a slower rate than before. When the inflation rate falls (but remains positive), this is known as disinflation . Conversely, if the inflation rate becomes negative, that means that prices are falling. This is known as deflation , which can have negative effects on an economy. Because buying power increases over time, consumers have less incentive to spend money in the short term, resulting in falling economic activity. Hedging Against Inflation Stocks are considered to be the best hedge against inflation , as the rise in stock prices is inclusive of the effects of inflation. Since additions to the money supply in virtually all modern economies occur as bank credit injections through the financial system, much of the immediate effect on prices happens in financial assets that are priced in their home currency, such as stocks. Special financial instruments exist that one can use to safeguard investments against inflation. They include Treasury Inflation-Protected Securities (TIPS) , a low-risk treasury security that is indexed to inflation where the principal amount invested is increased by the percentage of inflation. 23 One can also opt for a TIPS mutual fund or TIPS-based exchange-traded fund (ETF) . To get access to stocks, ETFs, and other funds that can help avoid the dangers of inflation, you’ll likely need a brokerage account. Choosing a stockbroker can be a tedious process due to the variety among them. Gold is also considered to be a hedge against inflation, although this doesn’t always appear to be the case looking backward. Examples of Inflation Since all world currencies are fiat money , the money supply could increase rapidly for political reasons, resulting in rapid price level increases. The most famous example is the hyperinflation that struck the German Weimar Republic in the early 1920s. The nations that were victorious in World War I demanded reparations from Germany, which could not be paid in German paper currency, as this was of suspect value due to government borrowing. Germany attempted to print paper notes, buy foreign currency with them, and use that to pay their debts. This policy led to the rapid devaluation of the German mark along with the hyperinflation that accompanied the development. German consumers responded to the cycle by trying to spend their money as fast as possible, understanding that it would be worth less and less the longer they waited. More money flooded the economy, and its value plummeted to the point where people would paper their walls with practically worthless bills. Similar situations occurred in Peru in 1990 and in Zimbabwe between 2007 and 2008. 24 25 26 What Causes Inflation? There are three main causes of inflation: demand-pull inflation, cost-push inflation, and built-in inflation. Demand-pull inflation refers to situations where there are not enough products or services being produced to keep up with demand, causing their prices to increase. Cost-push inflation, on the other hand, occurs when the cost of producing products and services rises, forcing businesses to raise their prices. Built-in inflation (which is sometimes referred to as a wage-price spiral) occurs when workers demand higher wages to keep up with rising living costs. This, in turn, causes businesses to raise their prices in order to offset their rising wage costs, leading to a self-reinforcing loop of wage and price increases. Is Inflation Good or Bad? Too much inflation is generally considered bad for an economy, while too little inflation is also considered harmful. Many economists advocate for a middle ground of low to moderate inflation, of around 2% per year. Generally speaking, higher inflation harms savers because it erodes the purchasing power of the money they have saved; however, it can benefit borrowers because the inflation-adjusted value of their outstanding debts shrinks over time. What Are the Effects of Inflation? Inflation can affect the economy in several ways. For example, if inflation causes a nation’s currency to decline, this can benefit exporters by making their goods more affordable when priced in the currency of foreign nations. On the other hand, this could harm importers by making foreign-made goods more expensive. Higher inflation can also encourage spending, as consumers will aim to purchase goods quickly before their prices rise further. Savers, on the other hand, could see the real value of their savings erode, limiting their ability to spend or invest in the future. Why Was Inflation So High in 2024? Inflation has remained elevated since 2022 when inflation rates around the world rose to their highest levels since the early 1980s. While there is no single reason for this rapid rise in global prices, a series of events worked together to boost inflation to such high levels. 27 28 The COVID-19 pandemic led to lockdowns and other restrictions that greatly disrupted global supply chains, from factory closures to bottlenecks at maritime ports. Governments also issued stimulus checks and increased unemployment benefits to counter the financial impact on individuals and small businesses. When vaccines became widespread and the economy bounced back, demand (fueled in part by stimulus money and low interest rates) quickly outpaced supply, which struggled to get back to pre-COVID levels. Russia’s unprovoked invasion of Ukraine in early 2022 led to economic sanctions and trade restrictions on Russia, limiting the world’s supply of oil and gas since Russia is a large producer of fossil fuels. Food prices also rose as Ukraine’s large grain harvests could not be exported. As fuel and food prices rose, it led to similar increases down the value chains. The Fed raised interest rates to combat the high inflation, which significantly came down in 2023, though it remains above pre-pandemic levels . 29 9 The Bottom Line Inflation is a rise in prices, which results in the decline of purchasing power over time. Inflation is natural and the U.S. government targets an annual inflation rate of 2%; however, inflation can be dangerous when it increases too much, too fast. Inflation makes items more expensive, especially if wages do not rise by the same levels of inflation. Additionally, inflation erodes the value of some assets, especially cash. Governments and central banks seek to control inflation through monetary policy. Article Sources Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. U.S. Bureau of Labor Statistics. “ Consumer Price Index .” Edo, Anthony, and Melitz, Jacques. “ The Primary Cause of European Inflation in 1500–1700: Precious Metals or Population? The English Evidence .” CEPII Working Paper, October 2019, pp. 13-14. Download PDF. U.S. Bureau of Labor Statistics. “ Consumer Price Index .” U.S. Bureau of Labor Statistics. “ Chapter 17. The Consumer Price Index (Updated 2-14-2018) ,” Page 2. U.S. Bureau of Labor Statistics. “ Consumer Price Index Chronology .” U.S. Bureau of Labor Statistics. “ Producer Price Index Frequently Asked Questions (FAQs) ,” select “4. How does the Producer Price Index differ from the Consumer Price Index?” U.S. Bureau of Labor Statistics. “ Producer Price Index Frequently Asked Questions (FAQs) ,” select “3. When did the Wholesale Price Index become the Producer Price Index?” U.S. Bureau of Labor Statistics. “ Producer Price Indexes .” U.S. Bureau of Labor Statistics. “ Consumer Price Index Historical Tables for U.S. City Average .” U.S. Bureau of Labor Statistics. “ Historical CPI-U ,” Page 3. Adam Smith Institute. “ The Cantillion Effect .” Foundation for Economic Education. “ The Current Economic Crisis and the Austrian Theory of the Business Cycle .” Board of Governors of the Federal Reserve System. “ Review of Monetary Policy Strategy, Tools, and Communication .” Board of Governors of the Federal Reserve System. “ What Is the Lowest Level of Unemployment That the U.S. Economy Can Sustain? ” Fischer, Stanley et al. “ Modern Hyper- and High Inflations .” Journal of Economic Literature , vol. 40, no. 3, September 2002, pp. 837. Federal Reserve History. “ The Great Recession and Its Aftermath .” Federal Reserve Bank of New York. “ Liberty Street Economics: Ten Years Later—Did QE Work? ” Congressional Budget Office. “ How the Federal Reserve’s Quantitative Easing Affects the Federal Budget .” Board of Governors of the Federal Reserve System. “ FAQs: Why Does the Federal Reserve Aim for Inflation of 2 Percent Over the Longer Run? ” European Central Bank. “ How Quantitative Easing Works .” Reserve Bank of India. “ Monetary Policy ,” select “The Monetary Policy Framework.” Central Bank of Brazil. “ Inflation Targeting Track Record .” TreasuryDirect. “ Treasury Inflation-Protected Securities (TIPS) .” University of Illinois, Urbana-Champaign. “ 1920s Hyperinflation in Germany and Bank Notes .” Rossini, Renzo (Editors Alejandro M. Werner and Alejandro Santos). “ Staying the Course of Economic Success: Chapter 2. Peru’s Recent Economic History: From Stagnation, Disarray, and Mismanagement to Growth, Stability, and Quality Policies .” International Monetary Fund eLibrary, September 2015. Kramarenko, Vitaliy et al. “ Zimbabwe: Challenges and Policy Options After Hyperinflation .” International Monetary Fund , June 2010, no. 6. The World Bank, World Bank Open Data. “ Inflation, Consumer Prices (Annual %) .” Federal Reserve Economic Data (FRED), Federal Reserve Bank of St. Louis. “ Consumer Price Index for All Urban Consumers: All Items in U.S. City Average .” Board of Governors of the Federal Reserve System. “ Open Market Operations .” Part of the Series Inflation Inflation: What It Is and How to Control Inflation Rates CURRENT ARTICLE Understanding Inflation 9 Common Effects of Inflation How to Profit From Inflation When Is Inflation Good for the Economy? How Does Current Cost of Living Compare to 20 Years Ago? Why Are P/E Ratios Higher When Inflation Is Low? What Causes Inflation and Who Profits From It? Types of Inflation Understand the Different Types of Inflation Wage Push Inflation Cost-Push Inflation Cost-Push Inflation vs. Demand-Pull Inflation: What's the Difference? Inflation vs. Stagflation: What's the difference? What Does Inflation Impact? What is the Relationship Between Inflation and Interest Rates? Inflation's Impact on Stock Returns How Does Inflation Affect Fixed-Income Investments? How Inflation Affects Your Cost of Living How Inflation Impacts Your Savings How Inflation Eats Away at Your Retirement Income What Impact Does Inflation Have on the Dollar Value Today? Inflation and Economic Recovery Understanding Hyperinflation Hyperinflation Why Didn't Quantitative Easing Lead to Hyperinflation? Worst Cases of Hyperinflation in History How the Great Inflation of the 1970s Happened Stagflation Understanding CPI Purchasing Power Consumer Price Index (CPI) Why Is the Consumer Price Index Controversial? Core Inflation Headline Inflation Related Terms (A-I) GDP Price Deflator Indexation Inflation Accounting Inflation-Adjusted Return Inflation Targeting Related Terms (J-Z) Real Economic Growth Rate Real Gross Domestic Product (GDP) Real Income Real Interest Rate Real Rate of Return Wage-Price Spiral Read more Economy Economics Article Sources Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. U.S. Bureau of Labor Statistics. “ Consumer Price Index .” Edo, Anthony, and Melitz, Jacques. “ The Primary Cause of European Inflation in 1500–1700: Precious Metals or Population? The English Evidence .” CEPII Working Paper, October 2019, pp. 13-14. Download PDF. U.S. Bureau of Labor Statistics. “ Consumer Price Index .” U.S. Bureau of Labor Statistics. “ Chapter 17. The Consumer Price Index (Updated 2-14-2018) ,” Page 2. U.S. Bureau of Labor Statistics. “ Consumer Price Index Chronology .” U.S. Bureau of Labor Statistics. “ Producer Price Index Frequently Asked Questions (FAQs) ,” select “4. How does the Producer Price Index differ from the Consumer Price Index?” U.S. Bureau of Labor Statistics. “ Producer Price Index Frequently Asked Questions (FAQs) ,” select “3. When did the Wholesale Price Index become the Producer Price Index?” U.S. Bureau of Labor Statistics. “ Producer Price Indexes .” U.S. Bureau of Labor Statistics. “ Consumer Price Index Historical Tables for U.S. City Average .” U.S. Bureau of Labor Statistics. “ Historical CPI-U ,” Page 3. Adam Smith Institute. “ The Cantillion Effect .” Foundation for Economic Education. “ The Current Economic Crisis and the Austrian Theory of the Business Cycle .” Board of Governors of the Federal Reserve System. “ Review of Monetary Policy Strategy, Tools, and Communication .” Board of Governors of the Federal Reserve System. “ What Is the Lowest Level of Unemployment That the U.S. Economy Can Sustain? ” Fischer, Stanley et al. “ Modern Hyper- and High Inflations .” Journal of Economic Literature , vol. 40, no. 3, September 2002, pp. 837. Federal Reserve History. “ The Great Recession and Its Aftermath .” Federal Reserve Bank of New York. “ Liberty Street Economics: Ten Years Later—Did QE Work? ” Congressional Budget Office. “ How the Federal Reserve’s Quantitative Easing Affects the Federal Budget .” Board of Governors of the Federal Reserve System. “ FAQs: Why Does the Federal Reserve Aim for Inflation of 2 Percent Over the Longer Run? ” European Central Bank. “ How Quantitative Easing Works .” Reserve Bank of India. “ Monetary Policy ,” select “The Monetary Policy Framework.” Central Bank of Brazil. “ Inflation Targeting Track Record .” TreasuryDirect. “ Treasury Inflation-Protected Securities (TIPS) .” University of Illinois, Urbana-Champaign. “ 1920s Hyperinflation in Germany and Bank Notes .” Rossini, Renzo (Editors Alejandro M. Werner and Alejandro Santos). “ Staying the Course of Economic Success: Chapter 2. Peru’s Recent Economic History: From Stagnation, Disarray, and Mismanagement to Growth, Stability, and Quality Policies .” International Monetary Fund eLibrary, September 2015. Kramarenko, Vitaliy et al. “ Zimbabwe: Challenges and Policy Options After Hyperinflation .” International Monetary Fund , June 2010, no. 6. The World Bank, World Bank Open Data. “ Inflation, Consumer Prices (Annual %) .” Federal Reserve Economic Data (FRED), Federal Reserve Bank of St. Louis. “ Consumer Price Index for All Urban Consumers: All Items in U.S. City Average .” Board of Governors of the Federal Reserve System. “ Open Market Operations .” Article Sources Article Sources    Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. U.S. Bureau of Labor Statistics. “ Consumer Price Index .” Edo, Anthony, and Melitz, Jacques. “ The Primary Cause of European Inflation in 1500–1700: Precious Metals or Population? The English Evidence .” CEPII Working Paper, October 2019, pp. 13-14. Download PDF. U.S. Bureau of Labor Statistics. “ Consumer Price Index .” U.S. Bureau of Labor Statistics. “ Chapter 17. The Consumer Price Index (Updated 2-14-2018) ,” Page 2. U.S. Bureau of Labor Statistics. “ Consumer Price Index Chronology .” U.S. Bureau of Labor Statistics. “ Producer Price Index Frequently Asked Questions (FAQs) ,” select “4. How does the Producer Price Index differ from the Consumer Price Index?” U.S. Bureau of Labor Statistics. “ Producer Price Index Frequently Asked Questions (FAQs) ,” select “3. When did the Wholesale Price Index become the Producer Price Index?” U.S. Bureau of Labor Statistics. “ Producer Price Indexes .” U.S. Bureau of Labor Statistics. “ Consumer Price Index Historical Tables for U.S. City Average .” U.S. Bureau of Labor Statistics. “ Historical CPI-U ,” Page 3. Adam Smith Institute. “ The Cantillion Effect .” Foundation for Economic Education. “ The Current Economic Crisis and the Austrian Theory of the Business Cycle .” Board of Governors of the Federal Reserve System. “ Review of Monetary Policy Strategy, Tools, and Communication .” Board of Governors of the Federal Reserve System. “ What Is the Lowest Level of Unemployment That the U.S. Economy Can Sustain? ” Fischer, Stanley et al. “ Modern Hyper- and High Inflations .” Journal of Economic Literature , vol. 40, no. 3, September 2002, pp. 837. Federal Reserve History. “ The Great Recession and Its Aftermath .” Federal Reserve Bank of New York. “ Liberty Street Economics: Ten Years Later—Did QE Work? ” Congressional Budget Office. “ How the Federal Reserve’s Quantitative Easing Affects the Federal Budget .” Board of Governors of the Federal Reserve System. “ FAQs: Why Does the Federal Reserve Aim for Inflation of 2 Percent Over the Longer Run? ” European Central Bank. “ How Quantitative Easing Works .” Reserve Bank of India. “ Monetary Policy ,” select “The Monetary Policy Framework.” Central Bank of Brazil. “ Inflation Targeting Track Record .” TreasuryDirect. “ Treasury Inflation-Protected Securities (TIPS) .” University of Illinois, Urbana-Champaign. “ 1920s Hyperinflation in Germany and Bank Notes .” Rossini, Renzo (Editors Alejandro M. Werner and Alejandro Santos). “ Staying the Course of Economic Success: Chapter 2. Peru’s Recent Economic History: From Stagnation, Disarray, and Mismanagement to Growth, Stability, and Quality Policies .” International Monetary Fund eLibrary, September 2015. Kramarenko, Vitaliy et al. “ Zimbabwe: Challenges and Policy Options After Hyperinflation .” International Monetary Fund , June 2010, no. 6. The World Bank, World Bank Open Data. “ Inflation, Consumer Prices (Annual %) .” Federal Reserve Economic Data (FRED), Federal Reserve Bank of St. Louis. “ Consumer Price Index for All Urban Consumers: All Items in U.S. City Average .” Board of Governors of the Federal Reserve System. “ Open Market Operations .” CURRENT ARTICLE ",
  "matched_keywords": [
    "stocks",
    "ETF",
    "interest rates",
    "inflation",
    "NSE",
    "portfolio",
    "investment",
    "banking",
    "monetary policy",
    "GDP",
    "economic growth",
    "bonds",
    "debt",
    "commodities",
    "crypto"
  ],
  "embedding": [
    -0.031629033386707306,
    -0.03327758610248566,
    -0.10730945318937302,
    0.06761723011732101,
    -0.023218415677547455,
    0.002287875860929489,
    0.015560462139546871,
    -0.006554697640240192,
    0.043828003108501434,
    0.04371974617242813,
    -0.0048196627758443356,
    -0.015858985483646393,
    -0.062231287360191345,
    0.030406149104237556,
    0.005906072445213795,
    0.0003565444203559309,
    -0.05541311204433441,
    -0.05748184770345688,
    -0.0753268301486969,
    0.015269135124981403,
    0.045829325914382935,
    -0.024289345368742943,
    -0.07025577127933502,
    0.012214488349854946,
    -0.017422854900360107,
    0.006486278958618641,
    -0.01371249370276928,
    0.00909054558724165,
    -0.06516251713037491,
    -0.021736394613981247,
    -0.014672491699457169,
    0.06888372451066971,
    -0.0013770123478025198,
    -0.04149734601378441,
    0.04543242231011391,
    0.026914546266198158,
    0.046685103327035904,
    0.08659329265356064,
    0.024491315707564354,
    -0.0006512341788038611,
    -0.036769524216651917,
    -0.11152323335409164,
    0.01533424761146307,
    -0.02479155920445919,
    0.025389842689037323,
    -0.015590814873576164,
    0.03731188923120499,
    0.08099537342786789,
    -0.009106634184718132,
    0.0454641617834568,
    -0.04648521915078163,
    -0.04657362028956413,
    0.03822781890630722,
    -0.05805179104208946,
    -0.014103916473686695,
    0.07139000296592712,
    0.013049911707639694,
    -0.038482919335365295,
    -0.004086968023329973,
    -0.12859812378883362,
    -0.08764652162790298,
    0.04156168922781944,
    -0.10032067447900772,
    0.023074056953191757,
    0.005929248407483101,
    0.037503719329833984,
    0.004728053696453571,
    0.016150444746017456,
    -0.050911515951156616,
    0.017414899542927742,
    0.045840900391340256,
    -0.02669723704457283,
    0.014263221994042397,
    -0.03570383042097092,
    0.0373750701546669,
    0.0055806986056268215,
    0.001541829900816083,
    -0.029302537441253662,
    0.054493799805641174,
    0.03445340692996979,
    0.12280029058456421,
    -0.013454006984829903,
    0.0020457215141505003,
    -0.08750564604997635,
    -0.06347371637821198,
    -0.08310862630605698,
    0.10967421531677246,
    -0.06052883714437485,
    0.0017688024090602994,
    0.09997211396694183,
    0.07472564280033112,
    0.04132075607776642,
    0.039206068962812424,
    -0.012122036889195442,
    0.04218893498182297,
    0.05846886336803436,
    -0.0198791716247797,
    -0.010497377254068851,
    -0.028741350397467613,
    0.04086174815893173,
    0.07312513142824173,
    -0.037810057401657104,
    0.06297876685857773,
    0.044012054800987244,
    -0.008727344684302807,
    -0.10494354367256165,
    0.003914185333997011,
    0.04039859399199486,
    -0.012166217900812626,
    -0.05040402337908745,
    -0.03494446724653244,
    0.0191987082362175,
    -0.013588589616119862,
    -0.06766152381896973,
    -0.03451565280556679,
    0.0007713279337622225,
    0.002473006024956703,
    0.0075418525375425816,
    0.03643534332513809,
    0.042349666357040405,
    0.059002697467803955,
    0.04580783098936081,
    -0.003035620553418994,
    0.07409024983644485,
    -0.010836084373295307,
    -0.025530096143484116,
    -0.07029909640550613,
    9.225907085363064e-33,
    -0.015125192701816559,
    0.04442514479160309,
    0.03155776113271713,
    -0.012729081325232983,
    -0.020941978320479393,
    0.031429123133420944,
    -0.002357655903324485,
    0.026427246630191803,
    -0.006971874739974737,
    -0.025614997372031212,
    0.07579188048839569,
    0.09685993939638138,
    -0.029776476323604584,
    0.02783374860882759,
    -0.040367186069488525,
    -0.04576549679040909,
    -0.04788272827863693,
    0.01899269036948681,
    0.08407295495271683,
    -0.04106486961245537,
    0.021528244018554688,
    -0.03552604094147682,
    -0.011083954013884068,
    -0.05903889611363411,
    -0.028424447402358055,
    0.06124794855713844,
    0.01607382670044899,
    -0.056755319237709045,
    0.04630829393863678,
    0.03943125903606415,
    0.02345610037446022,
    0.07428412139415741,
    0.023346930742263794,
    -0.060778915882110596,
    -0.0872887447476387,
    0.003724099136888981,
    -0.006223966833204031,
    -0.05617868900299072,
    0.003040830371901393,
    -0.027157621458172798,
    -0.050224073231220245,
    0.021091770380735397,
    -0.022499974817037582,
    0.015576101839542389,
    -0.06876422464847565,
    0.02653239481151104,
    0.09282158315181732,
    -0.03447986766695976,
    -0.005177828948944807,
    -0.05765269324183464,
    0.054020244628190994,
    -0.0543317012488842,
    -0.06894263625144958,
    -0.0095134312286973,
    0.04347022995352745,
    -0.03836853802204132,
    -0.07028874009847641,
    -0.06775183975696564,
    -0.04679456725716591,
    -0.03242161124944687,
    0.059369783848524094,
    -0.00727024907246232,
    -0.03978099301457405,
    0.06045995280146599,
    -0.10975486040115356,
    -0.010443322360515594,
    0.0007006935775279999,
    0.024452190846204758,
    -0.02847062423825264,
    0.03290536254644394,
    -0.04246553033590317,
    -0.0242617167532444,
    0.027012469246983528,
    0.01751217059791088,
    -0.005523969419300556,
    0.014175225980579853,
    0.04592290148139,
    0.05351097136735916,
    -0.07278028875589371,
    -0.06129611283540726,
    -0.08300167322158813,
    0.016300413757562637,
    0.15285298228263855,
    -0.04478289186954498,
    0.009505079127848148,
    -0.031345296651124954,
    -0.022131461650133133,
    0.06997773051261902,
    0.09571514278650284,
    -0.052932463586330414,
    -0.02862217091023922,
    -0.03663728013634682,
    0.03226792439818382,
    -0.016196323558688164,
    0.0500556118786335,
    -9.817329884672435e-33,
    -0.033341556787490845,
    -0.025426367297768593,
    -0.013511315919458866,
    0.06364016234874725,
    0.023161103948950768,
    -0.010616385377943516,
    -0.06529618799686432,
    -0.07659002393484116,
    0.12669971585273743,
    -0.14978447556495667,
    -0.08589073270559311,
    0.037370629608631134,
    -0.04347579926252365,
    -0.0024087911006063223,
    -0.04628900811076164,
    -0.05569341778755188,
    0.009806754067540169,
    -0.1095566377043724,
    -0.027926122769713402,
    -0.048393163830041885,
    -0.09817180037498474,
    -0.022573497146368027,
    -0.07223637402057648,
    0.02236802689731121,
    -0.049200721085071564,
    -0.045870810747146606,
    -0.019403798505663872,
    0.02621987648308277,
    0.0642375722527504,
    0.13555465638637543,
    -0.029837340116500854,
    0.05038139969110489,
    0.0679706484079361,
    0.02344946749508381,
    -0.06675183027982712,
    0.027012251317501068,
    0.004192962311208248,
    -0.05968110263347626,
    -0.04731982573866844,
    0.04880674555897713,
    0.049940142780542374,
    0.014913571067154408,
    -0.03865889087319374,
    -0.13865888118743896,
    0.05435783788561821,
    0.012165297754108906,
    0.04105157405138016,
    -0.059987571090459824,
    0.07601217180490494,
    -0.03279239684343338,
    0.05582480505108833,
    0.0045196316204965115,
    -0.07462038099765778,
    0.0451921671628952,
    -0.09435327351093292,
    0.005907077807933092,
    0.06342905014753342,
    -0.03606316074728966,
    0.020136281847953796,
    -0.016211234033107758,
    -0.053699515759944916,
    0.049227964133024216,
    0.024003561586141586,
    0.004666229709982872,
    0.023180516436696053,
    -0.05212610960006714,
    0.052858516573905945,
    -0.06588483601808548,
    0.0692187249660492,
    -0.026694340631365776,
    0.03238314762711525,
    -0.09754695743322372,
    -0.02814810909330845,
    0.029687954112887383,
    -0.008578753098845482,
    0.13418085873126984,
    0.023541545495390892,
    0.01678045094013214,
    0.05227545648813248,
    0.015996776521205902,
    0.04082849621772766,
    0.02715240605175495,
    -0.011088025756180286,
    0.0136124137789011,
    -0.05929870530962944,
    0.0238373801112175,
    0.03638685122132301,
    -0.03347800299525261,
    -0.09086412936449051,
    0.009783304296433926,
    -0.07073180377483368,
    -0.05641648545861244,
    0.024061759933829308,
    -0.020547544583678246,
    -0.004672389477491379,
    -6.531998764103264e-08,
    0.005405717063695192,
    -0.03053261525928974,
    -0.010262242518365383,
    0.06404286623001099,
    -0.027834570035338402,
    0.05552494898438454,
    0.11257434636354446,
    0.02290327101945877,
    0.05501360818743706,
    0.015530601143836975,
    0.06279828399419785,
    -0.005887472070753574,
    0.03426946699619293,
    -0.07274569571018219,
    0.02952287346124649,
    0.03178220987319946,
    -0.08098066598176956,
    0.0425136499106884,
    -0.03502269834280014,
    -0.012059325352311134,
    0.012427907437086105,
    0.09989891946315765,
    -0.024817490950226784,
    -0.0719119980931282,
    0.06140023097395897,
    -0.035912152379751205,
    0.050101086497306824,
    0.10890967398881912,
    -0.007743941154330969,
    0.02424059808254242,
    -0.06289567798376083,
    0.009633701294660568,
    -0.010969816707074642,
    -0.03251046687364578,
    0.05835229903459549,
    0.035702433437108994,
    0.07879109680652618,
    -0.003059639595448971,
    0.062331728637218475,
    0.06423657387495041,
    0.00708395941182971,
    -0.03778717666864395,
    -0.1293322890996933,
    -0.06553953886032104,
    -0.007763943634927273,
    -0.005978414788842201,
    -0.0590781643986702,
    0.021356215700507164,
    -0.05060863867402077,
    0.034635186195373535,
    0.05221046134829521,
    0.05813722684979439,
    0.06875061988830566,
    0.06182129681110382,
    0.07001672685146332,
    0.01918892189860344,
    -0.06093475595116615,
    0.047129809856414795,
    -0.08235161751508713,
    0.009297741577029228,
    0.053600188344717026,
    -0.004531810991466045,
    0.00577973760664463,
    0.05939798057079315
  ]
}