{
  "url": "https://www.investopedia.com/terms/s/stock.asp",
  "title": "Stocks: What They Are, Main Types, How They Differ From Bonds",
  "text": "Table of Contents Expand Table of Contents What Are Stocks? Understanding Stocks Stockholders & Equity Ownership Comparing Common & Preferred Stock Stocks vs. Bonds FAQs The Bottom Line Stocks: What They Are, Main Types, How They Differ From Bonds By Adam Hayes Full Bio Adam Hayes, Ph.D., CFA, is a financial writer with 15+ years Wall Street experience as a derivatives trader. Besides his extensive derivative trading expertise, Adam is an expert in economics and behavioral finance. Adam received his master's in economics from The New School for Social Research and his Ph.D. from the University of Wisconsin-Madison in sociology. He is a CFA charterholder as well as holding FINRA Series 7, 55 & 63 licenses. He currently researches and teaches economic sociology and the social studies of finance at the University of Lucerne in Switzerland.Adam's new book, \"Irrational Together: The Social Forces That Invisibly Shape Our Economic Behavior\" (University of Chicago Press) is a must-read at the intersection of behavioral economics and sociology that reshapes how we think about the social underpinnings of our financial choices. Learn about our editorial policies Updated May 11, 2025 Reviewed by Thomas J. Catalano Reviewed by Thomas J. Catalano Full Bio Thomas J Catalano is a CFP and Registered Investment Adviser with the state of South Carolina, where he launched his own financial advisory firm in 2018. Thomas' experience gives him expertise in a variety of areas including investments, retirement, insurance, and financial planning. Learn about our Financial Review Board Fact checked by Melody Kazel Part of the Series Day Trading Introduction Day Trading: The Basics and How To Get Started Day Trading Basics Day Trader Definition Day Trading Rate of Return Day Trading Instruments Stock Definition CURRENT ARTICLE Options Trading Forex (FX) Trading Trading Platforms, Tools, Brokers Trading Platform Definition Choosing Day Trading Software Choosing an Online Broker Paper Day Trading Trading Order Types Market Order Definition Limit Order Definition Stop Order Definition Strategy & Analysis Beginner Day Trading Strategies Choosing Stocks for Day Trading 10 Rules For Successful Trading Short Selling Risk & Money Management Guide to Day Trading on Margin Market Risk Risk Management Techniques Risk/Reward Ratio Definition Day Trading Psychology Trading Psychology Definition Importance of Trading Psychology Nez Riaz / Investopedia By Adam Hayes Full Bio Adam Hayes, Ph.D., CFA, is a financial writer with 15+ years Wall Street experience as a derivatives trader. Besides his extensive derivative trading expertise, Adam is an expert in economics and behavioral finance. Adam received his master's in economics from The New School for Social Research and his Ph.D. from the University of Wisconsin-Madison in sociology. He is a CFA charterholder as well as holding FINRA Series 7, 55 & 63 licenses. He currently researches and teaches economic sociology and the social studies of finance at the University of Lucerne in Switzerland.Adam's new book, \"Irrational Together: The Social Forces That Invisibly Shape Our Economic Behavior\" (University of Chicago Press) is a must-read at the intersection of behavioral economics and sociology that reshapes how we think about the social underpinnings of our financial choices. Learn about our editorial policies Updated May 11, 2025 Reviewed by Thomas J. Catalano Reviewed by Thomas J. Catalano Full Bio Thomas J Catalano is a CFP and Registered Investment Adviser with the state of South Carolina, where he launched his own financial advisory firm in 2018. Thomas' experience gives him expertise in a variety of areas including investments, retirement, insurance, and financial planning. Learn about our Financial Review Board Fact checked by Melody Kazel CURRENT ARTICLE Close Definition A stock, also called an equity or a share, is an ownership stake in the corporation that issued it. What Are Stocks? A stock is a security that represents ownership of a fraction of the corporation that issued it. Units of stock are called shares and entitle the owner to a portion of the corporation’s profits equal to the number of shares owned. Stocks are bought and sold predominantly on public exchanges. The exchanges and the stocks that are listed on them are required to conform to government regulations meant to protect investors from fraudulent practices. Key Takeaways A stock is proof of ownership of a fractional percentage of the company that issued it. Corporations issue stock to raise money to operate or expand their businesses. There are two main types of stock: common and preferred. Historically, stocks outperform most other investments over the long run. 1 Understanding Stocks Corporations issue stock to raise funds to operate their businesses. The holder of stock, a shareholder, may have a claim to part of the company’s assets and earnings. A shareholder is considered an owner of the issuing company, determined by the number of shares an investor owns relative to the number of outstanding shares . If a company has 1,000 shares of stock outstanding and one person owns 100 shares, that person would own and have a claim to 10% of the company’s assets and earnings . 2 Stockholders do not own a corporation, but corporations are a special type of organization because the law treats them as legal persons. Corporations file taxes, can borrow, can own property, and can be sued. The idea that a corporation is a “person” means that the corporation owns its assets . A corporate office full of chairs and tables belongs to the corporation, and not to the shareholders. 3 Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Corporate property is legally separated from the property of shareholders, which limits the liability of both the corporation and the shareholder. If the corporation goes bankrupt, a judge may order all of its assets sold, but a shareholder’s assets are not at risk. The court cannot force you to sell your shares, although the value of your shares may have fallen. Likewise, if a major shareholder goes bankrupt, they cannot sell the company’s assets to pay their creditors . Shareholder A person, company, or institution that owns at least one share of a company’s stock What Is Shareholder Ownership? What shareholders own are shares issued by the corporation, and the corporation owns the assets held by a firm. If you own 33% of the shares of a company, it is incorrect to assert that you own one-third of that company. However, you do own one-third of the company’s shares. This is known as “separation of ownership and control.” Owning stock gives you the right to vote in shareholder meetings, receive dividends if and when they are distributed, and the right to sell your shares to somebody else. If you own a majority of shares, your voting power increases so that you can indirectly control the direction of a company by appointing its board of directors. 4 This becomes most apparent when one company buys another. The acquiring company buys all the outstanding shares. The board of directors is responsible for increasing the value of the corporation and often does so by hiring professional managers, or officers, such as the chief executive officer (CEO) . Ordinary shareholders do not manage the company. The importance of being a shareholder is that you are entitled to a portion of the company’s profits, which is the foundation of a stock’s value. The more shares you own, the larger the portion of the profits you get. Many stocks, however, do not pay out dividends and instead reinvest profits back into growing the company. These retained earnings , however, are still reflected in the value of a stock. Tip Read about Investopedia’s 10 Rules of Investing by picking up a copy of our special-issue print edition. How to Compare Common and Preferred Stock There are two main types of stock: common and preferred . Common stock usually entitles the owner to vote at shareholders’ meetings and to receive any dividends paid out by the corporation. Preferred stockholders generally do not have voting rights , though they have a higher claim on assets and earnings than common stockholders. For example, owners of preferred stock receive dividends before common shareholders and have priority if a company goes bankrupt and is liquidated. 2 Fast Fact The first common stock ever issued was by the Dutch East India Company in 1602. 5 Companies can issue new shares whenever there is a need to raise additional cash. This process dilutes the ownership and rights of existing shareholders (provided that they do not buy any of the new offerings). Corporations can also engage in stock buybacks, which benefit existing shareholders because they cause their shares to appreciate in value. What Is the Difference Between Stocks and Bonds? Stocks are issued by companies to raise capital to grow the business or undertake new projects. There are important distinctions between whether somebody buys shares directly from the company when it issues them in the primary market or from another shareholder in the secondary market . When the corporation issues shares, it does so in return for money. Bonds vary from stocks in several ways. Bondholders are creditors to the corporation and are entitled to interest as well as repayment of the principal invested. Also, creditors are given legal priority over other stakeholders in the event of a bankruptcy and will be made whole first if a company is forced to sell assets . Conversely, shareholders often receive nothing in the event of bankruptcy, implying that stocks are inherently riskier investments than bonds. 2 How Do You Buy Stock? Most often, stocks are bought and sold on stock exchanges , such as the Nasdaq or the New York Stock Exchange (NYSE). After a company goes public through an initial public offering (IPO), its stock becomes available for investors to buy and sell on an exchange. Typically, investors will use a brokerage account to purchase stock on the exchange, which will list the purchasing price (the bid) or the selling price (the offer). The price of the stock is influenced by supply and demand factors in the market, among other variables. How Can You Earn Income from Owning Stock? There are two ways to earn money by owning shares of stock: through dividends and capital appreciation. Dividends are cash distributions of company profits. If a company has 1,000 shares outstanding and declares a $5,000 dividend, then stockholders will get $5 for each share they own. 6 Capital appreciation is the increase in the share price itself. If you sell a share to someone for $10, and the stock is later worth $11, the shareholder has made $1. 6 Is It Risky to Own Stock? All investments have a degree of risk . Stocks, bonds, mutual funds, and exchange-traded funds (ETFs) can lose value if market conditions decline. When you invest, you make choices about what to do with your financial assets. Your investment value might rise or fall because of market conditions or corporate decisions, such as whether to expand into a new area of business or merge with another company. 7 Historically, stocks have outperformed most other investments over the long run. 1 The Bottom Line A stock represents fractional ownership of equity in an organization. It is different from a bond, which operates like a loan made by creditors to the company in return for periodic payments. A company issues stock to raise capital from investors for new projects or to expand its business operations. The type of stock , common or preferred, held by a shareholder determines the rights and benefits of ownership. Sponsored Trade on the Go. Anywhere, Anytime One of the world's largest crypto-asset exchanges is ready for you. Enjoy competitive fees and dedicated customer support while trading securely. You'll also have access to Binance tools that make it easier than ever to view your trade history, manage auto-investments, view price charts, and make conversions with zero fees. Make an account for free and join millions of traders and investors on the global crypto market. Close Definition A stock, also called an equity or a share, is an ownership stake in the corporation that issued it. What Are Stocks? A stock is a security that represents ownership of a fraction of the corporation that issued it. Units of stock are called shares and entitle the owner to a portion of the corporation’s profits equal to the number of shares owned. Stocks are bought and sold predominantly on public exchanges. The exchanges and the stocks that are listed on them are required to conform to government regulations meant to protect investors from fraudulent practices. Key Takeaways A stock is proof of ownership of a fractional percentage of the company that issued it. Corporations issue stock to raise money to operate or expand their businesses. There are two main types of stock: common and preferred. Historically, stocks outperform most other investments over the long run. 1 Understanding Stocks Corporations issue stock to raise funds to operate their businesses. The holder of stock, a shareholder, may have a claim to part of the company’s assets and earnings. A shareholder is considered an owner of the issuing company, determined by the number of shares an investor owns relative to the number of outstanding shares . If a company has 1,000 shares of stock outstanding and one person owns 100 shares, that person would own and have a claim to 10% of the company’s assets and earnings . 2 Stockholders do not own a corporation, but corporations are a special type of organization because the law treats them as legal persons. Corporations file taxes, can borrow, can own property, and can be sued. The idea that a corporation is a “person” means that the corporation owns its assets . A corporate office full of chairs and tables belongs to the corporation, and not to the shareholders. 3 Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Corporate property is legally separated from the property of shareholders, which limits the liability of both the corporation and the shareholder. If the corporation goes bankrupt, a judge may order all of its assets sold, but a shareholder’s assets are not at risk. The court cannot force you to sell your shares, although the value of your shares may have fallen. Likewise, if a major shareholder goes bankrupt, they cannot sell the company’s assets to pay their creditors . Shareholder A person, company, or institution that owns at least one share of a company’s stock What Is Shareholder Ownership? What shareholders own are shares issued by the corporation, and the corporation owns the assets held by a firm. If you own 33% of the shares of a company, it is incorrect to assert that you own one-third of that company. However, you do own one-third of the company’s shares. This is known as “separation of ownership and control.” Owning stock gives you the right to vote in shareholder meetings, receive dividends if and when they are distributed, and the right to sell your shares to somebody else. If you own a majority of shares, your voting power increases so that you can indirectly control the direction of a company by appointing its board of directors. 4 This becomes most apparent when one company buys another. The acquiring company buys all the outstanding shares. The board of directors is responsible for increasing the value of the corporation and often does so by hiring professional managers, or officers, such as the chief executive officer (CEO) . Ordinary shareholders do not manage the company. The importance of being a shareholder is that you are entitled to a portion of the company’s profits, which is the foundation of a stock’s value. The more shares you own, the larger the portion of the profits you get. Many stocks, however, do not pay out dividends and instead reinvest profits back into growing the company. These retained earnings , however, are still reflected in the value of a stock. Tip Read about Investopedia’s 10 Rules of Investing by picking up a copy of our special-issue print edition. How to Compare Common and Preferred Stock There are two main types of stock: common and preferred . Common stock usually entitles the owner to vote at shareholders’ meetings and to receive any dividends paid out by the corporation. Preferred stockholders generally do not have voting rights , though they have a higher claim on assets and earnings than common stockholders. For example, owners of preferred stock receive dividends before common shareholders and have priority if a company goes bankrupt and is liquidated. 2 Fast Fact The first common stock ever issued was by the Dutch East India Company in 1602. 5 Companies can issue new shares whenever there is a need to raise additional cash. This process dilutes the ownership and rights of existing shareholders (provided that they do not buy any of the new offerings). Corporations can also engage in stock buybacks, which benefit existing shareholders because they cause their shares to appreciate in value. What Is the Difference Between Stocks and Bonds? Stocks are issued by companies to raise capital to grow the business or undertake new projects. There are important distinctions between whether somebody buys shares directly from the company when it issues them in the primary market or from another shareholder in the secondary market . When the corporation issues shares, it does so in return for money. Bonds vary from stocks in several ways. Bondholders are creditors to the corporation and are entitled to interest as well as repayment of the principal invested. Also, creditors are given legal priority over other stakeholders in the event of a bankruptcy and will be made whole first if a company is forced to sell assets . Conversely, shareholders often receive nothing in the event of bankruptcy, implying that stocks are inherently riskier investments than bonds. 2 How Do You Buy Stock? Most often, stocks are bought and sold on stock exchanges , such as the Nasdaq or the New York Stock Exchange (NYSE). After a company goes public through an initial public offering (IPO), its stock becomes available for investors to buy and sell on an exchange. Typically, investors will use a brokerage account to purchase stock on the exchange, which will list the purchasing price (the bid) or the selling price (the offer). The price of the stock is influenced by supply and demand factors in the market, among other variables. How Can You Earn Income from Owning Stock? There are two ways to earn money by owning shares of stock: through dividends and capital appreciation. Dividends are cash distributions of company profits. If a company has 1,000 shares outstanding and declares a $5,000 dividend, then stockholders will get $5 for each share they own. 6 Capital appreciation is the increase in the share price itself. If you sell a share to someone for $10, and the stock is later worth $11, the shareholder has made $1. 6 Is It Risky to Own Stock? All investments have a degree of risk . Stocks, bonds, mutual funds, and exchange-traded funds (ETFs) can lose value if market conditions decline. When you invest, you make choices about what to do with your financial assets. Your investment value might rise or fall because of market conditions or corporate decisions, such as whether to expand into a new area of business or merge with another company. 7 Historically, stocks have outperformed most other investments over the long run. 1 The Bottom Line A stock represents fractional ownership of equity in an organization. It is different from a bond, which operates like a loan made by creditors to the company in return for periodic payments. A company issues stock to raise capital from investors for new projects or to expand its business operations. The type of stock , common or preferred, held by a shareholder determines the rights and benefits of ownership. Sponsored Trade on the Go. Anywhere, Anytime One of the world's largest crypto-asset exchanges is ready for you. Enjoy competitive fees and dedicated customer support while trading securely. You'll also have access to Binance tools that make it easier than ever to view your trade history, manage auto-investments, view price charts, and make conversions with zero fees. Make an account for free and join millions of traders and investors on the global crypto market. What Are Stocks? A stock is a security that represents ownership of a fraction of the corporation that issued it. Units of stock are called shares and entitle the owner to a portion of the corporation’s profits equal to the number of shares owned. Stocks are bought and sold predominantly on public exchanges. The exchanges and the stocks that are listed on them are required to conform to government regulations meant to protect investors from fraudulent practices. Key Takeaways A stock is proof of ownership of a fractional percentage of the company that issued it. Corporations issue stock to raise money to operate or expand their businesses. There are two main types of stock: common and preferred. Historically, stocks outperform most other investments over the long run. 1 Understanding Stocks Corporations issue stock to raise funds to operate their businesses. The holder of stock, a shareholder, may have a claim to part of the company’s assets and earnings. A shareholder is considered an owner of the issuing company, determined by the number of shares an investor owns relative to the number of outstanding shares . If a company has 1,000 shares of stock outstanding and one person owns 100 shares, that person would own and have a claim to 10% of the company’s assets and earnings . 2 Stockholders do not own a corporation, but corporations are a special type of organization because the law treats them as legal persons. Corporations file taxes, can borrow, can own property, and can be sued. The idea that a corporation is a “person” means that the corporation owns its assets . A corporate office full of chairs and tables belongs to the corporation, and not to the shareholders. 3 Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Corporate property is legally separated from the property of shareholders, which limits the liability of both the corporation and the shareholder. If the corporation goes bankrupt, a judge may order all of its assets sold, but a shareholder’s assets are not at risk. The court cannot force you to sell your shares, although the value of your shares may have fallen. Likewise, if a major shareholder goes bankrupt, they cannot sell the company’s assets to pay their creditors . Shareholder A person, company, or institution that owns at least one share of a company’s stock What Is Shareholder Ownership? What shareholders own are shares issued by the corporation, and the corporation owns the assets held by a firm. If you own 33% of the shares of a company, it is incorrect to assert that you own one-third of that company. However, you do own one-third of the company’s shares. This is known as “separation of ownership and control.” Owning stock gives you the right to vote in shareholder meetings, receive dividends if and when they are distributed, and the right to sell your shares to somebody else. If you own a majority of shares, your voting power increases so that you can indirectly control the direction of a company by appointing its board of directors. 4 This becomes most apparent when one company buys another. The acquiring company buys all the outstanding shares. The board of directors is responsible for increasing the value of the corporation and often does so by hiring professional managers, or officers, such as the chief executive officer (CEO) . Ordinary shareholders do not manage the company. The importance of being a shareholder is that you are entitled to a portion of the company’s profits, which is the foundation of a stock’s value. The more shares you own, the larger the portion of the profits you get. Many stocks, however, do not pay out dividends and instead reinvest profits back into growing the company. These retained earnings , however, are still reflected in the value of a stock. Tip Read about Investopedia’s 10 Rules of Investing by picking up a copy of our special-issue print edition. How to Compare Common and Preferred Stock There are two main types of stock: common and preferred . Common stock usually entitles the owner to vote at shareholders’ meetings and to receive any dividends paid out by the corporation. Preferred stockholders generally do not have voting rights , though they have a higher claim on assets and earnings than common stockholders. For example, owners of preferred stock receive dividends before common shareholders and have priority if a company goes bankrupt and is liquidated. 2 Fast Fact The first common stock ever issued was by the Dutch East India Company in 1602. 5 Companies can issue new shares whenever there is a need to raise additional cash. This process dilutes the ownership and rights of existing shareholders (provided that they do not buy any of the new offerings). Corporations can also engage in stock buybacks, which benefit existing shareholders because they cause their shares to appreciate in value. What Is the Difference Between Stocks and Bonds? Stocks are issued by companies to raise capital to grow the business or undertake new projects. There are important distinctions between whether somebody buys shares directly from the company when it issues them in the primary market or from another shareholder in the secondary market . When the corporation issues shares, it does so in return for money. Bonds vary from stocks in several ways. Bondholders are creditors to the corporation and are entitled to interest as well as repayment of the principal invested. Also, creditors are given legal priority over other stakeholders in the event of a bankruptcy and will be made whole first if a company is forced to sell assets . Conversely, shareholders often receive nothing in the event of bankruptcy, implying that stocks are inherently riskier investments than bonds. 2 How Do You Buy Stock? Most often, stocks are bought and sold on stock exchanges , such as the Nasdaq or the New York Stock Exchange (NYSE). After a company goes public through an initial public offering (IPO), its stock becomes available for investors to buy and sell on an exchange. Typically, investors will use a brokerage account to purchase stock on the exchange, which will list the purchasing price (the bid) or the selling price (the offer). The price of the stock is influenced by supply and demand factors in the market, among other variables. How Can You Earn Income from Owning Stock? There are two ways to earn money by owning shares of stock: through dividends and capital appreciation. Dividends are cash distributions of company profits. If a company has 1,000 shares outstanding and declares a $5,000 dividend, then stockholders will get $5 for each share they own. 6 Capital appreciation is the increase in the share price itself. If you sell a share to someone for $10, and the stock is later worth $11, the shareholder has made $1. 6 Is It Risky to Own Stock? All investments have a degree of risk . Stocks, bonds, mutual funds, and exchange-traded funds (ETFs) can lose value if market conditions decline. When you invest, you make choices about what to do with your financial assets. Your investment value might rise or fall because of market conditions or corporate decisions, such as whether to expand into a new area of business or merge with another company. 7 Historically, stocks have outperformed most other investments over the long run. 1 The Bottom Line A stock represents fractional ownership of equity in an organization. It is different from a bond, which operates like a loan made by creditors to the company in return for periodic payments. A company issues stock to raise capital from investors for new projects or to expand its business operations. The type of stock , common or preferred, held by a shareholder determines the rights and benefits of ownership. Article Sources Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. New York University, Stern School of Business. “ Historical Returns on Stocks, Bonds and Bills: 1928–2023 .” Investor.gov, U.S. Securities and Exchange Commission. “ Stocks .” American Bar Association. “ Does ‘We the People’ Include Corporations? ” University of Pennsylvania, Carey Law School. “ Independent Directors and Controlling Shareholders .” European Central Bank. “ A ‘Domestic European Market’: Keynote Speech by Marc Bayle de Jessé, Director General Market Infrastructure and Payments, ECB, at the Central Bank Payments Conference, Amsterdam, 27 June 2017 .” Small Business Chron. “ How Does a Shareholder Make Money? ” Financial Industry Regulatory Authority. “ Risk .” Compare Accounts Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Part of the Series Day Trading Introduction Day Trading: The Basics and How To Get Started Day Trading Basics Day Trader Definition Day Trading Rate of Return Day Trading Instruments Stock Definition CURRENT ARTICLE Options Trading Forex (FX) Trading Trading Platforms, Tools, Brokers Trading Platform Definition Choosing Day Trading Software Choosing an Online Broker Paper Day Trading Trading Order Types Market Order Definition Limit Order Definition Stop Order Definition Strategy & Analysis Beginner Day Trading Strategies Choosing Stocks for Day Trading 10 Rules For Successful Trading Short Selling Risk & Money Management Guide to Day Trading on Margin Market Risk Risk Management Techniques Risk/Reward Ratio Definition Day Trading Psychology Trading Psychology Definition Importance of Trading Psychology Read more Trading Trading Skills Partner Links Article Sources Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. New York University, Stern School of Business. “ Historical Returns on Stocks, Bonds and Bills: 1928–2023 .” Investor.gov, U.S. Securities and Exchange Commission. “ Stocks .” American Bar Association. “ Does ‘We the People’ Include Corporations? ” University of Pennsylvania, Carey Law School. “ Independent Directors and Controlling Shareholders .” European Central Bank. “ A ‘Domestic European Market’: Keynote Speech by Marc Bayle de Jessé, Director General Market Infrastructure and Payments, ECB, at the Central Bank Payments Conference, Amsterdam, 27 June 2017 .” Small Business Chron. “ How Does a Shareholder Make Money? ” Financial Industry Regulatory Authority. “ Risk .” Article Sources Article Sources    Investopedia requires writers to use primary sources to support their work. These include white papers, government data, original reporting, and interviews with industry experts. We also reference original research from other reputable publishers where appropriate. You can learn more about the standards we follow in producing accurate, unbiased content in our editorial policy. New York University, Stern School of Business. “ Historical Returns on Stocks, Bonds and Bills: 1928–2023 .” Investor.gov, U.S. Securities and Exchange Commission. “ Stocks .” American Bar Association. “ Does ‘We the People’ Include Corporations? ” University of Pennsylvania, Carey Law School. “ Independent Directors and Controlling Shareholders .” European Central Bank. “ A ‘Domestic European Market’: Keynote Speech by Marc Bayle de Jessé, Director General Market Infrastructure and Payments, ECB, at the Central Bank Payments Conference, Amsterdam, 27 June 2017 .” Small Business Chron. “ How Does a Shareholder Make Money? ” Financial Industry Regulatory Authority. “ Risk .” CURRENT ARTICLE ",
  "matched_keywords": [
    "stocks",
    "equity",
    "mutual funds",
    "ETF",
    "NSE",
    "dividends",
    "investment",
    "bonds",
    "crypto"
  ],
  "embedding": [
    0.002862768480554223,
    -0.07577814161777496,
    -0.07349550724029541,
    0.02745446376502514,
    0.031904835253953934,
    0.02767631597816944,
    0.04376710206270218,
    0.01780463382601738,
    0.0356442891061306,
    0.012180672027170658,
    -0.056224554777145386,
    0.11356516182422638,
    -0.09266383945941925,
    -0.04464402794837952,
    -0.0495404414832592,
    -0.04803824797272682,
    -0.0026975919026881456,
    -0.044227175414562225,
    -0.004586405586451292,
    0.06136911362409592,
    -0.036377858370542526,
    -0.08341138809919357,
    0.07524579018354416,
    -0.07129930704832077,
    0.050610776990652084,
    0.02842431701719761,
    -0.01851210929453373,
    -0.04077081382274628,
    -0.004101332742720842,
    0.010443431325256824,
    0.05503745749592781,
    0.009060225449502468,
    0.048875924199819565,
    -0.010208040475845337,
    -0.00554643152281642,
    0.03412685915827751,
    0.07124053686857224,
    0.0632629320025444,
    0.06182318553328514,
    0.027058953419327736,
    0.02938644029200077,
    -0.02959870547056198,
    0.014216408133506775,
    0.0013448565732687712,
    0.04228147491812706,
    -0.04242449626326561,
    0.008234409615397453,
    -0.04823117330670357,
    0.023077664896845818,
    -0.03128676488995552,
    -0.0787263959646225,
    -0.033104728907346725,
    0.039620812982320786,
    -0.03721151128411293,
    0.016174012795090675,
    0.07422541081905365,
    0.020549211651086807,
    0.041614122688770294,
    -0.02318587526679039,
    0.01713215932250023,
    0.10063206404447556,
    -0.03158789128065109,
    -0.01993621699512005,
    0.03907075896859169,
    0.09279008954763412,
    0.030460726469755173,
    -0.020632794126868248,
    0.12159464508295059,
    -0.08584044128656387,
    0.011928592808544636,
    0.06048516929149628,
    0.011980793438851833,
    -0.05860404297709465,
    0.018682630732655525,
    0.04776875302195549,
    -0.05602262541651726,
    0.007858810015022755,
    0.06059534102678299,
    -0.007286743726581335,
    -0.06300961971282959,
    -0.0031168332789093256,
    -0.01820271834731102,
    0.0026885366532951593,
    -0.03932502120733261,
    -0.09371091425418854,
    0.0015755428466945887,
    -0.018289169296622276,
    -0.022473827004432678,
    0.05350462719798088,
    0.04657277092337608,
    -0.022516319528222084,
    0.0018989969976246357,
    0.0649520605802536,
    0.0036249232944101095,
    0.024739982560276985,
    0.06407070904970169,
    -0.02164999395608902,
    0.020943641662597656,
    -0.06090891361236572,
    0.05557053163647652,
    0.06857535988092422,
    0.04138639196753502,
    -0.03152596578001976,
    0.06646037846803665,
    -0.02795407362282276,
    -0.05076630041003227,
    -0.014694553799927235,
    0.008568945340812206,
    0.03190254047513008,
    0.033187463879585266,
    -0.06650654971599579,
    0.08363088965415955,
    -0.036716312170028687,
    0.0038628082256764174,
    0.023845044896006584,
    -0.0933886170387268,
    -0.007771018892526627,
    -0.008454116992652416,
    0.12781141698360443,
    0.04992414265871048,
    0.03867552429437637,
    0.07797545939683914,
    -0.0635148212313652,
    0.03049887903034687,
    0.01234281063079834,
    -0.014749831520020962,
    -0.12151101231575012,
    1.92691129849918e-33,
    -0.019133349880576134,
    0.0494856983423233,
    -0.0357949323952198,
    0.01183356437832117,
    -0.037241507321596146,
    0.04279359430074692,
    -0.04957400634884834,
    -0.006297219544649124,
    -0.07395925372838974,
    0.07673905789852142,
    -0.05288013815879822,
    0.09151681512594223,
    0.004148928448557854,
    0.01821139082312584,
    -0.0045539927668869495,
    -0.024143103510141373,
    -0.05977742746472359,
    -0.02787206508219242,
    0.09453970193862915,
    -0.04049825668334961,
    0.02584419958293438,
    0.025615831837058067,
    0.006731691304594278,
    -0.03309336677193642,
    0.014234558679163456,
    -0.10717307031154633,
    -0.04431310296058655,
    -0.0193219855427742,
    0.05168350040912628,
    0.010710897855460644,
    0.0007108960417099297,
    0.07565274834632874,
    -0.06471658498048782,
    -0.05988515168428421,
    0.0013840256724506617,
    0.006258419249206781,
    -0.01815912500023842,
    0.02800620160996914,
    -0.024965938180685043,
    -0.07199421525001526,
    -0.019617702811956406,
    0.047031059861183167,
    -0.006213851738721132,
    0.0009934507543221116,
    0.0046030557714402676,
    0.09795726835727692,
    0.05494261160492897,
    -0.0050887297838926315,
    0.04830795153975487,
    -0.06766948103904724,
    -0.07583446800708771,
    -0.02757958509027958,
    0.02643768861889839,
    -0.10732169449329376,
    -0.09229989349842072,
    -0.03276265040040016,
    -0.057986218482255936,
    -0.0607234388589859,
    -0.12064523994922638,
    -0.09968525171279907,
    0.03400686755776405,
    0.028635531663894653,
    -0.005805246997624636,
    -0.03452080488204956,
    -0.14073322713375092,
    0.14255142211914062,
    -0.07884626090526581,
    -0.010123890824615955,
    -0.013236450962722301,
    0.003510748967528343,
    -0.011755496263504028,
    0.02831244468688965,
    -0.06730685383081436,
    0.002705448539927602,
    0.001055425382219255,
    0.0216180682182312,
    -0.01850602589547634,
    0.00991996843367815,
    -0.02347339317202568,
    -0.003943529911339283,
    0.03447055071592331,
    -0.05878310650587082,
    0.017068300396203995,
    0.011354782618582249,
    -0.08182845264673233,
    0.05165482312440872,
    0.05760418251156807,
    -0.008563455194234848,
    0.15562401711940765,
    -0.0009894355898723006,
    0.012624711729586124,
    -0.06772841513156891,
    0.009808479808270931,
    -0.0034994184970855713,
    -0.015067427419126034,
    -4.8285439820681396e-33,
    -0.08127892017364502,
    -0.11353408545255661,
    -0.04695432633161545,
    -0.0535833016037941,
    0.005740211345255375,
    0.031487803906202316,
    -0.06597308814525604,
    -0.05266715586185455,
    0.05149166285991669,
    -0.03062378615140915,
    -0.034222349524497986,
    -0.030984435230493546,
    0.04412531107664108,
    0.04201715067028999,
    -0.057233091443777084,
    -0.10272962599992752,
    -0.026876572519540787,
    -0.023565353825688362,
    0.026792116463184357,
    -0.060285698622465134,
    0.0026404638774693012,
    0.07377088069915771,
    0.023118121549487114,
    0.06890314072370529,
    0.07338254153728485,
    -0.021813714876770973,
    -0.022209785878658295,
    0.03822053596377373,
    -0.025950832292437553,
    0.023532934486865997,
    0.0002755716850515455,
    -0.00429070508107543,
    -0.0034977286122739315,
    0.015517210587859154,
    -0.05180656537413597,
    0.06806141138076782,
    -0.02588537521660328,
    -0.061094194650650024,
    -0.0356132835149765,
    -0.04445355385541916,
    0.05841050669550896,
    0.0038455526810139418,
    0.015334201976656914,
    -0.04923021048307419,
    0.027872195467352867,
    0.0006499121082015336,
    -0.006936066318303347,
    -0.0013204908464103937,
    -0.017457855865359306,
    0.051742639392614365,
    0.02811824344098568,
    0.031215833500027657,
    0.04175010696053505,
    0.019361672922968864,
    -0.02967049553990364,
    0.03174600750207901,
    0.07814860343933105,
    0.02625245973467827,
    -0.01139270793646574,
    0.026445694267749786,
    -0.04965801164507866,
    0.12247045338153839,
    -0.03664419800043106,
    0.09204558283090591,
    -0.05926062539219856,
    -0.10277654975652695,
    -0.12095864117145538,
    -0.03325112909078598,
    -0.008597179315984249,
    -0.049935273826122284,
    -0.03787434101104736,
    -0.05829566717147827,
    0.023233696818351746,
    -0.04035882279276848,
    0.0042506372556090355,
    0.11137217283248901,
    0.013848550617694855,
    -0.07024112343788147,
    -0.0805496796965599,
    0.028499724343419075,
    0.021558977663517,
    0.04095953330397606,
    0.02536955662071705,
    0.036596447229385376,
    -0.03074258379638195,
    0.051858000457286835,
    0.033156100660562515,
    0.01943712867796421,
    0.021314073354005814,
    -0.03373399004340172,
    0.04424961656332016,
    -0.05548686161637306,
    -0.06281054019927979,
    4.283684756956063e-05,
    -0.08458609133958817,
    -5.48854615090022e-08,
    -0.03763505071401596,
    -0.06310669332742691,
    0.007853624410927296,
    0.028906606137752533,
    -0.004262341186404228,
    0.022389153018593788,
    0.0597105473279953,
    -0.10149078816175461,
    -0.03803262487053871,
    0.06732428073883057,
    -0.03484185412526131,
    0.09315773099660873,
    -0.11640697717666626,
    0.03893328830599785,
    -0.045963630080223083,
    -0.02685435675084591,
    -0.012050166726112366,
    -0.02623552456498146,
    -0.02291969396173954,
    0.035607676953077316,
    0.1217934861779213,
    0.0351993702352047,
    0.021822042763233185,
    -0.0042109075002372265,
    0.04733537137508392,
    0.014117848128080368,
    -0.0019220206886529922,
    -0.04549763724207878,
    0.051664311438798904,
    0.04425429552793503,
    -0.03389087691903114,
    0.053964853286743164,
    0.027188636362552643,
    -0.0786769688129425,
    0.025582509115338326,
    0.032316651195287704,
    0.06335513293743134,
    0.07657656818628311,
    0.006763439625501633,
    0.06093943864107132,
    -0.00851124431937933,
    -0.04741659760475159,
    0.038803912699222565,
    0.020185042172670364,
    0.0033722585067152977,
    -0.031493086367845535,
    -0.09698575735092163,
    0.030825776979327202,
    0.11857984215021133,
    -0.060155533254146576,
    0.07331393659114838,
    -0.030163228511810303,
    0.017178239300847054,
    0.005317076109349728,
    -0.018856244161725044,
    -0.08227863907814026,
    -0.054946355521678925,
    0.008694308809936047,
    -0.06514563411474228,
    -0.04080386087298393,
    0.056607697159051895,
    -0.06795735657215118,
    0.0026593096554279327,
    0.024484997615218163
  ]
}